-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Oct 20, 2019 at 03:18 PM
-- Server version: 10.1.38-MariaDB
-- PHP Version: 7.3.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `palmweb2562`
--

-- --------------------------------------------------------

--
-- Table structure for table `addressplam`
--

CREATE TABLE `addressplam` (
  `idAddressPlam` int(11) NOT NULL,
  `name` varchar(45) DEFAULT NULL,
  `Lat` float DEFAULT NULL,
  `Lon` float DEFAULT NULL,
  `rai` int(11) DEFAULT NULL,
  `quarterOfRai` int(11) DEFAULT NULL,
  `square_yard` int(11) DEFAULT NULL,
  `amphoe` text,
  `province` text,
  `addresss` varchar(45) DEFAULT NULL,
  `pathImage` varchar(100) NOT NULL,
  `nameImage` varchar(100) NOT NULL,
  `Farmer_idFarmer` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `addressplam`
--

INSERT INTO `addressplam` (`idAddressPlam`, `name`, `Lat`, `Lon`, `rai`, `quarterOfRai`, `square_yard`, `amphoe`, `province`, `addresss`, `pathImage`, `nameImage`, `Farmer_idFarmer`) VALUES
(1, 'orange', 13.7247, 100.633, 10, 3, 40, 'เมือง', 'กรุงเทพ', 'xx', 'xx', 'xx', 1),
(2, 'apple', 13.7247, 101.633, 14, 3, 40, 'บางจาก', 'สมุทรปราการ', 'xx', 'xx', 'xx', 2),
(3, 'banana', 13.7247, 101.633, 14, 3, 40, 'บางจาก', 'สมุทรปราการ', 'xx', 'xx', 'xx', 1),
(4, 'melon', 13.7247, 101.633, 14, 3, 40, 'บางจาก', 'สมุทรปราการ', 'xx', 'xx', 'xx', 3);

-- --------------------------------------------------------

--
-- Table structure for table `amphures`
--

CREATE TABLE `amphures` (
  `amphure_id` int(10) UNSIGNED NOT NULL,
  `code` varchar(4) COLLATE utf8_unicode_ci NOT NULL,
  `name_th` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `name_en` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `province_id` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `amphures`
--

INSERT INTO `amphures` (`amphure_id`, `code`, `name_th`, `name_en`, `province_id`) VALUES
(1, '1001', 'เขตพระนคร', 'Khet Phra Nakhon', 1),
(2, '1002', 'เขตดุสิต', 'Khet Dusit', 1),
(3, '1003', 'เขตหนองจอก', 'Khet Nong Chok', 1),
(4, '1004', 'เขตบางรัก', 'Khet Bang Rak', 1),
(5, '1005', 'เขตบางเขน', 'Khet Bang Khen', 1),
(6, '1006', 'เขตบางกะปิ', 'Khet Bang Kapi', 1),
(7, '1007', 'เขตปทุมวัน', 'Khet Pathum Wan', 1),
(8, '1008', 'เขตป้อมปราบศัตรูพ่าย', 'Khet Pom Prap Sattru Phai', 1),
(9, '1009', 'เขตพระโขนง', 'Khet Phra Khanong', 1),
(10, '1010', 'เขตมีนบุรี', 'Khet Min Buri', 1),
(11, '1011', 'เขตลาดกระบัง', 'Khet Lat Krabang', 1),
(12, '1012', 'เขตยานนาวา', 'Khet Yan Nawa', 1),
(13, '1013', 'เขตสัมพันธวงศ์', 'Khet Samphanthawong', 1),
(14, '1014', 'เขตพญาไท', 'Khet Phaya Thai', 1),
(15, '1015', 'เขตธนบุรี', 'Khet Thon Buri', 1),
(16, '1016', 'เขตบางกอกใหญ่', 'Khet Bangkok Yai', 1),
(17, '1017', 'เขตห้วยขวาง', 'Khet Huai Khwang', 1),
(18, '1018', 'เขตคลองสาน', 'Khet Khlong San', 1),
(19, '1019', 'เขตตลิ่งชัน', 'Khet Taling Chan', 1),
(20, '1020', 'เขตบางกอกน้อย', 'Khet Bangkok Noi', 1),
(21, '1021', 'เขตบางขุนเทียน', 'Khet Bang Khun Thian', 1),
(22, '1022', 'เขตภาษีเจริญ', 'Khet Phasi Charoen', 1),
(23, '1023', 'เขตหนองแขม', 'Khet Nong Khaem', 1),
(24, '1024', 'เขตราษฎร์บูรณะ', 'Khet Rat Burana', 1),
(25, '1025', 'เขตบางพลัด', 'Khet Bang Phlat', 1),
(26, '1026', 'เขตดินแดง', 'Khet Din Daeng', 1),
(27, '1027', 'เขตบึงกุ่ม', 'Khet Bueng Kum', 1),
(28, '1028', 'เขตสาทร', 'Khet Sathon', 1),
(29, '1029', 'เขตบางซื่อ', 'Khet Bang Sue', 1),
(30, '1030', 'เขตจตุจักร', 'Khet Chatuchak', 1),
(31, '1031', 'เขตบางคอแหลม', 'Khet Bang Kho Laem', 1),
(32, '1032', 'เขตประเวศ', 'Khet Prawet', 1),
(33, '1033', 'เขตคลองเตย', 'Khet Khlong Toei', 1),
(34, '1034', 'เขตสวนหลวง', 'Khet Suan Luang', 1),
(35, '1035', 'เขตจอมทอง', 'Khet Chom Thong', 1),
(36, '1036', 'เขตดอนเมือง', 'Khet Don Mueang', 1),
(37, '1037', 'เขตราชเทวี', 'Khet Ratchathewi', 1),
(38, '1038', 'เขตลาดพร้าว', 'Khet Lat Phrao', 1),
(39, '1039', 'เขตวัฒนา', 'Khet Watthana', 1),
(40, '1040', 'เขตบางแค', 'Khet Bang Khae', 1),
(41, '1041', 'เขตหลักสี่', 'Khet Lak Si', 1),
(42, '1042', 'เขตสายไหม', 'Khet Sai Mai', 1),
(43, '1043', 'เขตคันนายาว', 'Khet Khan Na Yao', 1),
(44, '1044', 'เขตสะพานสูง', 'Khet Saphan Sung', 1),
(45, '1045', 'เขตวังทองหลาง', 'Khet Wang Thonglang', 1),
(46, '1046', 'เขตคลองสามวา', 'Khet Khlong Sam Wa', 1),
(47, '1047', 'เขตบางนา', 'Khet Bang Na', 1),
(48, '1048', 'เขตทวีวัฒนา', 'Khet Thawi Watthana', 1),
(49, '1049', 'เขตทุ่งครุ', 'Khet Thung Khru', 1),
(50, '1050', 'เขตบางบอน', 'Khet Bang Bon', 1),
(51, '1081', 'บ้านทะวาย', 'Bantawai', 1),
(52, '1101', 'เมืองสมุทรปราการ', 'Mueang Samut Prakan', 2),
(53, '1102', 'บางบ่อ', 'Bang Bo', 2),
(54, '1103', 'บางพลี', 'Bang Phli', 2),
(55, '1104', 'พระประแดง', 'Phra Pradaeng', 2),
(56, '1105', 'พระสมุทรเจดีย์', 'Phra Samut Chedi', 2),
(57, '1106', 'บางเสาธง', 'Bang Sao Thong', 2),
(58, '1201', 'เมืองนนทบุรี', 'Mueang Nonthaburi', 3),
(59, '1202', 'บางกรวย', 'Bang Kruai', 3),
(60, '1203', 'บางใหญ่', 'Bang Yai', 3),
(61, '1204', 'บางบัวทอง', 'Bang Bua Thong', 3),
(62, '1205', 'ไทรน้อย', 'Sai Noi', 3),
(63, '1206', 'ปากเกร็ด', 'Pak Kret', 3),
(64, '1251', 'เทศบาลนครนนทบุรี (สาขาแขวงท่าทราย)', 'Tetsaban Nonthaburi', 3),
(65, '1297', 'เทศบาลเมืองปากเกร็ด', 'Tetsaban Pak Kret', 3),
(66, '1301', 'เมืองปทุมธานี', 'Mueang Pathum Thani', 4),
(67, '1302', 'คลองหลวง', 'Khlong Luang', 4),
(68, '1303', 'ธัญบุรี', 'Thanyaburi', 4),
(69, '1304', 'หนองเสือ', 'Nong Suea', 4),
(70, '1305', 'ลาดหลุมแก้ว', 'Lat Lum Kaeo', 4),
(71, '1306', 'ลำลูกกา', 'Lam Luk Ka', 4),
(72, '1307', 'สามโคก', 'Sam Khok', 4),
(73, '1351', 'ลำลูกกา (สาขาตำบลคูคต)', 'Khlong Luang(Kukod)', 4),
(74, '1401', 'พระนครศรีอยุธยา', 'Phra Nakhon Si Ayutthaya', 5),
(75, '1402', 'ท่าเรือ', 'Tha Ruea', 5),
(76, '1403', 'นครหลวง', 'Nakhon Luang', 5),
(77, '1404', 'บางไทร', 'Bang Sai', 5),
(78, '1405', 'บางบาล', 'Bang Ban', 5),
(79, '1406', 'บางปะอิน', 'Bang Pa-in', 5),
(80, '1407', 'บางปะหัน', 'Bang Pahan', 5),
(81, '1408', 'ผักไห่', 'Phak Hai', 5),
(82, '1409', 'ภาชี', 'Phachi', 5),
(83, '1410', 'ลาดบัวหลวง', 'Lat Bua Luang', 5),
(84, '1411', 'วังน้อย', 'Wang Noi', 5),
(85, '1412', 'เสนา', 'Sena', 5),
(86, '1413', 'บางซ้าย', 'Bang Sai', 5),
(87, '1414', 'อุทัย', 'Uthai', 5),
(88, '1415', 'มหาราช', 'Maha Rat', 5),
(89, '1416', 'บ้านแพรก', 'Ban Phraek', 5),
(90, '1501', 'เมืองอ่างทอง', 'Mueang Ang Thong', 6),
(91, '1502', 'ไชโย', 'Chaiyo', 6),
(92, '1503', 'ป่าโมก', 'Pa Mok', 6),
(93, '1504', 'โพธิ์ทอง', 'Pho Thong', 6),
(94, '1505', 'แสวงหา', 'Sawaeng Ha', 6),
(95, '1506', 'วิเศษชัยชาญ', 'Wiset Chai Chan', 6),
(96, '1507', 'สามโก้', 'Samko', 6),
(97, '1601', 'เมืองลพบุรี', 'Mueang Lop Buri', 7),
(98, '1602', 'พัฒนานิคม', 'Phatthana Nikhom', 7),
(99, '1603', 'โคกสำโรง', 'Khok Samrong', 7),
(100, '1604', 'ชัยบาดาล', 'Chai Badan', 7),
(101, '1605', 'ท่าวุ้ง', 'Tha Wung', 7),
(102, '1606', 'บ้านหมี่', 'Ban Mi', 7),
(103, '1607', 'ท่าหลวง', 'Tha Luang', 7),
(104, '1608', 'สระโบสถ์', 'Sa Bot', 7),
(105, '1609', 'โคกเจริญ', 'Khok Charoen', 7),
(106, '1610', 'ลำสนธิ', 'Lam Sonthi', 7),
(107, '1611', 'หนองม่วง', 'Nong Muang', 7),
(108, '1681', 'อ.บ้านเช่า  จ.ลพบุรี', 'Amphoe Ban Chao', 7),
(109, '1701', 'เมืองสิงห์บุรี', 'Mueang Sing Buri', 8),
(110, '1702', 'บางระจัน', 'Bang Rachan', 8),
(111, '1703', 'ค่ายบางระจัน', 'Khai Bang Rachan', 8),
(112, '1704', 'พรหมบุรี', 'Phrom Buri', 8),
(113, '1705', 'ท่าช้าง', 'Tha Chang', 8),
(114, '1706', 'อินทร์บุรี', 'In Buri', 8),
(115, '1801', 'เมืองชัยนาท', 'Mueang Chai Nat', 9),
(116, '1802', 'มโนรมย์', 'Manorom', 9),
(117, '1803', 'วัดสิงห์', 'Wat Sing', 9),
(118, '1804', 'สรรพยา', 'Sapphaya', 9),
(119, '1805', 'สรรคบุรี', 'Sankhaburi', 9),
(120, '1806', 'หันคา', 'Hankha', 9),
(121, '1807', 'หนองมะโมง', 'Nong Mamong', 9),
(122, '1808', 'เนินขาม', 'Noen Kham', 9),
(123, '1901', 'เมืองสระบุรี', 'Mueang Saraburi', 10),
(124, '1902', 'แก่งคอย', 'Kaeng Khoi', 10),
(125, '1903', 'หนองแค', 'Nong Khae', 10),
(126, '1904', 'วิหารแดง', 'Wihan Daeng', 10),
(127, '1905', 'หนองแซง', 'Nong Saeng', 10),
(128, '1906', 'บ้านหมอ', 'Ban Mo', 10),
(129, '1907', 'ดอนพุด', 'Don Phut', 10),
(130, '1908', 'หนองโดน', 'Nong Don', 10),
(131, '1909', 'พระพุทธบาท', 'Phra Phutthabat', 10),
(132, '1910', 'เสาไห้', 'Sao Hai', 10),
(133, '1911', 'มวกเหล็ก', 'Muak Lek', 10),
(134, '1912', 'วังม่วง', 'Wang Muang', 10),
(135, '1913', 'เฉลิมพระเกียรติ', 'Chaloem Phra Kiat', 10),
(136, '2001', 'เมืองชลบุรี', 'Mueang Chon Buri', 11),
(137, '2002', 'บ้านบึง', 'Ban Bueng', 11),
(138, '2003', 'หนองใหญ่', 'Nong Yai', 11),
(139, '2004', 'บางละมุง', 'Bang Lamung', 11),
(140, '2005', 'พานทอง', 'Phan Thong', 11),
(141, '2006', 'พนัสนิคม', 'Phanat Nikhom', 11),
(142, '2007', 'ศรีราชา', 'Si Racha', 11),
(143, '2008', 'เกาะสีชัง', 'Ko Sichang', 11),
(144, '2009', 'สัตหีบ', 'Sattahip', 11),
(145, '2010', 'บ่อทอง', 'Bo Thong', 11),
(146, '2011', 'เกาะจันทร์', 'Ko Chan', 11),
(147, '2051', 'สัตหีบ (สาขาตำบลบางเสร่)', 'Sattahip(Bang Sre)', 11),
(148, '2072', 'ท้องถิ่นเทศบาลเมืองหนองปรือ', 'Tong Tin Tetsaban Mueang Nong Prue', 11),
(149, '2093', 'เทศบาลตำบลแหลมฉบัง', 'Tetsaban Tambon Lamsabang', 11),
(150, '2099', 'เทศบาลเมืองชลบุรี', 'Mueang Chon Buri', 11),
(151, '2101', 'เมืองระยอง', 'Mueang Rayong', 12),
(152, '2102', 'บ้านฉาง', 'Ban Chang', 12),
(153, '2103', 'แกลง', 'Klaeng', 12),
(154, '2104', 'วังจันทร์', 'Wang Chan', 12),
(155, '2105', 'บ้านค่าย', 'Ban Khai', 12),
(156, '2106', 'ปลวกแดง', 'Pluak Daeng', 12),
(157, '2107', 'เขาชะเมา', 'Khao Chamao', 12),
(158, '2108', 'นิคมพัฒนา', 'Nikhom Phatthana', 12),
(159, '2151', 'สาขาตำบลมาบข่า', 'Saka Tambon Mabka', 12),
(160, '2201', 'เมืองจันทบุรี', 'Mueang Chanthaburi', 13),
(161, '2202', 'ขลุง', 'Khlung', 13),
(162, '2203', 'ท่าใหม่', 'Tha Mai', 13),
(163, '2204', 'โป่งน้ำร้อน', 'Pong Nam Ron', 13),
(164, '2205', 'มะขาม', 'Makham', 13),
(165, '2206', 'แหลมสิงห์', 'Laem Sing', 13),
(166, '2207', 'สอยดาว', 'Soi Dao', 13),
(167, '2208', 'แก่งหางแมว', 'Kaeng Hang Maeo', 13),
(168, '2209', 'นายายอาม', 'Na Yai Am', 13),
(169, '2210', 'เขาคิชฌกูฏ', 'Khoa Khitchakut', 13),
(170, '2281', 'กิ่ง อ.กำพุธ  จ.จันทบุรี', 'King Amphoe Kampud', 13),
(171, '2301', 'เมืองตราด', 'Mueang Trat', 14),
(172, '2302', 'คลองใหญ่', 'Khlong Yai', 14),
(173, '2303', 'เขาสมิง', 'Khao Saming', 14),
(174, '2304', 'บ่อไร่', 'Bo Rai', 14),
(175, '2305', 'แหลมงอบ', 'Laem Ngop', 14),
(176, '2306', 'เกาะกูด', 'Ko Kut', 14),
(177, '2307', 'เกาะช้าง', 'Ko Chang', 14),
(178, '2401', 'เมืองฉะเชิงเทรา', 'Mueang Chachoengsao', 15),
(179, '2402', 'บางคล้า', 'Bang Khla', 15),
(180, '2403', 'บางน้ำเปรี้ยว', 'Bang Nam Priao', 15),
(181, '2404', 'บางปะกง', 'Bang Pakong', 15),
(182, '2405', 'บ้านโพธิ์', 'Ban Pho', 15),
(183, '2406', 'พนมสารคาม', 'Phanom Sarakham', 15),
(184, '2407', 'ราชสาส์น', 'Ratchasan', 15),
(185, '2408', 'สนามชัยเขต', 'Sanam Chai Khet', 15),
(186, '2409', 'แปลงยาว', 'Plaeng Yao', 15),
(187, '2410', 'ท่าตะเกียบ', 'Tha Takiap', 15),
(188, '2411', 'คลองเขื่อน', 'Khlong Khuean', 15),
(189, '2501', 'เมืองปราจีนบุรี', 'Mueang Prachin Buri', 16),
(190, '2502', 'กบินทร์บุรี', 'Kabin Buri', 16),
(191, '2503', 'นาดี', 'Na Di', 16),
(192, '2504', 'สระแก้ว', 'Sa Kaeo', 16),
(193, '2505', 'วังน้ำเย็น', 'Wang Nam Yen', 16),
(194, '2506', 'บ้านสร้าง', 'Ban Sang', 16),
(195, '2507', 'ประจันตคาม', 'Prachantakham', 16),
(196, '2508', 'ศรีมหาโพธิ', 'Si Maha Phot', 16),
(197, '2509', 'ศรีมโหสถ', 'Si Mahosot', 16),
(198, '2510', 'อรัญประเทศ', 'Aranyaprathet', 16),
(199, '2511', 'ตาพระยา', 'Ta Phraya', 16),
(200, '2512', 'วัฒนานคร', 'Watthana Nakhon', 16),
(201, '2513', 'คลองหาด', 'Khlong Hat', 16),
(202, '2601', 'เมืองนครนายก', 'Mueang Nakhon Nayok', 17),
(203, '2602', 'ปากพลี', 'Pak Phli', 17),
(204, '2603', 'บ้านนา', 'Ban Na', 17),
(205, '2604', 'องครักษ์', 'Ongkharak', 17),
(206, '2701', 'เมืองสระแก้ว', 'Mueang Sa Kaeo', 18),
(207, '2702', 'คลองหาด', 'Khlong Hat', 18),
(208, '2703', 'ตาพระยา', 'Ta Phraya', 18),
(209, '2704', 'วังน้ำเย็น', 'Wang Nam Yen', 18),
(210, '2705', 'วัฒนานคร', 'Watthana Nakhon', 18),
(211, '2706', 'อรัญประเทศ', 'Aranyaprathet', 18),
(212, '2707', 'เขาฉกรรจ์', 'Khao Chakan', 18),
(213, '2708', 'โคกสูง', 'Khok Sung', 18),
(214, '2709', 'วังสมบูรณ์', 'Wang Sombun', 18),
(215, '3001', 'เมืองนครราชสีมา', 'Mueang Nakhon Ratchasima', 19),
(216, '3002', 'ครบุรี', 'Khon Buri', 19),
(217, '3003', 'เสิงสาง', 'Soeng Sang', 19),
(218, '3004', 'คง', 'Khong', 19),
(219, '3005', 'บ้านเหลื่อม', 'Ban Lueam', 19),
(220, '3006', 'จักราช', 'Chakkarat', 19),
(221, '3007', 'โชคชัย', 'Chok Chai', 19),
(222, '3008', 'ด่านขุนทด', 'Dan Khun Thot', 19),
(223, '3009', 'โนนไทย', 'Non Thai', 19),
(224, '3010', 'โนนสูง', 'Non Sung', 19),
(225, '3011', 'ขามสะแกแสง', 'Kham Sakaesaeng', 19),
(226, '3012', 'บัวใหญ่', 'Bua Yai', 19),
(227, '3013', 'ประทาย', 'Prathai', 19),
(228, '3014', 'ปักธงชัย', 'Pak Thong Chai', 19),
(229, '3015', 'พิมาย', 'Phimai', 19),
(230, '3016', 'ห้วยแถลง', 'Huai Thalaeng', 19),
(231, '3017', 'ชุมพวง', 'Chum Phuang', 19),
(232, '3018', 'สูงเนิน', 'Sung Noen', 19),
(233, '3019', 'ขามทะเลสอ', 'Kham Thale So', 19),
(234, '3020', 'สีคิ้ว', 'Sikhio', 19),
(235, '3021', 'ปากช่อง', 'Pak Chong', 19),
(236, '3022', 'หนองบุญมาก', 'Nong Bunnak', 19),
(237, '3023', 'แก้งสนามนาง', 'Kaeng Sanam Nang', 19),
(238, '3024', 'โนนแดง', 'Non Daeng', 19),
(239, '3025', 'วังน้ำเขียว', 'Wang Nam Khiao', 19),
(240, '3026', 'เทพารักษ์', 'Thepharak', 19),
(241, '3027', 'เมืองยาง', 'Mueang Yang', 19),
(242, '3028', 'พระทองคำ', 'Phra Thong Kham', 19),
(243, '3029', 'ลำทะเมนชัย', 'Lam Thamenchai', 19),
(244, '3030', 'บัวลาย', 'Bua Lai', 19),
(245, '3031', 'สีดา', 'Sida', 19),
(246, '3032', 'เฉลิมพระเกียรติ', 'Chaloem Phra Kiat', 19),
(247, '3049', 'ท้องถิ่นเทศบาลตำบลโพธิ์กลาง', 'Pho Krang', 19),
(248, '3051', 'สาขาตำบลมะค่า-พลสงคราม', 'Ma Ka-Pon Songkram', 19),
(249, '3081', 'โนนลาว', 'Non Lao', 19),
(250, '3101', 'เมืองบุรีรัมย์', 'Mueang Buri Ram', 20),
(251, '3102', 'คูเมือง', 'Khu Mueang', 20),
(252, '3103', 'กระสัง', 'Krasang', 20),
(253, '3104', 'นางรอง', 'Nang Rong', 20),
(254, '3105', 'หนองกี่', 'Nong Ki', 20),
(255, '3106', 'ละหานทราย', 'Lahan Sai', 20),
(256, '3107', 'ประโคนชัย', 'Prakhon Chai', 20),
(257, '3108', 'บ้านกรวด', 'Ban Kruat', 20),
(258, '3109', 'พุทไธสง', 'Phutthaisong', 20),
(259, '3110', 'ลำปลายมาศ', 'Lam Plai Mat', 20),
(260, '3111', 'สตึก', 'Satuek', 20),
(261, '3112', 'ปะคำ', 'Pakham', 20),
(262, '3113', 'นาโพธิ์', 'Na Pho', 20),
(263, '3114', 'หนองหงส์', 'Nong Hong', 20),
(264, '3115', 'พลับพลาชัย', 'Phlapphla Chai', 20),
(265, '3116', 'ห้วยราช', 'Huai Rat', 20),
(266, '3117', 'โนนสุวรรณ', 'Non Suwan', 20),
(267, '3118', 'ชำนิ', 'Chamni', 20),
(268, '3119', 'บ้านใหม่ไชยพจน์', 'Ban Mai Chaiyaphot', 20),
(269, '3120', 'โนนดินแดง', 'Din Daeng', 20),
(270, '3121', 'บ้านด่าน', 'Ban Dan', 20),
(271, '3122', 'แคนดง', 'Khaen Dong', 20),
(272, '3123', 'เฉลิมพระเกียรติ', 'Chaloem Phra Kiat', 20),
(273, '3201', 'เมืองสุรินทร์', 'Mueang Surin', 21),
(274, '3202', 'ชุมพลบุรี', 'Chumphon Buri', 21),
(275, '3203', 'ท่าตูม', 'Tha Tum', 21),
(276, '3204', 'จอมพระ', 'Chom Phra', 21),
(277, '3205', 'ปราสาท', 'Prasat', 21),
(278, '3206', 'กาบเชิง', 'Kap Choeng', 21),
(279, '3207', 'รัตนบุรี', 'Rattanaburi', 21),
(280, '3208', 'สนม', 'Sanom', 21),
(281, '3209', 'ศีขรภูมิ', 'Sikhoraphum', 21),
(282, '3210', 'สังขะ', 'Sangkha', 21),
(283, '3211', 'ลำดวน', 'Lamduan', 21),
(284, '3212', 'สำโรงทาบ', 'Samrong Thap', 21),
(285, '3213', 'บัวเชด', 'Buachet', 21),
(286, '3214', 'พนมดงรัก', 'Phanom Dong Rak', 21),
(287, '3215', 'ศรีณรงค์', 'Si Narong', 21),
(288, '3216', 'เขวาสินรินทร์', 'Khwao Sinarin', 21),
(289, '3217', 'โนนนารายณ์', 'Non Narai', 21),
(290, '3301', 'เมืองศรีสะเกษ', 'Mueang Si Sa Ket', 22),
(291, '3302', 'ยางชุมน้อย', 'Yang Chum Noi', 22),
(292, '3303', 'กันทรารมย์', 'Kanthararom', 22),
(293, '3304', 'กันทรลักษ์', 'Kantharalak', 22),
(294, '3305', 'ขุขันธ์', 'Khukhan', 22),
(295, '3306', 'ไพรบึง', 'Phrai Bueng', 22),
(296, '3307', 'ปรางค์กู่', 'Prang Ku', 22),
(297, '3308', 'ขุนหาญ', 'Khun Han', 22),
(298, '3309', 'ราษีไศล', 'Rasi Salai', 22),
(299, '3310', 'อุทุมพรพิสัย', 'Uthumphon Phisai', 22),
(300, '3311', 'บึงบูรพ์', 'Bueng Bun', 22),
(301, '3312', 'ห้วยทับทัน', 'Huai Thap Than', 22),
(302, '3313', 'โนนคูณ', 'Non Khun', 22),
(303, '3314', 'ศรีรัตนะ', 'Si Rattana', 22),
(304, '3315', 'น้ำเกลี้ยง', 'Si Rattana', 22),
(305, '3316', 'วังหิน', 'Wang Hin', 22),
(306, '3317', 'ภูสิงห์', 'Phu Sing', 22),
(307, '3318', 'เมืองจันทร์', 'Mueang Chan', 22),
(308, '3319', 'เบญจลักษ์', 'Benchalak', 22),
(309, '3320', 'พยุห์', 'Phayu', 22),
(310, '3321', 'โพธิ์ศรีสุวรรณ', 'Pho Si Suwan', 22),
(311, '3322', 'ศิลาลาด', 'Sila Lat', 22),
(312, '3401', 'เมืองอุบลราชธานี', 'Mueang Ubon Ratchathani', 23),
(313, '3402', 'ศรีเมืองใหม่', 'Si Mueang Mai', 23),
(314, '3403', 'โขงเจียม', 'Khong Chiam', 23),
(315, '3404', 'เขื่องใน', 'Khueang Nai', 23),
(316, '3405', 'เขมราฐ', 'Khemarat', 23),
(317, '3406', 'ชานุมาน', 'Shanuman', 23),
(318, '3407', 'เดชอุดม', 'Det Udom', 23),
(319, '3408', 'นาจะหลวย', 'Na Chaluai', 23),
(320, '3409', 'น้ำยืน', 'Nam Yuen', 23),
(321, '3410', 'บุณฑริก', 'Buntharik', 23),
(322, '3411', 'ตระการพืชผล', 'Trakan Phuet Phon', 23),
(323, '3412', 'กุดข้าวปุ้น', 'Kut Khaopun', 23),
(324, '3413', 'พนา', 'Phana', 23),
(325, '3414', 'ม่วงสามสิบ', 'Muang Sam Sip', 23),
(326, '3415', 'วารินชำราบ', 'Warin Chamrap', 23),
(327, '3416', 'อำนาจเจริญ', 'Amnat Charoen', 23),
(328, '3417', 'เสนางคนิคม', 'Senangkhanikhom', 23),
(329, '3418', 'หัวตะพาน', 'Hua Taphan', 23),
(330, '3419', 'พิบูลมังสาหาร', 'Phibun Mangsahan', 23),
(331, '3420', 'ตาลสุม', 'Tan Sum', 23),
(332, '3421', 'โพธิ์ไทร', 'Pho Sai', 23),
(333, '3422', 'สำโรง', 'Samrong', 23),
(334, '3423', 'กิ่งอำเภอลืออำนาจ', 'King Amphoe Lue Amnat', 23),
(335, '3424', 'ดอนมดแดง', 'Don Mot Daeng', 23),
(336, '3425', 'สิรินธร', 'Sirindhorn', 23),
(337, '3426', 'ทุ่งศรีอุดม', 'Thung Si Udom', 23),
(338, '3427', 'ปทุมราชวงศา', 'Pathum Ratchawongsa', 23),
(339, '3428', 'กิ่งอำเภอศรีหลักชัย', 'King Amphoe Sri Lunk Chai', 23),
(340, '3429', 'นาเยีย', 'Na Yia', 23),
(341, '3430', 'นาตาล', 'Na Tan', 23),
(342, '3431', 'เหล่าเสือโก้ก', 'Lao Suea Kok', 23),
(343, '3432', 'สว่างวีระวงศ์', 'Sawang Wirawong', 23),
(344, '3433', 'น้ำขุ่น', 'Nam Khun', 23),
(345, '3481', 'อ.สุวรรณวารี  จ.อุบลราชธานี', 'Suwan Wari', 23),
(346, '3501', 'เมืองยโสธร', 'Mueang Yasothon', 24),
(347, '3502', 'ทรายมูล', 'Sai Mun', 24),
(348, '3503', 'กุดชุม', 'Kut Chum', 24),
(349, '3504', 'คำเขื่อนแก้ว', 'Kham Khuean Kaeo', 24),
(350, '3505', 'ป่าติ้ว', 'Pa Tio', 24),
(351, '3506', 'มหาชนะชัย', 'Maha Chana Chai', 24),
(352, '3507', 'ค้อวัง', 'Kho Wang', 24),
(353, '3508', 'เลิงนกทา', 'Loeng Nok Tha', 24),
(354, '3509', 'ไทยเจริญ', 'Thai Charoen', 24),
(355, '3601', 'เมืองชัยภูมิ', 'Mueang Chaiyaphum', 25),
(356, '3602', 'บ้านเขว้า', 'Ban Khwao', 25),
(357, '3603', 'คอนสวรรค์', 'Khon Sawan', 25),
(358, '3604', 'เกษตรสมบูรณ์', 'Kaset Sombun', 25),
(359, '3605', 'หนองบัวแดง', 'Nong Bua Daeng', 25),
(360, '3606', 'จัตุรัส', 'Chatturat', 25),
(361, '3607', 'บำเหน็จณรงค์', 'Bamnet Narong', 25),
(362, '3608', 'หนองบัวระเหว', 'Nong Bua Rawe', 25),
(363, '3609', 'เทพสถิต', 'Thep Sathit', 25),
(364, '3610', 'ภูเขียว', 'Phu Khiao', 25),
(365, '3611', 'บ้านแท่น', 'Ban Thaen', 25),
(366, '3612', 'แก้งคร้อ', 'Kaeng Khro', 25),
(367, '3613', 'คอนสาร', 'Khon San', 25),
(368, '3614', 'ภักดีชุมพล', 'Phakdi Chumphon', 25),
(369, '3615', 'เนินสง่า', 'Noen Sa-nga', 25),
(370, '3616', 'ซับใหญ่', 'Sap Yai', 25),
(371, '3651', 'เมืองชัยภูมิ (สาขาตำบลโนนสำราญ)', 'Mueang Chaiyaphum(Non Sumran)', 25),
(372, '3652', 'สาขาตำบลบ้านหว่าเฒ่า', 'Ban Wha Tao', 25),
(373, '3653', 'หนองบัวแดง (สาขาตำบลวังชมภู)', 'Nong Bua Daeng', 25),
(374, '3654', 'กิ่งอำเภอซับใหญ่ (สาขาตำบลซับใหญ่)', 'King Amphoe Sap Yai', 25),
(375, '3655', 'สาขาตำบลโคกเพชร', 'Coke Phet', 25),
(376, '3656', 'เทพสถิต (สาขาตำบลนายางกลัก)', 'Thep Sathit', 25),
(377, '3657', 'บ้านแท่น (สาขาตำบลบ้านเต่า)', 'Ban Thaen', 25),
(378, '3658', 'แก้งคร้อ (สาขาตำบลท่ามะไฟหวาน)', 'Kaeng Khro', 25),
(379, '3659', 'คอนสาร (สาขาตำบลโนนคูณ)', 'Khon San', 25),
(380, '3701', 'เมืองอำนาจเจริญ', 'Mueang Amnat Charoen', 26),
(381, '3702', 'ชานุมาน', 'Chanuman', 26),
(382, '3703', 'ปทุมราชวงศา', 'Pathum Ratchawongsa', 26),
(383, '3704', 'พนา', 'Phana', 26),
(384, '3705', 'เสนางคนิคม', 'Senangkhanikhom', 26),
(385, '3706', 'หัวตะพาน', 'Hua Taphan', 26),
(386, '3707', 'ลืออำนาจ', 'Lue Amnat', 26),
(387, '3901', 'เมืองหนองบัวลำภู', 'Mueang Nong Bua Lam Phu', 27),
(388, '3902', 'นากลาง', 'Na Klang', 27),
(389, '3903', 'โนนสัง', 'Non Sang', 27),
(390, '3904', 'ศรีบุญเรือง', 'Si Bun Rueang', 27),
(391, '3905', 'สุวรรณคูหา', 'Suwannakhuha', 27),
(392, '3906', 'นาวัง', 'Na Wang', 27),
(393, '4001', 'เมืองขอนแก่น', 'Mueang Khon Kaen', 28),
(394, '4002', 'บ้านฝาง', 'Ban Fang', 28),
(395, '4003', 'พระยืน', 'Phra Yuen', 28),
(396, '4004', 'หนองเรือ', 'Nong Ruea', 28),
(397, '4005', 'ชุมแพ', 'Chum Phae', 28),
(398, '4006', 'สีชมพู', 'Si Chomphu', 28),
(399, '4007', 'น้ำพอง', 'Nam Phong', 28),
(400, '4008', 'อุบลรัตน์', 'Ubolratana', 28),
(401, '4009', 'กระนวน', 'Kranuan', 28),
(402, '4010', 'บ้านไผ่', 'Ban Phai', 28),
(403, '4011', 'เปือยน้อย', 'Pueai Noi', 28),
(404, '4012', 'พล', 'Phon', 28),
(405, '4013', 'แวงใหญ่', 'Waeng Yai', 28),
(406, '4014', 'แวงน้อย', 'Waeng Noi', 28),
(407, '4015', 'หนองสองห้อง', 'Nong Song Hong', 28),
(408, '4016', 'ภูเวียง', 'Phu Wiang', 28),
(409, '4017', 'มัญจาคีรี', 'Mancha Khiri', 28),
(410, '4018', 'ชนบท', 'Chonnabot', 28),
(411, '4019', 'เขาสวนกวาง', 'Khao Suan Kwang', 28),
(412, '4020', 'ภูผาม่าน', 'Phu Pha Man', 28),
(413, '4021', 'ซำสูง', 'Sam Sung', 28),
(414, '4022', 'โคกโพธิ์ไชย', 'Khok Pho Chai', 28),
(415, '4023', 'หนองนาคำ', 'Nong Na Kham', 28),
(416, '4024', 'บ้านแฮด', 'Ban Haet', 28),
(417, '4025', 'โนนศิลา', 'Non Sila', 28),
(418, '4029', 'เวียงเก่า', 'Wiang Kao', 28),
(419, '4068', 'ท้องถิ่นเทศบาลตำบลบ้านเป็ด', 'Ban Pet', 28),
(420, '4098', 'เทศบาลตำบลเมืองพล', 'Tet Saban Tambon Muang Phon', 28),
(421, '4101', 'เมืองอุดรธานี', 'Mueang Udon Thani', 29),
(422, '4102', 'กุดจับ', 'Kut Chap', 29),
(423, '4103', 'หนองวัวซอ', 'Nong Wua So', 29),
(424, '4104', 'กุมภวาปี', 'Kumphawapi', 29),
(425, '4105', 'โนนสะอาด', 'Non Sa-at', 29),
(426, '4106', 'หนองหาน', 'Nong Han', 29),
(427, '4107', 'ทุ่งฝน', 'Thung Fon', 29),
(428, '4108', 'ไชยวาน', 'Chai Wan', 29),
(429, '4109', 'ศรีธาตุ', 'Si That', 29),
(430, '4110', 'วังสามหมอ', 'Wang Sam Mo', 29),
(431, '4111', 'บ้านดุง', 'Ban Dung', 29),
(432, '4112', 'หนองบัวลำภู', 'Nong Bua Lam Phu', 29),
(433, '4113', 'ศรีบุญเรือง', 'Si Bun Rueang', 29),
(434, '4114', 'นากลาง', 'Na Klang', 29),
(435, '4115', 'สุวรรณคูหา', 'Suwannakhuha', 29),
(436, '4116', 'โนนสัง', 'Non Sang', 29),
(437, '4117', 'บ้านผือ', 'Ban Phue', 29),
(438, '4118', 'น้ำโสม', 'Nam Som', 29),
(439, '4119', 'เพ็ญ', 'Phen', 29),
(440, '4120', 'สร้างคอม', 'Sang Khom', 29),
(441, '4121', 'หนองแสง', 'Nong Saeng', 29),
(442, '4122', 'นายูง', 'Na Yung', 29),
(443, '4123', 'พิบูลย์รักษ์', 'Phibun Rak', 29),
(444, '4124', 'กู่แก้ว', 'Ku Kaeo', 29),
(445, '4125', 'ประจักษ์ศิลปาคม', 'rachak-sinlapakhom', 29),
(446, '4201', 'เมืองเลย', 'Mueang Loei', 30),
(447, '4202', 'นาด้วง', 'Na Duang', 30),
(448, '4203', 'เชียงคาน', 'Chiang Khan', 30),
(449, '4204', 'ปากชม', 'Pak Chom', 30),
(450, '4205', 'ด่านซ้าย', 'Dan Sai', 30),
(451, '4206', 'นาแห้ว', 'Na Haeo', 30),
(452, '4207', 'ภูเรือ', 'Phu Ruea', 30),
(453, '4208', 'ท่าลี่', 'Tha Li', 30),
(454, '4209', 'วังสะพุง', 'Wang Saphung', 30),
(455, '4210', 'ภูกระดึง', 'Phu Kradueng', 30),
(456, '4211', 'ภูหลวง', 'Phu Luang', 30),
(457, '4212', 'ผาขาว', 'Pha Khao', 30),
(458, '4213', 'เอราวัณ', 'Erawan', 30),
(459, '4214', 'หนองหิน', 'Nong Hin', 30),
(460, '4301', 'เมืองหนองคาย', 'Mueang Nong Khai', 31),
(461, '4302', 'ท่าบ่อ', 'Tha Bo', 31),
(464, '4305', 'โพนพิสัย', 'Phon Phisai', 31),
(466, '4307', 'ศรีเชียงใหม่', 'Si Chiang Mai', 31),
(467, '4308', 'สังคม', 'Sangkhom', 31),
(473, '4314', 'สระใคร', 'Sakhrai', 31),
(474, '4315', 'เฝ้าไร่', 'Fao Rai', 31),
(475, '4316', 'รัตนวาปี', 'Rattanawapi', 31),
(476, '4317', 'โพธิ์ตาก', 'Pho Tak', 31),
(477, '4401', 'เมืองมหาสารคาม', 'Mueang Maha Sarakham', 32),
(478, '4402', 'แกดำ', 'Kae Dam', 32),
(479, '4403', 'โกสุมพิสัย', 'Kosum Phisai', 32),
(480, '4404', 'กันทรวิชัย', 'Kantharawichai', 32),
(481, '4405', 'เชียงยืน', 'Kantharawichai', 32),
(482, '4406', 'บรบือ', 'Borabue', 32),
(483, '4407', 'นาเชือก', 'Na Chueak', 32),
(484, '4408', 'พยัคฆภูมิพิสัย', 'Phayakkhaphum Phisai', 32),
(485, '4409', 'วาปีปทุม', 'Wapi Pathum', 32),
(486, '4410', 'นาดูน', 'Na Dun', 32),
(487, '4411', 'ยางสีสุราช', 'Yang Sisurat', 32),
(488, '4412', 'กุดรัง', 'Kut Rang', 32),
(489, '4413', 'ชื่นชม', 'Chuen Chom', 32),
(490, '4481', 'หลุบ', 'Lub', 32),
(491, '4501', 'เมืองร้อยเอ็ด', 'Mueang Roi Et', 33),
(492, '4502', 'เกษตรวิสัย', 'Kaset Wisai', 33),
(493, '4503', 'ปทุมรัตต์', 'Pathum Rat', 33),
(494, '4504', 'จตุรพักตรพิมาน', 'Chaturaphak Phiman', 33),
(495, '4505', 'ธวัชบุรี', 'Thawat Buri', 33),
(496, '4506', 'พนมไพร', 'Phanom Phrai', 33),
(497, '4507', 'โพนทอง', 'Phon Thong', 33),
(498, '4508', 'โพธิ์ชัย', 'Pho Chai', 33),
(499, '4509', 'หนองพอก', 'Nong Phok', 33),
(500, '4510', 'เสลภูมิ', 'Selaphum', 33),
(501, '4511', 'สุวรรณภูมิ', 'Suwannaphum', 33),
(502, '4512', 'เมืองสรวง', 'Mueang Suang', 33),
(503, '4513', 'โพนทราย', 'Phon Sai', 33),
(504, '4514', 'อาจสามารถ', 'At Samat', 33),
(505, '4515', 'เมยวดี', 'Moei Wadi', 33),
(506, '4516', 'ศรีสมเด็จ', 'Si Somdet', 33),
(507, '4517', 'จังหาร', 'Changhan', 33),
(508, '4518', 'เชียงขวัญ', 'Chiang Khwan', 33),
(509, '4519', 'หนองฮี', 'Nong Hi', 33),
(510, '4520', 'ทุ่งเขาหลวง', 'Thung Khao Luangกิ่', 33),
(511, '4601', 'เมืองกาฬสินธุ์', 'Mueang Kalasin', 34),
(512, '4602', 'นามน', 'Na Mon', 34),
(513, '4603', 'กมลาไสย', 'Kamalasai', 34),
(514, '4604', 'ร่องคำ', 'Rong Kham', 34),
(515, '4605', 'กุฉินารายณ์', 'Kuchinarai', 34),
(516, '4606', 'เขาวง', 'Khao Wong', 34),
(517, '4607', 'ยางตลาด', 'Yang Talat', 34),
(518, '4608', 'ห้วยเม็ก', 'Huai Mek', 34),
(519, '4609', 'สหัสขันธ์', 'Sahatsakhan', 34),
(520, '4610', 'คำม่วง', 'Kham Muang', 34),
(521, '4611', 'ท่าคันโท', 'Tha Khantho', 34),
(522, '4612', 'หนองกุงศรี', 'Nong Kung Si', 34),
(523, '4613', 'สมเด็จ', 'Somdet', 34),
(524, '4614', 'ห้วยผึ้ง', 'Huai Phueng', 34),
(525, '4615', 'สามชัย', 'Sam Chai', 34),
(526, '4616', 'นาคู', 'Na Khu', 34),
(527, '4617', 'ดอนจาน', 'Don Chan', 34),
(528, '4618', 'ฆ้องชัย', 'Khong Chai', 34),
(529, '4701', 'เมืองสกลนคร', 'Mueang Sakon Nakhon', 35),
(530, '4702', 'กุสุมาลย์', 'Kusuman', 35),
(531, '4703', 'กุดบาก', 'Kut Bak', 35),
(532, '4704', 'พรรณานิคม', 'Phanna Nikhom', 35),
(533, '4705', 'พังโคน', 'Phang Khon', 35),
(534, '4706', 'วาริชภูมิ', 'Waritchaphum', 35),
(535, '4707', 'นิคมน้ำอูน', 'Nikhom Nam Un', 35),
(536, '4708', 'วานรนิวาส', 'Wanon Niwat', 35),
(537, '4709', 'คำตากล้า', 'Kham Ta Kla', 35),
(538, '4710', 'บ้านม่วง', 'Ban Muang', 35),
(539, '4711', 'อากาศอำนวย', 'Akat Amnuai', 35),
(540, '4712', 'สว่างแดนดิน', 'Sawang Daen Din', 35),
(541, '4713', 'ส่องดาว', 'Song Dao', 35),
(542, '4714', 'เต่างอย', 'Tao Ngoi', 35),
(543, '4715', 'โคกศรีสุพรรณ', 'Khok Si Suphan', 35),
(544, '4716', 'เจริญศิลป์', 'Charoen Sin', 35),
(545, '4717', 'โพนนาแก้ว', 'Phon Na Kaeo', 35),
(546, '4718', 'ภูพาน', 'Phu Phan', 35),
(547, '4751', 'วานรนิวาส (สาขาตำบลกุดเรือคำ)', 'Wanon Niwat', 35),
(548, '4781', 'อ.บ้านหัน  จ.สกลนคร', 'Banhan', 35),
(549, '4801', 'เมืองนครพนม', 'Mueang Nakhon Phanom', 36),
(550, '4802', 'ปลาปาก', 'Pla Pak', 36),
(551, '4803', 'ท่าอุเทน', 'Tha Uthen', 36),
(552, '4804', 'บ้านแพง', 'Ban Phaeng', 36),
(553, '4805', 'ธาตุพนม', 'That Phanom', 36),
(554, '4806', 'เรณูนคร', 'Renu Nakhon', 36),
(555, '4807', 'นาแก', 'Na Kae', 36),
(556, '4808', 'ศรีสงคราม', 'Si Songkhram', 36),
(557, '4809', 'นาหว้า', 'Na Wa', 36),
(558, '4810', 'โพนสวรรค์', 'Phon Sawan', 36),
(559, '4811', 'นาทม', 'Na Thom', 36),
(560, '4812', 'วังยาง', 'Wang Yang', 36),
(561, '4901', 'เมืองมุกดาหาร', 'Mueang Mukdahan', 37),
(562, '4902', 'นิคมคำสร้อย', 'Nikhom Kham Soi', 37),
(563, '4903', 'ดอนตาล', 'Don Tan', 37),
(564, '4904', 'ดงหลวง', 'Dong Luang', 37),
(565, '4905', 'คำชะอี', 'Khamcha-i', 37),
(566, '4906', 'หว้านใหญ่', 'Wan Yai', 37),
(567, '4907', 'หนองสูง', 'Nong Sung', 37),
(568, '5001', 'เมืองเชียงใหม่', 'Mueang Chiang Mai', 38),
(569, '5002', 'จอมทอง', 'Chom Thong', 38),
(570, '5003', 'แม่แจ่ม', 'Mae Chaem', 38),
(571, '5004', 'เชียงดาว', 'Chiang Dao', 38),
(572, '5005', 'ดอยสะเก็ด', 'Doi Saket', 38),
(573, '5006', 'แม่แตง', 'Mae Taeng', 38),
(574, '5007', 'แม่ริม', 'Mae Rim', 38),
(575, '5008', 'สะเมิง', 'Samoeng', 38),
(576, '5009', 'ฝาง', 'Fang', 38),
(577, '5010', 'แม่อาย', 'Mae Ai', 38),
(578, '5011', 'พร้าว', 'Phrao', 38),
(579, '5012', 'สันป่าตอง', 'San Pa Tong', 38),
(580, '5013', 'สันกำแพง', 'San Kamphaeng', 38),
(581, '5014', 'สันทราย', 'San Sai', 38),
(582, '5015', 'หางดง', 'Hang Dong', 38),
(583, '5016', 'ฮอด', 'Hot', 38),
(584, '5017', 'ดอยเต่า', 'Doi Tao', 38),
(585, '5018', 'อมก๋อย', 'Omkoi', 38),
(586, '5019', 'สารภี', 'Saraphi', 38),
(587, '5020', 'เวียงแหง', 'Wiang Haeng', 38),
(588, '5021', 'ไชยปราการ', 'Chai Prakan', 38),
(589, '5022', 'แม่วาง', 'Mae Wang', 38),
(590, '5023', 'แม่ออน', 'Mae On', 38),
(591, '5024', 'ดอยหล่อ', 'Doi Lo', 38),
(592, '5051', 'เทศบาลนครเชียงใหม่ (สาขาแขวงกาลวิละ)', 'Tet Saban Nakorn Chiangmai(Kan lawi la)', 38),
(593, '5052', 'เทศบาลนครเชียงใหม่ (สาขาแขวงศรีวิชั)', 'Tet Saban Nakorn Chiangmai(Sri Wi)', 38),
(594, '5053', 'เทศบาลนครเชียงใหม่ (สาขาเม็งราย)', 'Tet Saban Nakorn Chiangmai(Meng Rai)', 38),
(595, '5101', 'เมืองลำพูน', 'Mueang Lamphun', 39),
(596, '5102', 'แม่ทา', 'Mae Tha', 39),
(597, '5103', 'บ้านโฮ่ง', 'Ban Hong', 39),
(598, '5104', 'ลี้', 'Li', 39),
(599, '5105', 'ทุ่งหัวช้าง', 'Thung Hua Chang', 39),
(600, '5106', 'ป่าซาง', 'Pa Sang', 39),
(601, '5107', 'บ้านธิ', 'Ban Thi', 39),
(602, '5108', 'เวียงหนองล่อง', 'Wiang Nong Long', 39),
(603, '5201', 'เมืองลำปาง', 'Mueang Lampang', 40),
(604, '5202', 'แม่เมาะ', 'Mae Mo', 40),
(605, '5203', 'เกาะคา', 'Ko Kha', 40),
(606, '5204', 'เสริมงาม', 'Soem Ngam', 40),
(607, '5205', 'งาว', 'Ngao', 40),
(608, '5206', 'แจ้ห่ม', 'Chae Hom', 40),
(609, '5207', 'วังเหนือ', 'Wang Nuea', 40),
(610, '5208', 'เถิน', 'Thoen', 40),
(611, '5209', 'แม่พริก', 'Mae Phrik', 40),
(612, '5210', 'แม่ทะ', 'Mae Tha', 40),
(613, '5211', 'สบปราบ', 'Sop Prap', 40),
(614, '5212', 'ห้างฉัตร', 'Hang Chat', 40),
(615, '5213', 'เมืองปาน', 'Mueang Pan', 40),
(616, '5301', 'เมืองอุตรดิตถ์', 'Mueang Uttaradit', 41),
(617, '5302', 'ตรอน', 'Tron', 41),
(618, '5303', 'ท่าปลา', 'Tha Pla', 41),
(619, '5304', 'น้ำปาด', 'Nam Pat', 41),
(620, '5305', 'ฟากท่า', 'Fak Tha', 41),
(621, '5306', 'บ้านโคก', 'Ban Khok', 41),
(622, '5307', 'พิชัย', 'Phichai', 41),
(623, '5308', 'ลับแล', 'Laplae', 41),
(624, '5309', 'ทองแสนขัน', 'Thong Saen Khan', 41),
(625, '5401', 'เมืองแพร่', 'Mueang Phrae', 42),
(626, '5402', 'ร้องกวาง', 'Rong Kwang', 42),
(627, '5403', 'ลอง', 'Long', 42),
(628, '5404', 'สูงเม่น', 'Sung Men', 42),
(629, '5405', 'เด่นชัย', 'Den Chai', 42),
(630, '5406', 'สอง', 'Song', 42),
(631, '5407', 'วังชิ้น', 'Wang Chin', 42),
(632, '5408', 'หนองม่วงไข่', 'Nong Muang Khai', 42),
(633, '5501', 'เมืองน่าน', 'Mueang Nan', 43),
(634, '5502', 'แม่จริม', 'Mae Charim', 43),
(635, '5503', 'บ้านหลวง', 'Ban Luang', 43),
(636, '5504', 'นาน้อย', 'Na Noi', 43),
(637, '5505', 'ปัว', 'Pua', 43),
(638, '5506', 'ท่าวังผา', 'Tha Wang Pha', 43),
(639, '5507', 'เวียงสา', 'Wiang Sa', 43),
(640, '5508', 'ทุ่งช้าง', 'Thung Chang', 43),
(641, '5509', 'เชียงกลาง', 'Chiang Klang', 43),
(642, '5510', 'นาหมื่น', 'Na Muen', 43),
(643, '5511', 'สันติสุข', 'Santi Suk', 43),
(644, '5512', 'บ่อเกลือ', 'Bo Kluea', 43),
(645, '5513', 'สองแคว', 'Song Khwae', 43),
(646, '5514', 'ภูเพียง', 'Phu Phiang', 43),
(647, '5515', 'เฉลิมพระเกียรติ', 'Chaloem Phra Kiat', 43),
(648, '5601', 'เมืองพะเยา', 'Mueang Phayao', 44),
(649, '5602', 'จุน', 'Chun', 44),
(650, '5603', 'เชียงคำ', 'Chiang Kham', 44),
(651, '5604', 'เชียงม่วน', 'Chiang Muan', 44),
(652, '5605', 'ดอกคำใต้', 'Dok Khamtai', 44),
(653, '5606', 'ปง', 'Pong', 44),
(654, '5607', 'แม่ใจ', 'Mae Chai', 44),
(655, '5608', 'ภูซาง', 'Phu Sang', 44),
(656, '5609', 'ภูกามยาว', 'Phu Kamyao', 44),
(657, '5701', 'เมืองเชียงราย', 'Mueang Chiang Rai', 45),
(658, '5702', 'เวียงชัย', 'Wiang Chai', 45),
(659, '5703', 'เชียงของ', 'Chiang Khong', 45),
(660, '5704', 'เทิง', 'Thoeng', 45),
(661, '5705', 'พาน', 'Phan', 45),
(662, '5706', 'ป่าแดด', 'Pa Daet', 45),
(663, '5707', 'แม่จัน', 'Mae Chan', 45),
(664, '5708', 'เชียงแสน', 'Chiang Saen', 45),
(665, '5709', 'แม่สาย', 'Mae Sai', 45),
(666, '5710', 'แม่สรวย', 'Mae Suai', 45),
(667, '5711', 'เวียงป่าเป้า', 'Wiang Pa Pao', 45),
(668, '5712', 'พญาเม็งราย', 'Phaya Mengrai', 45),
(669, '5713', 'เวียงแก่น', 'Wiang Kaen', 45),
(670, '5714', 'ขุนตาล', 'Khun Tan', 45),
(671, '5715', 'แม่ฟ้าหลวง', 'Mae Fa Luang', 45),
(672, '5716', 'แม่ลาว', 'Mae Lao', 45),
(673, '5717', 'เวียงเชียงรุ้ง', 'Wiang Chiang Rung', 45),
(674, '5718', 'ดอยหลวง', 'Doi Luang', 45),
(675, '5801', 'เมืองแม่ฮ่องสอน', 'Mueang Mae Hong Son', 46),
(676, '5802', 'ขุนยวม', 'Khun Yuam', 46),
(677, '5803', 'ปาย', 'Pai', 46),
(678, '5804', 'แม่สะเรียง', 'Mae Sariang', 46),
(679, '5805', 'แม่ลาน้อย', 'Mae La Noi', 46),
(680, '5806', 'สบเมย', 'Sop Moei', 46),
(681, '5807', 'ปางมะผ้า', 'Pang Mapha', 46),
(682, '5881', 'อ.ม่วยต่อ  จ.แม่ฮ่องสอน', 'Muen Tor', 46),
(683, '6001', 'เมืองนครสวรรค์', 'Mueang Nakhon Sawan', 47),
(684, '6002', 'โกรกพระ', 'Krok Phra', 47),
(685, '6003', 'ชุมแสง', 'Chum Saeng', 47),
(686, '6004', 'หนองบัว', 'Nong Bua', 47),
(687, '6005', 'บรรพตพิสัย', 'Banphot Phisai', 47),
(688, '6006', 'เก้าเลี้ยว', 'Kao Liao', 47),
(689, '6007', 'ตาคลี', 'Takhli', 47),
(690, '6008', 'ท่าตะโก', 'Takhli', 47),
(691, '6009', 'ไพศาลี', 'Phaisali', 47),
(692, '6010', 'พยุหะคีรี', 'Phayuha Khiri', 47),
(693, '6011', 'ลาดยาว', 'Phayuha Khiri', 47),
(694, '6012', 'ตากฟ้า', 'Tak Fa', 47),
(695, '6013', 'แม่วงก์', 'Mae Wong', 47),
(696, '6014', 'แม่เปิน', 'Mae Poen', 47),
(697, '6015', 'ชุมตาบง', 'Chum Ta Bong', 47),
(698, '6051', 'สาขาตำบลห้วยน้ำหอม', 'Huen Nam Hom', 47),
(699, '6052', 'กิ่งอำเภอชุมตาบง (สาขาตำบลชุมตาบง)', 'Chum Ta Bong', 47),
(700, '6053', 'แม่วงก์ (สาขาตำบลแม่เล่ย์)', 'Mea Ley', 47),
(701, '6101', 'เมืองอุทัยธานี', 'Mueang Uthai Thani', 48),
(702, '6102', 'ทัพทัน', 'Thap Than', 48),
(703, '6103', 'สว่างอารมณ์', 'Sawang Arom', 48),
(704, '6104', 'หนองฉาง', 'Nong Chang', 48),
(705, '6105', 'หนองขาหย่าง', 'Nong Khayang', 48),
(706, '6106', 'บ้านไร่', 'Ban Rai', 48),
(707, '6107', 'ลานสัก', 'Lan Sak', 48),
(708, '6108', 'ห้วยคต', 'Huai Khot', 48),
(709, '6201', 'เมืองกำแพงเพชร', 'Mueang Kamphaeng Phet', 49),
(710, '6202', 'ไทรงาม', 'Sai Ngam', 49),
(711, '6203', 'คลองลาน', 'Khlong Lan', 49),
(712, '6204', 'ขาณุวรลักษบุรี', 'Khanu Woralaksaburi', 49),
(713, '6205', 'คลองขลุง', 'Khlong Khlung', 49),
(714, '6206', 'พรานกระต่าย', 'Phran Kratai', 49),
(715, '6207', 'ลานกระบือ', 'Lan Krabue', 49),
(716, '6208', 'ทรายทองวัฒนา', 'Sai Thong Watthana', 49),
(717, '6209', 'ปางศิลาทอง', 'Pang Sila Thong', 49),
(718, '6210', 'บึงสามัคคี', 'Bueng Samakkhi', 49),
(719, '6211', 'โกสัมพีนคร', 'Kosamphi Nakhon', 49),
(720, '6301', 'เมืองตาก', 'Mueang Tak', 50),
(721, '6302', 'บ้านตาก', 'Ban Tak', 50),
(722, '6303', 'สามเงา', 'Sam Ngao', 50),
(723, '6304', 'แม่ระมาด', 'Mae Ramat', 50),
(724, '6305', 'ท่าสองยาง', 'Tha Song Yang', 50),
(725, '6306', 'แม่สอด', 'Mae Sot', 50),
(726, '6307', 'พบพระ', 'Phop Phra', 50),
(727, '6308', 'อุ้มผาง', 'Umphang', 50),
(728, '6309', 'วังเจ้า', 'Wang Chao', 50),
(729, '6381', 'กิ่ง อ.ท่าปุย  จ.ตาก', 'King Ta Pui', 50),
(730, '6401', 'เมืองสุโขทัย', 'Mueang Sukhothai', 51),
(731, '6402', 'บ้านด่านลานหอย', 'Ban Dan Lan Hoi', 51),
(732, '6403', 'คีรีมาศ', 'Khiri Mat', 51),
(733, '6404', 'กงไกรลาศ', 'Kong Krailat', 51),
(734, '6405', 'ศรีสัชนาลัย', 'Si Satchanalai', 51),
(735, '6406', 'ศรีสำโรง', 'Si Samrong', 51),
(736, '6407', 'สวรรคโลก', 'Sawankhalok', 51),
(737, '6408', 'ศรีนคร', 'Si Nakhon', 51),
(738, '6409', 'ทุ่งเสลี่ยม', 'Thung Saliam', 51),
(739, '6501', 'เมืองพิษณุโลก', 'Mueang Phitsanulok', 52),
(740, '6502', 'นครไทย', 'Nakhon Thai', 52),
(741, '6503', 'ชาติตระการ', 'Chat Trakan', 52),
(742, '6504', 'บางระกำ', 'Bang Rakam', 52),
(743, '6505', 'บางกระทุ่ม', 'Bang Krathum', 52),
(744, '6506', 'พรหมพิราม', 'Phrom Phiram', 52),
(745, '6507', 'วัดโบสถ์', 'Wat Bot', 52),
(746, '6508', 'วังทอง', 'Wang Thong', 52),
(747, '6509', 'เนินมะปราง', 'Noen Maprang', 52),
(748, '6601', 'เมืองพิจิตร', 'Mueang Phichit', 53),
(749, '6602', 'วังทรายพูน', 'Wang Sai Phun', 53),
(750, '6603', 'โพธิ์ประทับช้าง', 'Pho Prathap Chang', 53),
(751, '6604', 'ตะพานหิน', 'Taphan Hin', 53),
(752, '6605', 'บางมูลนาก', 'Bang Mun Nak', 53),
(753, '6606', 'โพทะเล', 'Pho Thale', 53),
(754, '6607', 'สามง่าม', 'Sam Ngam', 53),
(755, '6608', 'ทับคล้อ', 'Tap Khlo', 53),
(756, '6609', 'สากเหล็ก', 'Sak Lek', 53),
(757, '6610', 'บึงนาราง', 'Bueng Na Rang', 53),
(758, '6611', 'ดงเจริญ', 'Dong Charoen', 53),
(759, '6612', 'วชิรบารมี', 'Wachirabarami', 53),
(760, '6701', 'เมืองเพชรบูรณ์', 'Mueang Phetchabun', 54),
(761, '6702', 'ชนแดน', 'Chon Daen', 54),
(762, '6703', 'หล่มสัก', 'Lom Sak', 54),
(763, '6704', 'หล่มเก่า', 'Lom Kao', 54),
(764, '6705', 'วิเชียรบุรี', 'Wichian Buri', 54),
(765, '6706', 'ศรีเทพ', 'Si Thep', 54),
(766, '6707', 'หนองไผ่', 'Nong Phai', 54),
(767, '6708', 'บึงสามพัน', 'Bueng Sam Phan', 54),
(768, '6709', 'น้ำหนาว', 'Nam Nao', 54),
(769, '6710', 'วังโป่ง', 'Wang Pong', 54),
(770, '6711', 'เขาค้อ', 'Khao Kho', 54),
(771, '7001', 'เมืองราชบุรี', 'Mueang Ratchaburi', 55),
(772, '7002', 'จอมบึง', 'Chom Bueng', 55),
(773, '7003', 'สวนผึ้ง', 'Suan Phueng', 55),
(774, '7004', 'ดำเนินสะดวก', 'Damnoen Saduak', 55),
(775, '7005', 'บ้านโป่ง', 'Ban Pong', 55),
(776, '7006', 'บางแพ', 'Bang Phae', 55),
(777, '7007', 'โพธาราม', 'Photharam', 55),
(778, '7008', 'ปากท่อ', 'Pak Tho', 55),
(779, '7009', 'วัดเพลง', 'Wat Phleng', 55),
(780, '7010', 'บ้านคา', 'Ban Kha', 55),
(781, '7074', 'ท้องถิ่นเทศบาลตำบลบ้านฆ้อง', 'Tet Saban Ban Kong', 55),
(782, '7101', 'เมืองกาญจนบุรี', 'Mueang Kanchanaburi', 56),
(783, '7102', 'ไทรโยค', 'Sai Yok', 56),
(784, '7103', 'บ่อพลอย', 'Bo Phloi', 56),
(785, '7104', 'ศรีสวัสดิ์', 'Si Sawat', 56),
(786, '7105', 'ท่ามะกา', 'Tha Maka', 56),
(787, '7106', 'ท่าม่วง', 'Tha Muang', 56),
(788, '7107', 'ทองผาภูมิ', 'Pha Phum', 56),
(789, '7108', 'สังขละบุรี', 'Sangkhla Buri', 56),
(790, '7109', 'พนมทวน', 'Phanom Thuan', 56),
(791, '7110', 'เลาขวัญ', 'Lao Khwan', 56),
(792, '7111', 'ด่านมะขามเตี้ย', 'Dan Makham Tia', 56),
(793, '7112', 'หนองปรือ', 'Nong Prue', 56),
(794, '7113', 'ห้วยกระเจา', 'Huai Krachao', 56),
(795, '7151', 'สาขาตำบลท่ากระดาน', 'Tha Kra Dan', 56),
(796, '7181', 'บ้านทวน  จ.กาญจนบุรี', 'Ban Tuan', 56),
(797, '7201', 'เมืองสุพรรณบุรี', 'Mueang Suphan Buri', 57),
(798, '7202', 'เดิมบางนางบวช', 'Doem Bang Nang Buat', 57),
(799, '7203', 'ด่านช้าง', 'Dan Chang', 57),
(800, '7204', 'บางปลาม้า', 'Bang Pla Ma', 57),
(801, '7205', 'ศรีประจันต์', 'Si Prachan', 57),
(802, '7206', 'ดอนเจดีย์', 'Don Chedi', 57),
(803, '7207', 'สองพี่น้อง', 'Song Phi Nong', 57),
(804, '7208', 'สามชุก', 'Sam Chuk', 57),
(805, '7209', 'อู่ทอง', 'U Thong', 57),
(806, '7210', 'หนองหญ้าไซ', 'Nong Ya Sai', 57),
(807, '7301', 'เมืองนครปฐม', 'Mueang Nakhon Pathom', 58),
(808, '7302', 'กำแพงแสน', 'Kamphaeng Saen', 58),
(809, '7303', 'นครชัยศรี', 'Nakhon Chai Si', 58),
(810, '7304', 'ดอนตูม', 'Don Tum', 58),
(811, '7305', 'บางเลน', 'Bang Len', 58),
(812, '7306', 'สามพราน', 'Sam Phran', 58),
(813, '7307', 'พุทธมณฑล', 'Phutthamonthon', 58),
(814, '7401', 'เมืองสมุทรสาคร', 'Mueang Samut Sakhon', 59),
(815, '7402', 'กระทุ่มแบน', 'Krathum Baen', 59),
(816, '7403', 'บ้านแพ้ว', 'Ban Phaeo', 59),
(817, '7501', 'เมืองสมุทรสงคราม', 'Mueang Samut Songkhram', 60),
(818, '7502', 'บางคนที', 'Bang Khonthi', 60),
(819, '7503', 'อัมพวา', 'Amphawa', 60),
(820, '7601', 'เมืองเพชรบุรี', 'Mueang Phetchaburi', 61),
(821, '7602', 'เขาย้อย', 'Khao Yoi', 61),
(822, '7603', 'หนองหญ้าปล้อง', 'Nong Ya Plong', 61),
(823, '7604', 'ชะอำ', 'Cha-am', 61),
(824, '7605', 'ท่ายาง', 'Tha Yang', 61),
(825, '7606', 'บ้านลาด', 'Ban Lat', 61),
(826, '7607', 'บ้านแหลม', 'Ban Laem', 61),
(827, '7608', 'แก่งกระจาน', 'Kaeng Krachan', 61),
(828, '7701', 'เมืองประจวบคีรีขันธ์', 'Mueang Prachuap Khiri Khan', 62),
(829, '7702', 'กุยบุรี', 'Kui Buri', 62),
(830, '7703', 'ทับสะแก', 'Thap Sakae', 62),
(831, '7704', 'บางสะพาน', 'Bang Saphan', 62),
(832, '7705', 'บางสะพานน้อย', 'Bang Saphan Noi', 62),
(833, '7706', 'ปราณบุรี', 'Pran Buri', 62),
(834, '7707', 'หัวหิน', 'Hua Hin', 62),
(835, '7708', 'สามร้อยยอด', 'Sam Roi Yot', 62),
(836, '8001', 'เมืองนครศรีธรรมราช', 'Mueang Nakhon Si Thammarat', 63),
(837, '8002', 'พรหมคีรี', 'Phrom Khiri', 63),
(838, '8003', 'ลานสกา', 'Lan Saka', 63),
(839, '8004', 'ฉวาง', 'Chawang', 63),
(840, '8005', 'พิปูน', 'Phipun', 63),
(841, '8006', 'เชียรใหญ่', 'Chian Yai', 63),
(842, '8007', 'ชะอวด', 'Cha-uat', 63),
(843, '8008', 'ท่าศาลา', 'Tha Sala', 63),
(844, '8009', 'ทุ่งสง', 'Thung Song', 63),
(845, '8010', 'นาบอน', 'Na Bon', 63),
(846, '8011', 'ทุ่งใหญ่', 'Thung Yai', 63),
(847, '8012', 'ปากพนัง', 'Pak Phanang', 63),
(848, '8013', 'ร่อนพิบูลย์', 'Ron Phibun', 63),
(849, '8014', 'สิชล', 'Sichon', 63),
(850, '8015', 'ขนอม', 'Khanom', 63),
(851, '8016', 'หัวไทร', 'Hua Sai', 63),
(852, '8017', 'บางขัน', 'Bang Khan', 63),
(853, '8018', 'ถ้ำพรรณรา', 'Tham Phannara', 63),
(854, '8019', 'จุฬาภรณ์', 'Chulabhorn', 63),
(855, '8020', 'พระพรหม', 'Phra Phrom', 63),
(856, '8021', 'นบพิตำ', 'Nopphitam', 63),
(857, '8022', 'ช้างกลาง', 'Chang Klang', 63),
(858, '8023', 'เฉลิมพระเกียรติ', 'Chaloem Phra Kiat', 63),
(859, '8051', 'เชียรใหญ่ (สาขาตำบลเสือหึง)', 'Chian Yai', 63),
(860, '8052', 'สาขาตำบลสวนหลวง', 'Suan Luang', 63),
(861, '8053', 'ร่อนพิบูลย์ (สาขาตำบลหินตก)', 'Ron Phibun', 63),
(862, '8054', 'หัวไทร (สาขาตำบลควนชะลิก)', 'Hua Sai', 63),
(863, '8055', 'ทุ่งสง (สาขาตำบลกะปาง)', 'Thung Song', 63),
(864, '8101', 'เมืองกระบี่', 'Mueang Krabi', 64),
(865, '8102', 'เขาพนม', 'Khao Phanom', 64),
(866, '8103', 'เกาะลันตา', 'Ko Lanta', 64),
(867, '8104', 'คลองท่อม', 'Khlong Thom', 64),
(868, '8105', 'อ่าวลึก', 'Ao Luek', 64),
(869, '8106', 'ปลายพระยา', 'Plai Phraya', 64),
(870, '8107', 'ลำทับ', 'Lam Thap', 64),
(871, '8108', 'เหนือคลอง', 'Nuea Khlong', 64),
(872, '8201', 'เมืองพังงา', 'Mueang Phang-nga', 65),
(873, '8202', 'เกาะยาว', 'Ko Yao', 65),
(874, '8203', 'กะปง', 'Kapong', 65),
(875, '8204', 'ตะกั่วทุ่ง', 'Takua Thung', 65),
(876, '8205', 'ตะกั่วป่า', 'Takua Pa', 65),
(877, '8206', 'คุระบุรี', 'Khura Buri', 65),
(878, '8207', 'ทับปุด', 'Thap Put', 65),
(879, '8208', 'ท้ายเหมือง', 'Thai Mueang', 65),
(880, '8301', 'เมืองภูเก็ต', 'Mueang Phuket', 66),
(881, '8302', 'กะทู้', 'Kathu', 66),
(882, '8303', 'ถลาง', 'Thalang', 66),
(883, '8381', 'ทุ่งคา', 'Tung Ka', 66),
(884, '8401', 'เมืองสุราษฎร์ธานี', 'Mueang Surat Thani', 67),
(885, '8402', 'กาญจนดิษฐ์', 'Kanchanadit', 67),
(886, '8403', 'ดอนสัก', 'Don Sak', 67),
(887, '8404', 'เกาะสมุย', 'Ko Samui', 67),
(888, '8405', 'เกาะพะงัน', 'Ko Pha-ngan', 67),
(889, '8406', 'ไชยา', 'Chaiya', 67),
(890, '8407', 'ท่าชนะ', 'Tha Chana', 67),
(891, '8408', 'คีรีรัฐนิคม', 'Khiri Rat Nikhom', 67),
(892, '8409', 'บ้านตาขุน', 'Ban Ta Khun', 67),
(893, '8410', 'พนม', 'Phanom', 67),
(894, '8411', 'ท่าฉาง', 'Tha Chang', 67),
(895, '8412', 'บ้านนาสาร', 'Ban Na San', 67),
(896, '8413', 'บ้านนาเดิม', 'Ban Na Doem', 67),
(897, '8414', 'เคียนซา', 'Khian Sa', 67),
(898, '8415', 'เวียงสระ', 'Wiang Sa', 67),
(899, '8416', 'พระแสง', 'Phrasaeng', 67),
(900, '8417', 'พุนพิน', 'Phunphin', 67),
(901, '8418', 'ชัยบุรี', 'Chai Buri', 67),
(902, '8419', 'วิภาวดี', 'Vibhavadi', 67),
(903, '8451', 'เกาะพงัน (สาขาตำบลเกาะเต่า)', 'Ko Pha-ngan', 67),
(904, '8481', 'อ.บ้านดอน  จ.สุราษฎร์ธานี', 'Ban Don', 67),
(905, '8501', 'เมืองระนอง', 'Mueang Ranong', 68),
(906, '8502', 'ละอุ่น', 'La-un', 68),
(907, '8503', 'กะเปอร์', 'Kapoe', 68),
(908, '8504', 'กระบุรี', 'Kra Buri', 68),
(909, '8505', 'สุขสำราญ', 'Suk Samran', 68),
(910, '8601', 'เมืองชุมพร', 'Mueang Chumphon', 69),
(911, '8602', 'ท่าแซะ', 'Tha Sae', 69),
(912, '8603', 'ปะทิว', 'Pathio', 69),
(913, '8604', 'หลังสวน', 'Lang Suan', 69),
(914, '8605', 'ละแม', 'Lamae', 69),
(915, '8606', 'พะโต๊ะ', 'Phato', 69),
(916, '8607', 'สวี', 'Sawi', 69),
(917, '8608', 'ทุ่งตะโก', 'Thung Tako', 69),
(918, '9001', 'เมืองสงขลา', 'Mueang Songkhla', 70),
(919, '9002', 'สทิงพระ', 'Sathing Phra', 70),
(920, '9003', 'จะนะ', 'Chana', 70),
(921, '9004', 'นาทวี', 'Na Thawi', 70),
(922, '9005', 'เทพา', 'Thepha', 70),
(923, '9006', 'สะบ้าย้อย', 'Saba Yoi', 70),
(924, '9007', 'ระโนด', 'Ranot', 70),
(925, '9008', 'กระแสสินธุ์', 'Krasae Sin', 70),
(926, '9009', 'รัตภูมิ', 'Rattaphum', 70),
(927, '9010', 'สะเดา', 'Sadao', 70),
(928, '9011', 'หาดใหญ่', 'Hat Yai', 70),
(929, '9012', 'นาหม่อม', 'Na Mom', 70),
(930, '9013', 'ควนเนียง', 'Khuan Niang', 70),
(931, '9014', 'บางกล่ำ', 'Bang Klam', 70),
(932, '9015', 'สิงหนคร', 'Singhanakhon', 70),
(933, '9016', 'คลองหอยโข่ง', 'Khlong Hoi Khong', 70),
(934, '9077', 'ท้องถิ่นเทศบาลตำบลสำนักขาม', 'Sum Nung Kam', 70),
(935, '9096', 'เทศบาลตำบลบ้านพรุ', 'Ban Pru', 70),
(936, '9101', 'เมืองสตูล', 'Mueang Satun', 71),
(937, '9102', 'ควนโดน', 'Khuan Don', 71),
(938, '9103', 'ควนกาหลง', 'Khuan Kalong', 71),
(939, '9104', 'ท่าแพ', 'Tha Phae', 71),
(940, '9105', 'ละงู', 'La-ngu', 71),
(941, '9106', 'ทุ่งหว้า', 'Thung Wa', 71),
(942, '9107', 'มะนัง', 'Manang', 71),
(943, '9201', 'เมืองตรัง', 'Mueang Trang', 72),
(944, '9202', 'กันตัง', 'Kantang', 72),
(945, '9203', 'ย่านตาขาว', 'Yan Ta Khao', 72),
(946, '9204', 'ปะเหลียน', 'Palian', 72),
(947, '9205', 'สิเกา', 'Sikao', 72),
(948, '9206', 'ห้วยยอด', 'Huai Yot', 72),
(949, '9207', 'วังวิเศษ', 'Wang Wiset', 72),
(950, '9208', 'นาโยง', 'Na Yong', 72),
(951, '9209', 'รัษฎา', 'Ratsada', 72),
(952, '9210', 'หาดสำราญ', 'Hat Samran', 72),
(953, '9251', 'อำเภอเมืองตรัง(สาขาคลองเต็ง)', 'Mueang Trang(Krong Teng)', 72),
(954, '9301', 'เมืองพัทลุง', 'Mueang Phatthalung', 73),
(955, '9302', 'กงหรา', 'Kong Ra', 73),
(956, '9303', 'เขาชัยสน', 'Khao Chaison', 73),
(957, '9304', 'ตะโหมด', 'Tamot', 73),
(958, '9305', 'ควนขนุน', 'Khuan Khanun', 73),
(959, '9306', 'ปากพะยูน', 'Pak Phayun', 73),
(960, '9307', 'ศรีบรรพต', 'Si Banphot', 73),
(961, '9308', 'ป่าบอน', 'Pa Bon', 73),
(962, '9309', 'บางแก้ว', 'Bang Kaeo', 73),
(963, '9310', 'ป่าพะยอม', 'Pa Phayom', 73),
(964, '9311', 'ศรีนครินทร์', 'Srinagarindra', 73),
(965, '9401', 'เมืองปัตตานี', 'Mueang Pattani', 74),
(966, '9402', 'โคกโพธิ์', 'Khok Pho', 74),
(967, '9403', 'หนองจิก', 'Nong Chik', 74),
(968, '9404', 'ปะนาเระ', 'Panare', 74),
(969, '9405', 'มายอ', 'Mayo', 74),
(970, '9406', 'ทุ่งยางแดง', 'Thung Yang Daeng', 74),
(971, '9407', 'สายบุรี', 'Sai Buri', 74),
(972, '9408', 'ไม้แก่น', 'Mai Kaen', 74),
(973, '9409', 'ยะหริ่ง', 'Yaring', 74),
(974, '9410', 'ยะรัง', 'Yarang', 74),
(975, '9411', 'กะพ้อ', 'Kapho', 74),
(976, '9412', 'แม่ลาน', 'Mae Lan', 74),
(977, '9501', 'เมืองยะลา', 'Mueang Yala', 75),
(978, '9502', 'เบตง', 'Betong', 75),
(979, '9503', 'บันนังสตา', 'Bannang Sata', 75),
(980, '9504', 'ธารโต', 'Than To', 75),
(981, '9505', 'ยะหา', 'Yaha', 75),
(982, '9506', 'รามัน', 'Raman', 75),
(983, '9507', 'กาบัง', 'Kabang', 75),
(984, '9508', 'กรงปินัง', 'Krong Pinang', 75),
(985, '9601', 'เมืองนราธิวาส', 'Mueang Narathiwat', 76),
(986, '9602', 'ตากใบ', 'Tak Bai', 76),
(987, '9603', 'บาเจาะ', 'Bacho', 76),
(988, '9604', 'ยี่งอ', 'Yi-ngo', 76),
(989, '9605', 'ระแงะ', 'Ra-ngae', 76),
(990, '9606', 'รือเสาะ', 'Rueso', 76),
(991, '9607', 'ศรีสาคร', 'Si Sakhon', 76),
(992, '9608', 'แว้ง', 'Waeng', 76),
(993, '9609', 'สุคิริน', 'Sukhirin', 76),
(994, '9610', 'สุไหงโก-ลก', 'Su-ngai Kolok', 76),
(995, '9611', 'สุไหงปาดี', 'Su-ngai Padi', 76),
(996, '9612', 'จะแนะ', 'Chanae', 76),
(997, '9613', 'เจาะไอร้อง', 'Cho-airong', 76),
(998, '9681', 'อ.บางนรา  จ.นราธิวาส', 'Bang Nra', 76),
(999, '3801', 'เมืองบึงกาฬ', 'Mueang Bueng Kan', 77),
(1000, '3802', 'เซกา', 'Seka', 77),
(1001, '3803', 'โซ่พิสัย', 'So Phisai', 77),
(1002, '3804', 'พรเจริญ', 'Phon Charoen', 77),
(1003, '3805', 'ศรีวิไล', 'Si Wilai', 77),
(1004, '3806', 'บึงโขงหลง', 'Bueng Khong Long', 77),
(1005, '3807', 'ปากคาด', 'Pak Khat', 77),
(1006, '3808', 'บุ่งคล้า', 'Bung Khla', 77);

-- --------------------------------------------------------

--
-- Table structure for table `areaaddressplam`
--

CREATE TABLE `areaaddressplam` (
  `id_areaaddressplam` int(11) NOT NULL,
  `lat` float NOT NULL,
  `lon` float NOT NULL,
  `idAddressPlam` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `bugreport`
--

CREATE TABLE `bugreport` (
  `idBug` int(11) NOT NULL,
  `date` datetime DEFAULT NULL,
  `insecticide` int(11) DEFAULT NULL,
  `datereport` datetime NOT NULL,
  `Farmer_idFarmer` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `carwaterreport`
--

CREATE TABLE `carwaterreport` (
  `idCarWaterReport` int(11) NOT NULL,
  `date` datetime DEFAULT NULL,
  `number` int(11) DEFAULT NULL,
  `datereport` datetime NOT NULL,
  `Farmer_idFarmer` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `cube_car_water`
--

CREATE TABLE `cube_car_water` (
  `id` int(11) NOT NULL DEFAULT '0',
  `id_farmer` int(11) DEFAULT NULL,
  `fname_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `lname_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `idCard_farmer` varchar(20) DEFAULT NULL,
  `amphoe_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `id_addresspalm` int(11) DEFAULT NULL,
  `name_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `lat_addresspalm` float DEFAULT NULL,
  `lon_addresspalm` float DEFAULT NULL,
  `amphoe_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `rai_palm` int(11) NOT NULL,
  `num_palm` int(11) NOT NULL,
  `date` date DEFAULT NULL,
  `month_date` int(3) DEFAULT NULL,
  `year_date` int(4) DEFAULT NULL,
  `num_car` int(11) DEFAULT NULL,
  `status_del` int(2) NOT NULL DEFAULT '1',
  `status` int(2) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `cube_car_water`
--

INSERT INTO `cube_car_water` (`id`, `id_farmer`, `fname_farmer`, `lname_farmer`, `idCard_farmer`, `amphoe_farmer`, `province_farmer`, `id_addresspalm`, `name_addresspalm`, `lat_addresspalm`, `lon_addresspalm`, `amphoe_addresspalm`, `province_addresspalm`, `rai_palm`, `num_palm`, `date`, `month_date`, `year_date`, `num_car`, `status_del`, `status`) VALUES
(1, 1, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 230.156, 251.304, 'ampaddress', 'pradd', 100, 50, '2019-06-01', 6, 2019, 2, 1, 1),
(2, 1, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 230.156, 251.304, 'ampaddress', 'pradd', 100, 50, '2019-06-01', 6, 2019, 2, 1, 1),
(3, 1, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 230.156, 251.304, 'ampaddress', 'pradd', 100, 50, '2019-06-01', 6, 2019, 2, 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `cube_give_water`
--

CREATE TABLE `cube_give_water` (
  `id` int(11) NOT NULL DEFAULT '0',
  `id_farmer` int(11) DEFAULT NULL,
  `fname_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `lname_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `idCard_farmer` varchar(20) DEFAULT NULL,
  `amphoe_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `id_addresspalm` int(11) DEFAULT NULL,
  `name_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `lat_addresspalm` float DEFAULT NULL,
  `lon_addresspalm` float DEFAULT NULL,
  `amphoe_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `rai_palm` int(11) DEFAULT NULL,
  `num_palm` int(11) DEFAULT NULL,
  `pic` int(2) DEFAULT NULL,
  `start_time` datetime DEFAULT NULL,
  `start_day` int(2) DEFAULT NULL,
  `start_month` int(2) DEFAULT NULL,
  `start_year` int(4) DEFAULT NULL,
  `end_time` datetime DEFAULT NULL,
  `time_use` int(3) DEFAULT NULL,
  `volume_rain` int(10) DEFAULT NULL,
  `id_group` int(11) DEFAULT NULL,
  `status_del` int(2) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `cube_give_water`
--

INSERT INTO `cube_give_water` (`id`, `id_farmer`, `fname_farmer`, `lname_farmer`, `idCard_farmer`, `amphoe_farmer`, `province_farmer`, `id_addresspalm`, `name_addresspalm`, `lat_addresspalm`, `lon_addresspalm`, `amphoe_addresspalm`, `province_addresspalm`, `rai_palm`, `num_palm`, `pic`, `start_time`, `start_day`, `start_month`, `start_year`, `end_time`, `time_use`, `volume_rain`, `id_group`, `status_del`) VALUES
(1, 1, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 230.156, 251.304, 'ampaddress', 'pradd', 100, 50, 1, '2019-06-02 00:00:00', 2, 6, 2019, '2019-06-03 00:00:00', 200, 1000, 201906021, 1),
(2, 1, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 230.156, 251.304, 'ampaddress', 'pradd', 100, 50, 1, '2019-06-02 00:00:00', 2, 6, 2019, '2019-06-03 00:00:00', 200, 1000, 201906021, 1),
(3, 1, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 230.156, 251.304, 'ampaddress', 'pradd', 100, 50, 1, '2019-06-02 00:00:00', 2, 6, 2019, '2019-06-03 00:00:00', 200, 1000, 201906021, 1);

-- --------------------------------------------------------

--
-- Table structure for table `cube_pest`
--

CREATE TABLE `cube_pest` (
  `id` int(11) NOT NULL,
  `id_farmer` int(11) DEFAULT NULL,
  `fname_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `lname_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `idCard_farmer` varchar(20) DEFAULT NULL,
  `amphoe_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `id_addresspalm` int(11) DEFAULT NULL,
  `name_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `lat_addresspalm` float DEFAULT NULL,
  `lon_addresspalm` float DEFAULT NULL,
  `amphoe_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `rai_palm` int(11) DEFAULT NULL,
  `num_palm` int(11) DEFAULT NULL,
  `date` date DEFAULT NULL,
  `month_date` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `year_date` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `PL_ID` int(11) DEFAULT NULL,
  `PL_NAME` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `PT_ID` int(11) DEFAULT NULL,
  `PT_NAME` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `severity` int(2) DEFAULT NULL,
  `id_group` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `status` int(2) NOT NULL DEFAULT '1',
  `note` text,
  `picture` int(2) DEFAULT NULL,
  `status_del` int(2) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `cube_pest`
--

INSERT INTO `cube_pest` (`id`, `id_farmer`, `fname_farmer`, `lname_farmer`, `idCard_farmer`, `amphoe_farmer`, `province_farmer`, `id_addresspalm`, `name_addresspalm`, `lat_addresspalm`, `lon_addresspalm`, `amphoe_addresspalm`, `province_addresspalm`, `rai_palm`, `num_palm`, `date`, `month_date`, `year_date`, `PL_ID`, `PL_NAME`, `PT_ID`, `PT_NAME`, `severity`, `id_group`, `status`, `note`, `picture`, `status_del`) VALUES
(1, 28, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 250.254, 251.304, 'amadd', 'pradd', 10, NULL, '2019-06-01', '06', '2019', 1, 'Cat', 2, 'Fever', 3, '0206256228', 1, 'noteTest', 0, 1),
(2, 28, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 250.254, 251.304, 'amadd', 'pradd', 10, 200, '2019-06-01', '06', '2019', 1, 'แมลง1', 1, 'โรค1', 3, '0206256228', 1, 'noteTest', NULL, 1),
(3, 28, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 250.254, 251.304, 'amadd', 'pradd', 10, 200, '2019-06-01', '06', '2019', 1, 'แมลง1', 2, 'โรค2', 3, '0206256228', 1, 'noteTest', NULL, 1);

-- --------------------------------------------------------

--
-- Table structure for table `cube_plant`
--

CREATE TABLE `cube_plant` (
  `id` int(11) NOT NULL,
  `id_farmer` int(11) DEFAULT NULL,
  `fname_farmer` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `lname_farmer` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `idCard_farmer` varchar(20) COLLATE utf8_unicode_ci DEFAULT NULL,
  `amphoe_farmer` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_farmer` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `id_addresspalm` int(11) DEFAULT NULL,
  `name_addresspalm` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `lat_addresspalm` float DEFAULT NULL,
  `lon_addresspalm` float DEFAULT NULL,
  `amphoe_addresspalm` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_addresspalm` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `date` date DEFAULT NULL,
  `month_date` int(3) DEFAULT NULL,
  `year_date` int(4) DEFAULT NULL,
  `type_plant` enum('ปลูก','ปลูกซ่อม','ตาย') COLLATE utf8_unicode_ci DEFAULT NULL,
  `num_palm` int(11) DEFAULT NULL,
  `pic` int(2) DEFAULT NULL,
  `rai_palm` int(2) DEFAULT NULL,
  `quarterOfRai_palm` int(11) DEFAULT NULL,
  `wa_palm` int(11) DEFAULT NULL,
  `wa_total_palm` int(11) DEFAULT NULL,
  `status_del` int(2) NOT NULL DEFAULT '1',
  `status` int(2) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `cube_plant`
--

INSERT INTO `cube_plant` (`id`, `id_farmer`, `fname_farmer`, `lname_farmer`, `idCard_farmer`, `amphoe_farmer`, `province_farmer`, `id_addresspalm`, `name_addresspalm`, `lat_addresspalm`, `lon_addresspalm`, `amphoe_addresspalm`, `province_addresspalm`, `date`, `month_date`, `year_date`, `type_plant`, `num_palm`, `pic`, `rai_palm`, `quarterOfRai_palm`, `wa_palm`, `wa_total_palm`, `status_del`, `status`) VALUES
(1, 28, 'Nopphanan', 'Mayoe', '123546', NULL, NULL, 1, 'name', 13.7247, 100.633, NULL, NULL, '2019-06-01', 6, 2019, 'ปลูก', 10, 1, 10, 3, 200, 11, 1, 1),
(2, 28, 'Nopphanan', 'Mayoe', '123546', NULL, NULL, 1, 'name', 13.7247, 100.633, NULL, NULL, '2019-06-01', 6, 2019, 'ปลูกซ่อม', 5, 1, 10, 3, 200, 11, 1, 1),
(3, 28, 'Nopphanan', 'Mayoe', '123546', NULL, NULL, 1, 'name', 13.7247, 100.633, NULL, NULL, '2019-06-01', 6, 2019, 'ตาย', 6, 1, 10, 3, 200, 11, 1, 1),
(4, 27, 'Nopphanan', 'Mayoe', '123546', NULL, NULL, 2, 'name', 13.7247, 100.633, NULL, NULL, '2019-06-01', 6, 2019, 'ปลูก', 10, 1, 10, 3, 200, 11, 1, 1),
(8, 27, 'test', 'tester', '1235467891011', 'aaa', 'aaa', 2, 'teen', 13.7247, 101.633, NULL, NULL, '2019-06-01', 6, 2019, 'ปลูก', 10, 1, 10, 3, 200, 11, 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `cube_product`
--

CREATE TABLE `cube_product` (
  `id` int(11) NOT NULL,
  `id_farmer` int(11) DEFAULT NULL,
  `fname_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `lname_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `idCard_farmer` varchar(20) DEFAULT NULL,
  `amphoe_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `id_addresspalm` int(11) DEFAULT NULL,
  `name_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `lat_addresspalm` float DEFAULT NULL,
  `lon_addresspalm` float DEFAULT NULL,
  `amphoe_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `date` date DEFAULT NULL,
  `month_date` int(3) DEFAULT NULL,
  `year_date` int(4) DEFAULT NULL,
  `volume_palm` float DEFAULT NULL,
  `pricePerUnit` float DEFAULT NULL,
  `netPrice` float DEFAULT NULL,
  `id_group` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `status` int(2) NOT NULL DEFAULT '1',
  `status_del` int(2) NOT NULL DEFAULT '1',
  `pic` int(2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `cube_product`
--

INSERT INTO `cube_product` (`id`, `id_farmer`, `fname_farmer`, `lname_farmer`, `idCard_farmer`, `amphoe_farmer`, `province_farmer`, `id_addresspalm`, `name_addresspalm`, `lat_addresspalm`, `lon_addresspalm`, `amphoe_addresspalm`, `province_addresspalm`, `date`, `month_date`, `year_date`, `volume_palm`, `pricePerUnit`, `netPrice`, `id_group`, `status`, `status_del`, `pic`) VALUES
(3, 28, 'Nopphanan', 'Mayoe', '1111111111111', 'พิมลราข', 'Nonthaburi', 1, 'nut', 13.7247, 100.633, 'xxx', 'xxx', '2018-06-01', 6, 2018, 10, 20, 200, NULL, 1, 1, NULL),
(4, 28, 'Nopphanan', 'Mayoe', '1111111111111', 'พิมลราข', 'Nonthaburi', 1, 'nut', 13.7247, 100.633, 'xxx', 'xxx', '2019-06-01', 6, 2019, 10, 20, 200, NULL, 1, 1, NULL),
(5, 27, 'test', 'tester', '1111111111111', 'aaa', 'aaa', 2, 'teen', 13.7247, 101.633, 'xxx', 'xxx', '2019-06-01', 6, 2019, 12, 20, 240, NULL, 1, 1, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `cube_pruning`
--

CREATE TABLE `cube_pruning` (
  `id` int(11) NOT NULL,
  `id_farmer` int(11) DEFAULT NULL,
  `fname_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `lname_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `idCard_farmer` varchar(20) DEFAULT NULL,
  `amphoe_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `id_addresspalm` int(11) DEFAULT NULL,
  `name_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `lat_addresspalm` float DEFAULT NULL,
  `lon_addresspalm` float DEFAULT NULL,
  `amphoe_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `rai_palm` int(11) NOT NULL,
  `num_palm` int(11) NOT NULL,
  `date` date DEFAULT NULL,
  `month_date` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `year_date` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `id_group` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `status` int(2) NOT NULL DEFAULT '1',
  `note` text,
  `pic` int(2) DEFAULT NULL,
  `status_del` int(2) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `cube_pruning`
--

INSERT INTO `cube_pruning` (`id`, `id_farmer`, `fname_farmer`, `lname_farmer`, `idCard_farmer`, `amphoe_farmer`, `province_farmer`, `id_addresspalm`, `name_addresspalm`, `lat_addresspalm`, `lon_addresspalm`, `amphoe_addresspalm`, `province_addresspalm`, `rai_palm`, `num_palm`, `date`, `month_date`, `year_date`, `id_group`, `status`, `note`, `pic`, `status_del`) VALUES
(1, 1, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 230.156, 322.111, 'ampaddress', 'proaddress', 100, 50, '2019-06-02', '06', '2019', '201906021', 1, 'noteTEst', 1, 1),
(2, 1, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 230.156, 322.111, 'ampaddress', 'proaddress', 100, 50, '2019-06-02', '06', '2019', '201906021', 1, 'noteTEst', 1, 1),
(3, 1, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 230.156, 322.111, 'ampaddress', 'proaddress', 100, 50, '2019-06-02', '06', '2019', '201906021', 1, 'noteTEst', 1, 1),
(4, 1, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 230.156, 322.111, 'ampaddress', 'proaddress', 100, 50, '2019-06-02', '06', '2019', '201906021', 1, 'noteTEst', 1, 1),
(5, 1, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 230.156, 322.111, 'ampaddress', 'proaddress', 100, 50, '2019-06-02', '06', '2019', '201906021', 1, 'noteTEst', 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `cube_rainfall`
--

CREATE TABLE `cube_rainfall` (
  `id` int(11) NOT NULL,
  `id_farmer` int(11) DEFAULT NULL,
  `fname_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `lname_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `idCard_farmer` varchar(20) DEFAULT NULL,
  `amphoe_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_farmer` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `id_addresspalm` int(11) DEFAULT NULL,
  `name_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `lat_addresspalm` float DEFAULT NULL,
  `lon_addresspalm` float DEFAULT NULL,
  `amphoe_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_addresspalm` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `rai_palm` int(11) DEFAULT NULL,
  `num_palm` int(11) DEFAULT NULL,
  `pic` int(2) DEFAULT NULL,
  `start_time` datetime DEFAULT NULL,
  `start_day` int(2) DEFAULT NULL,
  `start_month` int(2) DEFAULT NULL,
  `start_year` int(4) DEFAULT NULL,
  `end_time` datetime DEFAULT NULL,
  `minute` int(3) DEFAULT NULL,
  `volume_rain` int(10) DEFAULT NULL,
  `id_group` int(11) DEFAULT NULL,
  `status_del` int(2) DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `cube_rainfall`
--

INSERT INTO `cube_rainfall` (`id`, `id_farmer`, `fname_farmer`, `lname_farmer`, `idCard_farmer`, `amphoe_farmer`, `province_farmer`, `id_addresspalm`, `name_addresspalm`, `lat_addresspalm`, `lon_addresspalm`, `amphoe_addresspalm`, `province_addresspalm`, `rai_palm`, `num_palm`, `pic`, `start_time`, `start_day`, `start_month`, `start_year`, `end_time`, `minute`, `volume_rain`, `id_group`, `status_del`) VALUES
(1, 1, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 230.156, 251.304, 'ampaddress', 'pradd', 100, 50, 1, '2019-06-01 00:00:00', 1, 6, 2019, '2019-06-03 00:00:00', 120, 1000, 201906011, 1),
(2, 1, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 230.156, 251.304, 'ampaddress', 'pradd', 100, 50, 1, '2019-06-01 00:00:00', 1, 6, 2019, '2019-06-03 00:00:00', 120, 1000, 201906011, 1),
(3, 1, 'first', 'last', '2119700004657', 'amphoe', 'province', 1, 'addresspalm', 230.156, 251.304, 'ampaddress', 'pradd', 100, 50, 1, '2019-06-01 00:00:00', 1, 6, 2019, '2019-06-03 00:00:00', 120, 1000, 201906011, 1);

-- --------------------------------------------------------

--
-- Table structure for table `cube_use_fertilizer`
--

CREATE TABLE `cube_use_fertilizer` (
  `id` int(11) NOT NULL,
  `id_farmer` int(11) DEFAULT NULL,
  `fname_farmer` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `lname_farmer` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `idCard_farmer` varchar(20) COLLATE utf8_unicode_ci DEFAULT NULL,
  `amphoe_farmer` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_farmer` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `id_addresspalm` int(11) DEFAULT NULL,
  `name_addresspalm` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `lat_addresspalm` float DEFAULT NULL,
  `lon_addresspalm` float DEFAULT NULL,
  `amphoe_addresspalm` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_addresspalm` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `year` varchar(4) COLLATE utf8_unicode_ci NOT NULL,
  `start_date` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `end_date` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `F_ID` int(11) NOT NULL,
  `F_name` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `day_put` varchar(5) COLLATE utf8_unicode_ci DEFAULT NULL,
  `month_put` varchar(5) COLLATE utf8_unicode_ci DEFAULT NULL,
  `year_put` varchar(5) COLLATE utf8_unicode_ci DEFAULT NULL,
  `id_fertilizer` int(11) DEFAULT NULL,
  `add_fertilize_kg` int(11) DEFAULT NULL,
  `id_group` int(11) NOT NULL,
  `status` int(2) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `cube_volume_fertilizer`
--

CREATE TABLE `cube_volume_fertilizer` (
  `id` int(11) NOT NULL,
  `id_farmer` int(11) DEFAULT NULL,
  `fname_farmer` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `lname_farmer` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `idCard_farmer` varchar(20) COLLATE utf8_unicode_ci DEFAULT NULL,
  `amphoe_farmer` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_farmer` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `id_addresspalm` int(11) DEFAULT NULL,
  `name_addresspalm` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `lat_addresspalm` float DEFAULT NULL,
  `lon_addresspalm` float DEFAULT NULL,
  `amphoe_addresspalm` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_addresspalm` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `year` varchar(4) COLLATE utf8_unicode_ci DEFAULT NULL,
  `start_date` varchar(10) COLLATE utf8_unicode_ci DEFAULT NULL,
  `end_date` varchar(10) COLLATE utf8_unicode_ci DEFAULT NULL,
  `F_ID` int(11) DEFAULT NULL,
  `F_name` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `ton` int(11) DEFAULT NULL,
  `rai` int(11) DEFAULT NULL,
  `age` int(11) DEFAULT NULL,
  `product_prev` int(11) DEFAULT NULL,
  `volume_fertilizer` int(11) DEFAULT NULL,
  `add_fertilize_kg` int(11) DEFAULT NULL,
  `add_fertilize_per` int(11) DEFAULT NULL,
  `id_fertilizer` int(11) DEFAULT NULL,
  `status` int(2) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `cutleafreport`
--

CREATE TABLE `cutleafreport` (
  `idCutLeafReport` int(11) NOT NULL,
  `date` datetime DEFAULT NULL,
  `datereport` datetime NOT NULL,
  `Farmer_idFarmer` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `db-department`
--

CREATE TABLE `db-department` (
  `DID` int(11) NOT NULL,
  `Department` varchar(100) NOT NULL,
  `Alias` varchar(25) NOT NULL,
  `Note` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-department`
--

INSERT INTO `db-department` (`DID`, `Department`, `Alias`, `Note`) VALUES
(1, 'ภาควิชาวิศวกรรมคอมพิวเตอร์', 'CPE', 'หน่วยงานผู้พัฒนาระบบ'),
(2, 'ศูนย์เทคโนโลยีชีวภาพเกษตร', 'CAB', 'หน่วยงานผู้เชียวชาญ'),
(3, 'บริษัท ซีพีไอ อะโกรเทค จำกัด', 'CPI', 'หน่วยงานผู้ใช้บริการ');

-- --------------------------------------------------------

--
-- Table structure for table `db-distrinct`
--

CREATE TABLE `db-distrinct` (
  `AD2ID` int(11) NOT NULL,
  `code` int(11) NOT NULL,
  `Distrinct` varchar(30) NOT NULL,
  `AD1ID` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-distrinct`
--

INSERT INTO `db-distrinct` (`AD2ID`, `code`, `Distrinct`, `AD1ID`) VALUES
(1, 1001, 'เขต พระนคร', 1),
(2, 1002, 'เขต ดุสิต', 1),
(3, 1003, 'เขต หนองจอก', 1),
(4, 1004, 'เขต บางรัก', 1),
(5, 1005, 'เขต บางเขน', 1),
(6, 1006, 'เขต บางกะปิ', 1),
(7, 1007, 'เขต ปทุมวัน', 1),
(8, 1008, 'เขต ป้อมปราบศัตรูพ่าย', 1),
(9, 1009, 'เขต พระโขนง', 1),
(10, 1010, 'เขต มีนบุรี', 1),
(11, 1011, 'เขต ลาดกระบัง', 1),
(12, 1012, 'เขต ยานนาวา', 1),
(13, 1013, 'เขต สัมพันธวงศ์', 1),
(14, 1014, 'เขต พญาไท', 1),
(15, 1015, 'เขต ธนบุรี', 1),
(16, 1016, 'เขต บางกอกใหญ่', 1),
(17, 1017, 'เขต ห้วยขวาง', 1),
(18, 1018, 'เขต คลองสาน', 1),
(19, 1019, 'เขต ตลิ่งชัน', 1),
(20, 1020, 'เขต บางกอกน้อย', 1),
(21, 1021, 'เขต บางขุนเทียน', 1),
(22, 1022, 'เขต ภาษีเจริญ', 1),
(23, 1023, 'เขต หนองแขม', 1),
(24, 1024, 'เขต ราษฎร์บูรณะ', 1),
(25, 1025, 'เขต บางพลัด', 1),
(26, 1026, 'เขต ดินแดง', 1),
(27, 1027, 'เขต บึงกุ่ม', 1),
(28, 1028, 'เขต สาทร', 1),
(29, 1029, 'เขต บางซื่อ', 1),
(30, 1030, 'เขต จตุจักร', 1),
(31, 1031, 'เขต บางคอแหลม', 1),
(32, 1032, 'เขต ประเวศ', 1),
(33, 1033, 'เขต คลองเตย', 1),
(34, 1034, 'เขต สวนหลวง', 1),
(35, 1035, 'เขต จอมทอง', 1),
(36, 1036, 'เขต ดอนเมือง', 1),
(37, 1037, 'เขต ราชเทวี', 1),
(38, 1038, 'เขต ลาดพร้าว', 1),
(39, 1039, 'เขต วัฒนา', 1),
(40, 1040, 'เขต บางแค', 1),
(41, 1041, 'เขต หลักสี่', 1),
(42, 1042, 'เขต สายไหม', 1),
(43, 1043, 'เขต คันนายาว', 1),
(44, 1044, 'เขต สะพานสูง', 1),
(45, 1045, 'เขต วังทองหลาง', 1),
(46, 1046, 'เขต คลองสามวา', 1),
(47, 1047, 'เขต บางนา', 1),
(48, 1048, 'เขต ทวีวัฒนา', 1),
(49, 1049, 'เขต ทุ่งครุ', 1),
(50, 1050, 'เขต บางบอน', 1),
(51, 1101, 'เมืองสมุทรปราการ', 2),
(52, 1102, 'บางบ่อ', 2),
(53, 1103, 'บางพลี', 2),
(54, 1104, 'พระประแดง', 2),
(55, 1105, 'พระสมุทรเจดีย์', 2),
(56, 1106, 'บางเสาธง', 2),
(57, 1201, 'เมืองนนทบุรี', 3),
(58, 1202, 'บางกรวย', 3),
(59, 1203, 'บางใหญ่', 3),
(60, 1204, 'บางบัวทอง', 3),
(61, 1205, 'ไทรน้อย', 3),
(62, 1206, 'ปากเกร็ด', 3),
(63, 1301, 'เมืองปทุมธานี', 4),
(64, 1302, 'คลองหลวง', 4),
(65, 1303, 'ธัญบุรี', 4),
(66, 1304, 'หนองเสือ', 4),
(67, 1305, 'ลาดหลุมแก้ว', 4),
(68, 1306, 'ลำลูกกา', 4),
(69, 1307, 'สามโคก', 4),
(70, 1401, 'พระนครศรีอยุธยา', 5),
(71, 1402, 'ท่าเรือ', 5),
(72, 1403, 'นครหลวง', 5),
(73, 1404, 'บางไทร', 5),
(74, 1405, 'บางบาล', 5),
(75, 1406, 'บางปะอิน', 5),
(76, 1407, 'บางปะหัน', 5),
(77, 1408, 'ผักไห่', 5),
(78, 1409, 'ภาชี', 5),
(79, 1410, 'ลาดบัวหลวง', 5),
(80, 1411, 'วังน้อย', 5),
(81, 1412, 'เสนา', 5),
(82, 1413, 'บางซ้าย', 5),
(83, 1414, 'อุทัย', 5),
(84, 1415, 'มหาราช', 5),
(85, 1416, 'บ้านแพรก', 5),
(86, 1501, 'เมืองอ่างทอง', 6),
(87, 1502, 'ไชโย', 6),
(88, 1503, 'ป่าโมก', 6),
(89, 1504, 'โพธิ์ทอง', 6),
(90, 1505, 'แสวงหา', 6),
(91, 1506, 'วิเศษชัยชาญ', 6),
(92, 1507, 'สามโก้', 6),
(93, 1601, 'เมืองลพบุรี', 7),
(94, 1602, 'พัฒนานิคม', 7),
(95, 1603, 'โคกสำโรง', 7),
(96, 1604, 'ชัยบาดาล', 7),
(97, 1605, 'ท่าวุ้ง', 7),
(98, 1606, 'บ้านหมี่', 7),
(99, 1607, 'ท่าหลวง', 7),
(100, 1608, 'สระโบสถ์', 7),
(101, 1609, 'โคกเจริญ', 7),
(102, 1610, 'ลำสนธิ', 7),
(103, 1611, 'หนองม่วง', 7),
(104, 1701, 'เมืองสิงห์บุรี', 8),
(105, 1702, 'บางระจัน', 8),
(106, 1703, 'ค่ายบางระจัน', 8),
(107, 1704, 'พรหมบุรี', 8),
(108, 1705, 'ท่าช้าง', 8),
(109, 1706, 'อินทร์บุรี', 8),
(110, 1801, 'เมืองชัยนาท', 9),
(111, 1802, 'มโนรมย์', 9),
(112, 1803, 'วัดสิงห์', 9),
(113, 1804, 'สรรพยา', 9),
(114, 1805, 'สรรคบุรี', 9),
(115, 1806, 'หันคา', 9),
(116, 1807, 'หนองมะโมง', 9),
(117, 1808, 'เนินขาม', 9),
(118, 1901, 'เมืองสระบุรี', 10),
(119, 1902, 'แก่งคอย', 10),
(120, 1903, 'หนองแค', 10),
(121, 1904, 'วิหารแดง', 10),
(122, 1905, 'หนองแซง', 10),
(123, 1906, 'บ้านหมอ', 10),
(124, 1907, 'ดอนพุด', 10),
(125, 1908, 'หนองโดน', 10),
(126, 1909, 'พระพุทธบาท', 10),
(127, 1910, 'เสาไห้', 10),
(128, 1911, 'มวกเหล็ก', 10),
(129, 1912, 'วังม่วง', 10),
(130, 1913, 'เฉลิมพระเกียรติ', 10),
(131, 2001, 'เมืองชลบุรี', 11),
(132, 2002, 'บ้านบึง', 11),
(133, 2003, 'หนองใหญ่', 11),
(134, 2004, 'บางละมุง', 11),
(135, 2005, 'พานทอง', 11),
(136, 2006, 'พนัสนิคม', 11),
(137, 2007, 'ศรีราชา', 11),
(138, 2008, 'เกาะสีชัง', 11),
(139, 2009, 'สัตหีบ', 11),
(140, 2010, 'บ่อทอง', 11),
(141, 2011, 'เกาะจันทร์', 11),
(142, 2101, 'เมืองระยอง', 12),
(143, 2102, 'บ้านฉาง', 12),
(144, 2103, 'แกลง', 12),
(145, 2104, 'วังจันทร์', 12),
(146, 2105, 'บ้านค่าย', 12),
(147, 2106, 'ปลวกแดง', 12),
(148, 2107, 'เขาชะเมา', 12),
(149, 2108, 'นิคมพัฒนา', 12),
(150, 2201, 'เมืองจันทบุรี', 13),
(151, 2202, 'ขลุง', 13),
(152, 2203, 'ท่าใหม่', 13),
(153, 2204, 'โป่งน้ำร้อน', 13),
(154, 2205, 'มะขาม', 13),
(155, 2206, 'แหลมสิงห์', 13),
(156, 2207, 'สอยดาว', 13),
(157, 2208, 'แก่งหางแมว', 13),
(158, 2209, 'นายายอาม', 13),
(159, 2210, 'เขาคิชฌกูฏ', 13),
(160, 2301, 'เมืองตราด', 14),
(161, 2302, 'คลองใหญ่', 14),
(162, 2303, 'เขาสมิง', 14),
(163, 2304, 'บ่อไร่', 14),
(164, 2305, 'แหลมงอบ', 14),
(165, 2306, 'เกาะกูด', 14),
(166, 2307, 'เกาะช้าง', 14),
(167, 2401, 'เมืองฉะเชิงเทรา', 15),
(168, 2402, 'บางคล้า', 15),
(169, 2403, 'บางน้ำเปรี้ยว', 15),
(170, 2404, 'บางปะกง', 15),
(171, 2405, 'บ้านโพธิ์', 15),
(172, 2406, 'พนมสารคาม', 15),
(173, 2407, 'ราชสาส์น', 15),
(174, 2408, 'สนามชัยเขต', 15),
(175, 2409, 'แปลงยาว', 15),
(176, 2410, 'ท่าตะเกียบ', 15),
(177, 2411, 'คลองเขื่อน', 15),
(178, 2501, 'เมืองปราจีนบุรี', 16),
(179, 2502, 'กบินทร์บุรี', 16),
(180, 2503, 'นาดี', 16),
(181, 2506, 'บ้านสร้าง', 16),
(182, 2507, 'ประจันตคาม', 16),
(183, 2508, 'ศรีมหาโพธิ', 16),
(184, 2509, 'ศรีมโหสถ', 16),
(185, 2601, 'เมืองนครนายก', 17),
(186, 2602, 'ปากพลี', 17),
(187, 2603, 'บ้านนา', 17),
(188, 2604, 'องครักษ์', 17),
(189, 2701, 'เมืองสระแก้ว', 18),
(190, 2702, 'คลองหาด', 18),
(191, 2703, 'ตาพระยา', 18),
(192, 2704, 'วังน้ำเย็น', 18),
(193, 2705, 'วัฒนานคร', 18),
(194, 2706, 'อรัญประเทศ', 18),
(195, 2707, 'เขาฉกรรจ์', 18),
(196, 2708, 'โคกสูง', 18),
(197, 2709, 'วังสมบูรณ์', 18),
(198, 3001, 'เมืองนครราชสีมา', 19),
(199, 3002, 'ครบุรี', 19),
(200, 3003, 'เสิงสาง', 19),
(201, 3004, 'คง', 19),
(202, 3005, 'บ้านเหลื่อม', 19),
(203, 3006, 'จักราช', 19),
(204, 3007, 'โชคชัย', 19),
(205, 3008, 'ด่านขุนทด', 19),
(206, 3009, 'โนนไทย', 19),
(207, 3010, 'โนนสูง', 19),
(208, 3011, 'ขามสะแกแสง', 19),
(209, 3012, 'บัวใหญ่', 19),
(210, 3013, 'ประทาย', 19),
(211, 3014, 'ปักธงชัย', 19),
(212, 3015, 'พิมาย', 19),
(213, 3016, 'ห้วยแถลง', 19),
(214, 3017, 'ชุมพวง', 19),
(215, 3018, 'สูงเนิน', 19),
(216, 3019, 'ขามทะเลสอ', 19),
(217, 3020, 'สีคิ้ว', 19),
(218, 3021, 'ปากช่อง', 19),
(219, 3022, 'หนองบุญมาก', 19),
(220, 3023, 'แก้งสนามนาง', 19),
(221, 3024, 'โนนแดง', 19),
(222, 3025, 'วังน้ำเขียว', 19),
(223, 3026, 'เทพารักษ์', 19),
(224, 3027, 'เมืองยาง', 19),
(225, 3028, 'พระทองคำ', 19),
(226, 3029, 'ลำทะเมนชัย', 19),
(227, 3030, 'บัวลาย', 19),
(228, 3031, 'สีดา', 19),
(229, 3032, 'เฉลิมพระเกียรติ', 19),
(230, 3101, 'เมืองบุรีรัมย์', 20),
(231, 3102, 'คูเมือง', 20),
(232, 3103, 'กระสัง', 20),
(233, 3104, 'นางรอง', 20),
(234, 3105, 'หนองกี่', 20),
(235, 3106, 'ละหานทราย', 20),
(236, 3107, 'ประโคนชัย', 20),
(237, 3108, 'บ้านกรวด', 20),
(238, 3109, 'พุทไธสง', 20),
(239, 3110, 'ลำปลายมาศ', 20),
(240, 3111, 'สตึก', 20),
(241, 3112, 'ปะคำ', 20),
(242, 3113, 'นาโพธิ์', 20),
(243, 3114, 'หนองหงส์', 20),
(244, 3115, 'พลับพลาชัย', 20),
(245, 3116, 'ห้วยราช', 20),
(246, 3117, 'โนนสุวรรณ', 20),
(247, 3118, 'ชำนิ', 20),
(248, 3119, 'บ้านใหม่ไชยพจน์', 20),
(249, 3120, 'โนนดินแดง', 20),
(250, 3121, 'บ้านด่าน', 20),
(251, 3122, 'แคนดง', 20),
(252, 3123, 'เฉลิมพระเกียรติ', 20),
(253, 3201, 'เมืองสุรินทร์', 21),
(254, 3202, 'ชุมพลบุรี', 21),
(255, 3203, 'ท่าตูม', 21),
(256, 3204, 'จอมพระ', 21),
(257, 3205, 'ปราสาท', 21),
(258, 3206, 'กาบเชิง', 21),
(259, 3207, 'รัตนบุรี', 21),
(260, 3208, 'สนม', 21),
(261, 3209, 'ศีขรภูมิ', 21),
(262, 3210, 'สังขะ', 21),
(263, 3211, 'ลำดวน', 21),
(264, 3212, 'สำโรงทาบ', 21),
(265, 3213, 'บัวเชด', 21),
(266, 3214, 'พนมดงรัก', 21),
(267, 3215, 'ศรีณรงค์', 21),
(268, 3216, 'เขวาสินรินทร์', 21),
(269, 3217, 'โนนนารายณ์', 21),
(270, 3301, 'เมืองศรีสะเกษ', 22),
(271, 3302, 'ยางชุมน้อย', 22),
(272, 3303, 'กันทรารมย์', 22),
(273, 3304, 'กันทรลักษ์', 22),
(274, 3305, 'ขุขันธ์', 22),
(275, 3306, 'ไพรบึง', 22),
(276, 3307, 'ปรางค์กู่', 22),
(277, 3308, 'ขุนหาญ', 22),
(278, 3309, 'ราษีไศล', 22),
(279, 3310, 'อุทุมพรพิสัย', 22),
(280, 3311, 'บึงบูรพ์', 22),
(281, 3312, 'ห้วยทับทัน', 22),
(282, 3313, 'โนนคูณ', 22),
(283, 3314, 'ศรีรัตนะ', 22),
(284, 3315, 'น้ำเกลี้ยง', 22),
(285, 3316, 'วังหิน', 22),
(286, 3317, 'ภูสิงห์', 22),
(287, 3318, 'เมืองจันทร์', 22),
(288, 3319, 'เบญจลักษ์', 22),
(289, 3320, 'พยุห์', 22),
(290, 3321, 'โพธิ์ศรีสุวรรณ', 22),
(291, 3322, 'ศิลาลาด', 22),
(292, 3401, 'เมืองอุบลราชธานี', 23),
(293, 3402, 'ศรีเมืองใหม่', 23),
(294, 3403, 'โขงเจียม', 23),
(295, 3404, 'เขื่องใน', 23),
(296, 3405, 'เขมราฐ', 23),
(297, 3407, 'เดชอุดม', 23),
(298, 3408, 'นาจะหลวย', 23),
(299, 3409, 'น้ำยืน', 23),
(300, 3410, 'บุณฑริก', 23),
(301, 3411, 'ตระการพืชผล', 23),
(302, 3412, 'กุดข้าวปุ้น', 23),
(303, 3414, 'ม่วงสามสิบ', 23),
(304, 3415, 'วารินชำราบ', 23),
(305, 3419, 'พิบูลมังสาหาร', 23),
(306, 3420, 'ตาลสุม', 23),
(307, 3421, 'โพธิ์ไทร', 23),
(308, 3422, 'สำโรง', 23),
(309, 3424, 'ดอนมดแดง', 23),
(310, 3425, 'สิรินธร', 23),
(311, 3426, 'ทุ่งศรีอุดม', 23),
(312, 3429, 'นาเยีย', 23),
(313, 3430, 'นาตาล', 23),
(314, 3431, 'เหล่าเสือโก้ก', 23),
(315, 3432, 'สว่างวีระวงศ์', 23),
(316, 3433, 'น้ำขุ่น', 23),
(317, 3501, 'เมืองยโสธร', 24),
(318, 3502, 'ทรายมูล', 24),
(319, 3503, 'กุดชุม', 24),
(320, 3504, 'คำเขื่อนแก้ว', 24),
(321, 3505, 'ป่าติ้ว', 24),
(322, 3506, 'มหาชนะชัย', 24),
(323, 3507, 'ค้อวัง', 24),
(324, 3508, 'เลิงนกทา', 24),
(325, 3509, 'ไทยเจริญ', 24),
(326, 3601, 'เมืองชัยภูมิ', 25),
(327, 3602, 'บ้านเขว้า', 25),
(328, 3603, 'คอนสวรรค์', 25),
(329, 3604, 'เกษตรสมบูรณ์', 25),
(330, 3605, 'หนองบัวแดง', 25),
(331, 3606, 'จัตุรัส', 25),
(332, 3607, 'บำเหน็จณรงค์', 25),
(333, 3608, 'หนองบัวระเหว', 25),
(334, 3609, 'เทพสถิต', 25),
(335, 3610, 'ภูเขียว', 25),
(336, 3611, 'บ้านแท่น', 25),
(337, 3612, 'แก้งคร้อ', 25),
(338, 3613, 'คอนสาร', 25),
(339, 3614, 'ภักดีชุมพล', 25),
(340, 3615, 'เนินสง่า', 25),
(341, 3616, 'ซับใหญ่', 25),
(342, 3701, 'เมืองอำนาจเจริญ', 26),
(343, 3702, 'ชานุมาน', 26),
(344, 3703, 'ปทุมราชวงศา', 26),
(345, 3704, 'พนา', 26),
(346, 3705, 'เสนางคนิคม', 26),
(347, 3706, 'หัวตะพาน', 26),
(348, 3707, 'ลืออำนาจ', 26),
(349, 3801, 'บึงกาฬ', 27),
(350, 3802, 'พรเจริญ', 27),
(351, 3803, 'โซ่พิสัย', 27),
(352, 3804, 'เซกา', 27),
(353, 3805, 'ปากคาด', 27),
(354, 3806, 'บึงโขงหลง', 27),
(355, 3807, 'ศรีวิไล', 27),
(356, 3808, 'บุ่งคล้า', 27),
(357, 3901, 'เมืองหนองบัวลำภู', 28),
(358, 3902, 'นากลาง', 28),
(359, 3903, 'โนนสัง', 28),
(360, 3904, 'ศรีบุญเรือง', 28),
(361, 3905, 'สุวรรณคูหา', 28),
(362, 3906, 'นาวัง', 28),
(363, 4001, 'เมืองขอนแก่น', 29),
(364, 4002, 'บ้านฝาง', 29),
(365, 4003, 'พระยืน', 29),
(366, 4004, 'หนองเรือ', 29),
(367, 4005, 'ชุมแพ', 29),
(368, 4006, 'สีชมพู', 29),
(369, 4007, 'น้ำพอง', 29),
(370, 4008, 'อุบลรัตน์', 29),
(371, 4009, 'กระนวน', 29),
(372, 4010, 'บ้านไผ่', 29),
(373, 4011, 'เปือยน้อย', 29),
(374, 4012, 'พล', 29),
(375, 4013, 'แวงใหญ่', 29),
(376, 4014, 'แวงน้อย', 29),
(377, 4015, 'หนองสองห้อง', 29),
(378, 4016, 'ภูเวียง', 29),
(379, 4017, 'มัญจาคีรี', 29),
(380, 4018, 'ชนบท', 29),
(381, 4019, 'เขาสวนกวาง', 29),
(382, 4020, 'ภูผาม่าน', 29),
(383, 4021, 'ซำสูง', 29),
(384, 4022, 'โคกโพธิ์ไชย', 29),
(385, 4023, 'หนองนาคำ', 29),
(386, 4024, 'บ้านแฮด', 29),
(387, 4025, 'โนนศิลา', 29),
(388, 4026, 'เวียงเก่า', 29),
(389, 4101, 'เมืองอุดรธานี', 30),
(390, 4102, 'กุดจับ', 30),
(391, 4103, 'หนองวัวซอ', 30),
(392, 4104, 'กุมภวาปี', 30),
(393, 4105, 'โนนสะอาด', 30),
(394, 4106, 'หนองหาน', 30),
(395, 4107, 'ทุ่งฝน', 30),
(396, 4108, 'ไชยวาน', 30),
(397, 4109, 'ศรีธาตุ', 30),
(398, 4110, 'วังสามหมอ', 30),
(399, 4111, 'บ้านดุง', 30),
(400, 4117, 'บ้านผือ', 30),
(401, 4118, 'น้ำโสม', 30),
(402, 4119, 'เพ็ญ', 30),
(403, 4120, 'สร้างคอม', 30),
(404, 4121, 'หนองแสง', 30),
(405, 4122, 'นายูง', 30),
(406, 4123, 'พิบูลย์รักษ์', 30),
(407, 4124, 'กู่แก้ว', 30),
(408, 4125, 'ประจักษ์ศิลปาคม', 30),
(409, 4201, 'เมืองเลย', 31),
(410, 4202, 'นาด้วง', 31),
(411, 4203, 'เชียงคาน', 31),
(412, 4204, 'ปากชม', 31),
(413, 4205, 'ด่านซ้าย', 31),
(414, 4206, 'นาแห้ว', 31),
(415, 4207, 'ภูเรือ', 31),
(416, 4208, 'ท่าลี่', 31),
(417, 4209, 'วังสะพุง', 31),
(418, 4210, 'ภูกระดึง', 31),
(419, 4211, 'ภูหลวง', 31),
(420, 4212, 'ผาขาว', 31),
(421, 4213, 'เอราวัณ', 31),
(422, 4214, 'หนองหิน', 31),
(423, 4301, 'เมืองหนองคาย', 32),
(424, 4302, 'ท่าบ่อ', 32),
(425, 4305, 'โพนพิสัย', 32),
(426, 4307, 'ศรีเชียงใหม่', 32),
(427, 4308, 'สังคม', 32),
(428, 4314, 'สระใคร', 32),
(429, 4315, 'เฝ้าไร่', 32),
(430, 4316, 'รัตนวาปี', 32),
(431, 4317, 'โพธิ์ตาก', 32),
(432, 4401, 'เมืองมหาสารคาม', 33),
(433, 4402, 'แกดำ', 33),
(434, 4403, 'โกสุมพิสัย', 33),
(435, 4404, 'กันทรวิชัย', 33),
(436, 4405, 'เชียงยืน', 33),
(437, 4406, 'บรบือ', 33),
(438, 4407, 'นาเชือก', 33),
(439, 4408, 'พยัคฆภูมิพิสัย', 33),
(440, 4409, 'วาปีปทุม', 33),
(441, 4410, 'นาดูน', 33),
(442, 4411, 'ยางสีสุราช', 33),
(443, 4412, 'กุดรัง', 33),
(444, 4413, 'ชื่นชม', 33),
(445, 4501, 'เมืองร้อยเอ็ด', 34),
(446, 4502, 'เกษตรวิสัย', 34),
(447, 4503, 'ปทุมรัตต์', 34),
(448, 4504, 'จตุรพักตรพิมาน', 34),
(449, 4505, 'ธวัชบุรี', 34),
(450, 4506, 'พนมไพร', 34),
(451, 4507, 'โพนทอง', 34),
(452, 4508, 'โพธิ์ชัย', 34),
(453, 4509, 'หนองพอก', 34),
(454, 4510, 'เสลภูมิ', 34),
(455, 4511, 'สุวรรณภูมิ', 34),
(456, 4512, 'เมืองสรวง', 34),
(457, 4513, 'โพนทราย', 34),
(458, 4514, 'อาจสามารถ', 34),
(459, 4515, 'เมยวดี', 34),
(460, 4516, 'ศรีสมเด็จ', 34),
(461, 4517, 'จังหาร', 34),
(462, 4518, 'เชียงขวัญ', 34),
(463, 4519, 'หนองฮี', 34),
(464, 4520, 'ทุ่งเขาหลวง', 34),
(465, 4601, 'เมืองกาฬสินธุ์', 35),
(466, 4602, 'นามน', 35),
(467, 4603, 'กมลาไสย', 35),
(468, 4604, 'ร่องคำ', 35),
(469, 4605, 'กุฉินารายณ์', 35),
(470, 4606, 'เขาวง', 35),
(471, 4607, 'ยางตลาด', 35),
(472, 4608, 'ห้วยเม็ก', 35),
(473, 4609, 'สหัสขันธ์', 35),
(474, 4610, 'คำม่วง', 35),
(475, 4611, 'ท่าคันโท', 35),
(476, 4612, 'หนองกุงศรี', 35),
(477, 4613, 'สมเด็จ', 35),
(478, 4614, 'ห้วยผึ้ง', 35),
(479, 4615, 'สามชัย', 35),
(480, 4616, 'นาคู', 35),
(481, 4617, 'ดอนจาน', 35),
(482, 4618, 'ฆ้องชัย', 35),
(483, 4701, 'เมืองสกลนคร', 36),
(484, 4702, 'กุสุมาลย์', 36),
(485, 4703, 'กุดบาก', 36),
(486, 4704, 'พรรณานิคม', 36),
(487, 4705, 'พังโคน', 36),
(488, 4706, 'วาริชภูมิ', 36),
(489, 4707, 'นิคมน้ำอูน', 36),
(490, 4708, 'วานรนิวาส', 36),
(491, 4709, 'คำตากล้า', 36),
(492, 4710, 'บ้านม่วง', 36),
(493, 4711, 'อากาศอำนวย', 36),
(494, 4712, 'สว่างแดนดิน', 36),
(495, 4713, 'ส่องดาว', 36),
(496, 4714, 'เต่างอย', 36),
(497, 4715, 'โคกศรีสุพรรณ', 36),
(498, 4716, 'เจริญศิลป์', 36),
(499, 4717, 'โพนนาแก้ว', 36),
(500, 4718, 'ภูพาน', 36),
(501, 4801, 'เมืองนครพนม', 37),
(502, 4802, 'ปลาปาก', 37),
(503, 4803, 'ท่าอุเทน', 37),
(504, 4804, 'บ้านแพง', 37),
(505, 4805, 'ธาตุพนม', 37),
(506, 4806, 'เรณูนคร', 37),
(507, 4807, 'นาแก', 37),
(508, 4808, 'ศรีสงคราม', 37),
(509, 4809, 'นาหว้า', 37),
(510, 4810, 'โพนสวรรค์', 37),
(511, 4811, 'นาทม', 37),
(512, 4812, 'วังยาง', 37),
(513, 4901, 'เมืองมุกดาหาร', 38),
(514, 4902, 'นิคมคำสร้อย', 38),
(515, 4903, 'ดอนตาล', 38),
(516, 4904, 'ดงหลวง', 38),
(517, 4905, 'คำชะอี', 38),
(518, 4906, 'ว่านใหญ่', 38),
(519, 4907, 'หนองสูง', 38),
(520, 5001, 'เมืองเชียงใหม่', 39),
(521, 5002, 'จอมทอง', 39),
(522, 5003, 'แม่แจ่ม', 39),
(523, 5004, 'เชียงดาว', 39),
(524, 5005, 'ดอยสะเก็ด', 39),
(525, 5006, 'แม่แตง', 39),
(526, 5007, 'แม่ริม', 39),
(527, 5008, 'สะเมิง', 39),
(528, 5009, 'ฝาง', 39),
(529, 5010, 'แม่อาย', 39),
(530, 5011, 'พร้าว', 39),
(531, 5012, 'สันป่าตอง', 39),
(532, 5013, 'สันกำแพง', 39),
(533, 5014, 'สันทราย', 39),
(534, 5015, 'หางดง', 39),
(535, 5016, 'ฮอด', 39),
(536, 5017, 'ดอยเต่า', 39),
(537, 5018, 'อมก๋อย', 39),
(538, 5019, 'สารภี', 39),
(539, 5020, 'เวียงแหง', 39),
(540, 5021, 'ไชยปราการ', 39),
(541, 5022, 'แม่วาง', 39),
(542, 5023, 'แม่ออน', 39),
(543, 5024, 'ดอยหล่อ', 39),
(544, 5025, 'กัลยาณิวัฒนา', 39),
(545, 5101, 'เมืองลำพูน', 40),
(546, 5102, 'แม่ทา', 40),
(547, 5103, 'บ้านโฮ่ง', 40),
(548, 5104, 'ลี้', 40),
(549, 5105, 'ทุ่งหัวช้าง', 40),
(550, 5106, 'ป่าซาง', 40),
(551, 5107, 'บ้านธิ', 40),
(552, 5108, 'เวียงหนองล่อง', 40),
(553, 5201, 'เมืองลำปาง', 41),
(554, 5202, 'แม่เมาะ', 41),
(555, 5203, 'เกาะคา', 41),
(556, 5204, 'เสริมงาม', 41),
(557, 5205, 'งาว', 41),
(558, 5206, 'แจ้ห่ม', 41),
(559, 5207, 'วังเหนือ', 41),
(560, 5208, 'เถิน', 41),
(561, 5209, 'แม่พริก', 41),
(562, 5210, 'แม่ทะ', 41),
(563, 5211, 'สบปราบ', 41),
(564, 5212, 'ห้างฉัตร', 41),
(565, 5213, 'เมืองปาน', 41),
(566, 5301, 'เมืองอุตรดิตถ์', 42),
(567, 5302, 'ตรอน', 42),
(568, 5303, 'ท่าปลา', 42),
(569, 5304, 'น้ำปาด', 42),
(570, 5305, 'ฟากท่า', 42),
(571, 5306, 'บ้านโคก', 42),
(572, 5307, 'พิชัย', 42),
(573, 5308, 'ลับแล', 42),
(574, 5309, 'ทองแสนขัน', 42),
(575, 5401, 'เมืองแพร่', 43),
(576, 5402, 'ร้องกวาง', 43),
(577, 5403, 'ลอง', 43),
(578, 5404, 'สูงเม่น', 43),
(579, 5405, 'เด่นชัย', 43),
(580, 5406, 'สอง', 43),
(581, 5407, 'วังชิ้น', 43),
(582, 5408, 'หนองม่วงไข่', 43),
(583, 5501, 'เมืองน่าน', 44),
(584, 5502, 'แม่จริม', 44),
(585, 5503, 'บ้านหลวง', 44),
(586, 5504, 'นาน้อย', 44),
(587, 5505, 'ปัว', 44),
(588, 5506, 'ท่าวังผา', 44),
(589, 5507, 'เวียงสา', 44),
(590, 5508, 'ทุ่งช้าง', 44),
(591, 5509, 'เชียงกลาง', 44),
(592, 5510, 'นาหมื่น', 44),
(593, 5511, 'สันติสุข', 44),
(594, 5512, 'บ่อเกลือ', 44),
(595, 5513, 'สองแคว', 44),
(596, 5514, 'ภูเพียง', 44),
(597, 5515, 'เฉลิมพระเกียรติ', 44),
(598, 5601, 'เมืองพะเยา', 45),
(599, 5602, 'จุน', 45),
(600, 5603, 'เชียงคำ', 45),
(601, 5604, 'เชียงม่วน', 45),
(602, 5605, 'ดอกคำใต้', 45),
(603, 5606, 'ปง', 45),
(604, 5607, 'แม่ใจ', 45),
(605, 5608, 'ภูซาง', 45),
(606, 5609, 'ภูกามยาว', 45),
(607, 5701, 'เมืองเชียงราย', 46),
(608, 5702, 'เวียงชัย', 46),
(609, 5703, 'เชียงของ', 46),
(610, 5704, 'เทิง', 46),
(611, 5705, 'พาน', 46),
(612, 5706, 'ป่าแดด', 46),
(613, 5707, 'แม่จัน', 46),
(614, 5708, 'เชียงแสน', 46),
(615, 5709, 'แม่สาย', 46),
(616, 5710, 'แม่สรวย', 46),
(617, 5711, 'เวียงป่าเป้า', 46),
(618, 5712, 'พญาเม็งราย', 46),
(619, 5713, 'เวียงแก่น', 46),
(620, 5714, 'ขุนตาล', 46),
(621, 5715, 'แม่ฟ้าหลวง', 46),
(622, 5716, 'แม่ลาว', 46),
(623, 5717, 'เวียงเชียงรุ้ง', 46),
(624, 5718, 'ดอยหลวง', 46),
(625, 5801, 'เมืองแม่ฮ่องสอน', 47),
(626, 5802, 'ขุนยวม', 47),
(627, 5803, 'ปาย', 47),
(628, 5804, 'แม่สะเรียง', 47),
(629, 5805, 'แม่ลาน้อย', 47),
(630, 5806, 'สบเมย', 47),
(631, 5807, 'ปางมะผ้า', 47),
(632, 6001, 'เมืองนครสวรรค์', 48),
(633, 6002, 'โกรกพระ', 48),
(634, 6003, 'ชุมแสง', 48),
(635, 6004, 'หนองบัว', 48),
(636, 6005, 'บรรพตพิสัย', 48),
(637, 6006, 'เก้าเลี้ยว', 48),
(638, 6007, 'ตาคลี', 48),
(639, 6008, 'ท่าตะโก', 48),
(640, 6009, 'ไพศาลี', 48),
(641, 6010, 'พยุหะคีรี', 48),
(642, 6011, 'ลาดยาว', 48),
(643, 6012, 'ตากฟ้า', 48),
(644, 6013, 'แม่วงก์', 48),
(645, 6014, 'แม่เปิน', 48),
(646, 6015, 'ชุมตาบง', 48),
(647, 6101, 'เมืองอุทัยธานี', 49),
(648, 6102, 'ทัพทัน', 49),
(649, 6103, 'สว่างอารมณ์', 49),
(650, 6104, 'หนองฉาง', 49),
(651, 6105, 'หนองขาหย่าง', 49),
(652, 6106, 'บ้านไร่', 49),
(653, 6107, 'ลานสัก', 49),
(654, 6108, 'ห้วยคต', 49),
(655, 6201, 'เมืองกำแพงเพชร', 50),
(656, 6202, 'ไทรงาม', 50),
(657, 6203, 'คลองลาน', 50),
(658, 6204, 'ขาณุวรลักษบุรี', 50),
(659, 6205, 'คลองขลุง', 50),
(660, 6206, 'พรานกระต่าย', 50),
(661, 6207, 'ลานกระบือ', 50),
(662, 6208, 'ทรายทองวัฒนา', 50),
(663, 6209, 'ปางศิลาทอง', 50),
(664, 6210, 'บึงสามัคคี', 50),
(665, 6211, 'โกสัมพีนคร', 50),
(666, 6301, 'เมืองตาก', 51),
(667, 6302, 'บ้านตาก', 51),
(668, 6303, 'สามเงา', 51),
(669, 6304, 'แม่ระมาด', 51),
(670, 6305, 'ท่าสองยาง', 51),
(671, 6306, 'แม่สอด', 51),
(672, 6307, 'พบพระ', 51),
(673, 6308, 'อุ้มผาง', 51),
(674, 6309, 'วังเจ้า', 51),
(675, 6401, 'เมืองสุโขทัย', 52),
(676, 6402, 'บ้านด่านลานหอย', 52),
(677, 6403, 'คีรีมาศ', 52),
(678, 6404, 'กงไกรลาศ', 52),
(679, 6405, 'ศรีสัชนาลัย', 52),
(680, 6406, 'ศรีสำโรง', 52),
(681, 6407, 'สวรรคโลก', 52),
(682, 6408, 'ศรีนคร', 52),
(683, 6409, 'ทุ่งเสลี่ยม', 52),
(684, 6501, 'เมืองพิษณุโลก', 53),
(685, 6502, 'นครไทย', 53),
(686, 6503, 'ชาติตระการ', 53),
(687, 6504, 'บางระกำ', 53),
(688, 6505, 'บางกระทุ่ม', 53),
(689, 6506, 'พรหมพิราม', 53),
(690, 6507, 'วัดโบสถ์', 53),
(691, 6508, 'วังทอง', 53),
(692, 6509, 'เนินมะปราง', 53),
(693, 6601, 'เมืองพิจิตร', 54),
(694, 6602, 'วังทรายพูน', 54),
(695, 6603, 'โพธิ์ประทับช้าง', 54),
(696, 6604, 'ตะพานหิน', 54),
(697, 6605, 'บางมูลนาก', 54),
(698, 6606, 'โพทะเล', 54),
(699, 6607, 'สามง่าม', 54),
(700, 6608, 'ทับคล้อ', 54),
(701, 6609, 'สากเหล็ก', 54),
(702, 6610, 'บึงนาราง', 54),
(703, 6611, 'ดงเจริญ', 54),
(704, 6612, 'วชิรบารมี', 54),
(705, 6701, 'เมืองเพชรบูรณ์', 55),
(706, 6702, 'ชนแดน', 55),
(707, 6703, 'หล่มสัก', 55),
(708, 6704, 'หล่มเก่า', 55),
(709, 6705, 'วิเชียรบุรี', 55),
(710, 6706, 'ศรีเทพ', 55),
(711, 6707, 'หนองไผ่', 55),
(712, 6708, 'บึงสามพัน', 55),
(713, 6709, 'น้ำหนาว', 55),
(714, 6710, 'วังโป่ง', 55),
(715, 6711, 'เขาค้อ', 55),
(716, 7001, 'เมืองราชบุรี', 56),
(717, 7002, 'จอมบึง', 56),
(718, 7003, 'สวนผึ้ง', 56),
(719, 7004, 'ดำเนินสะดวก', 56),
(720, 7005, 'บ้านโป่ง', 56),
(721, 7006, 'บางแพ', 56),
(722, 7007, 'โพธาราม', 56),
(723, 7008, 'ปากท่อ', 56),
(724, 7009, 'วัดเพลง', 56),
(725, 7010, 'บ้านคา', 56),
(726, 7101, 'เมืองกาญจนบุรี', 57),
(727, 7102, 'ไทรโยค', 57),
(728, 7103, 'บ่อพลอย', 57),
(729, 7104, 'ศรีสวัสดิ์', 57),
(730, 7105, 'ท่ามะกา', 57),
(731, 7106, 'ท่าม่วง', 57),
(732, 7107, 'ทองผาภูมิ', 57),
(733, 7108, 'สังขละบุรี', 57),
(734, 7109, 'พนมทวน', 57),
(735, 7110, 'เลาขวัญ', 57),
(736, 7111, 'ด่านมะขามเตี้ย', 57),
(737, 7112, 'หนองปรือ', 57),
(738, 7113, 'ห้วยกระเจา', 57),
(739, 7201, 'เมืองสุพรรณบุรี', 58),
(740, 7202, 'เดิมบางนางบวช', 58),
(741, 7203, 'ด่านช้าง', 58),
(742, 7204, 'บางปลาม้า', 58),
(743, 7205, 'ศรีประจันต์', 58),
(744, 7206, 'ดอนเจดีย์', 58),
(745, 7207, 'สองพี่น้อง', 58),
(746, 7208, 'สามชุก', 58),
(747, 7209, 'อู่ทอง', 58),
(748, 7210, 'หนองหญ้าไซ', 58),
(749, 7301, 'เมืองนครปฐม', 59),
(750, 7302, 'กำแพงแสน', 59),
(751, 7303, 'นครชัยศรี', 59),
(752, 7304, 'ดอนตูม', 59),
(753, 7305, 'บางเลน', 59),
(754, 7306, 'สามพราน', 59),
(755, 7307, 'พุทธมณฑล', 59),
(756, 7401, 'เมืองสมุทรสาคร', 60),
(757, 7402, 'กระทุ่มแบน', 60),
(758, 7403, 'บ้านแพ้ว', 60),
(759, 7501, 'เมืองสมุทรสงคราม', 61),
(760, 7502, 'บางคนที', 61),
(761, 7503, 'อัมพวา', 61),
(762, 7601, 'เมืองเพชรบุรี', 62),
(763, 7602, 'เขาย้อย', 62),
(764, 7603, 'หนองหญ้าปล้อง', 62),
(765, 7604, 'ชะอำ', 62),
(766, 7605, 'ท่ายาง', 62),
(767, 7606, 'บ้านลาด', 62),
(768, 7607, 'บ้านแหลม', 62),
(769, 7608, 'แก่งกระจาน', 62),
(770, 7701, 'เมืองประจวบคีรีขันธ์', 63),
(771, 7702, 'กุยบุรี', 63),
(772, 7703, 'ทับสะแก', 63),
(773, 7704, 'บางสะพาน', 63),
(774, 7705, 'บางสะพานน้อย', 63),
(775, 7706, 'ปราณบุรี', 63),
(776, 7707, 'หัวหิน', 63),
(777, 7708, 'สามร้อยยอด', 63),
(778, 8001, 'เมืองนครศรีธรรมราช', 64),
(779, 8002, 'พรหมคีรี', 64),
(780, 8003, 'ลานสกา', 64),
(781, 8004, 'ฉวาง', 64),
(782, 8005, 'พิปูน', 64),
(783, 8006, 'เชียรใหญ่', 64),
(784, 8007, 'ชะอวด', 64),
(785, 8008, 'ท่าศาลา', 64),
(786, 8009, 'ทุ่งสง', 64),
(787, 8010, 'นาบอน', 64),
(788, 8011, 'ทุ่งใหญ่', 64),
(789, 8012, 'ปากพนัง', 64),
(790, 8013, 'ร่อนพิบูลย์', 64),
(791, 8014, 'สิชล', 64),
(792, 8015, 'ขนอม', 64),
(793, 8016, 'หัวไทร', 64),
(794, 8017, 'บางขัน', 64),
(795, 8018, 'ถ้ำพรรณรา', 64),
(796, 8019, 'จุฬาภรณ์', 64),
(797, 8020, 'พระพรหม', 64),
(798, 8021, 'นบพิตำ', 64),
(799, 8022, 'ช้างกลาง', 64),
(800, 8023, 'เฉลิมพระเกียรติ', 64),
(801, 8101, 'เมืองกระบี่', 65),
(802, 8102, 'เขาพนม', 65),
(803, 8103, 'เกาะลันตา', 65),
(804, 8104, 'คลองท่อม', 65),
(805, 8105, 'อ่าวลึก', 65),
(806, 8106, 'ปลายพระยา', 65),
(807, 8107, 'ลำทับ', 65),
(808, 8108, 'เหนือคลอง', 65),
(809, 8201, 'เมืองพังงา', 66),
(810, 8202, 'เกาะยาว', 66),
(811, 8203, 'กะปง', 66),
(812, 8204, 'ตะกั่วทุ่ง', 66),
(813, 8205, 'ตะกั่วป่า', 66),
(814, 8206, 'คุระบุรี', 66),
(815, 8207, 'ทับปุด', 66),
(816, 8208, 'ท้ายเหมือง', 66),
(817, 8301, 'เมืองภูเก็ต', 67),
(818, 8302, 'กะทู้', 67),
(819, 8303, 'ถลาง', 67),
(820, 8401, 'เมืองสุราษฎร์ธานี', 68),
(821, 8402, 'กาญจนดิษฐ์', 68),
(822, 8403, 'ดอนสัก', 68),
(823, 8404, 'เกาะสมุย', 68),
(824, 8405, 'เกาะพะงัน', 68),
(825, 8406, 'ไชยา', 68),
(826, 8407, 'ท่าชนะ', 68),
(827, 8408, 'คีรีรัฐนิคม', 68),
(828, 8409, 'บ้านตาขุน', 68),
(829, 8410, 'พนม', 68),
(830, 8411, 'ท่าฉาง', 68),
(831, 8412, 'บ้านนาสาร', 68),
(832, 8413, 'บ้านนาเดิม', 68),
(833, 8414, 'เคียนซา', 68),
(834, 8415, 'เวียงสระ', 68),
(835, 8416, 'พระแสง', 68),
(836, 8417, 'พุนพิน', 68),
(837, 8418, 'ชัยบุรี', 68),
(838, 8419, 'วิภาวดี', 68),
(839, 8501, 'เมืองระนอง', 69),
(840, 8502, 'ละอุ่น', 69),
(841, 8503, 'กะเปอร์', 69),
(842, 8504, 'กระบุรี', 69),
(843, 8505, 'สุขสำราญ', 69),
(844, 8601, 'เมืองชุมพร', 70),
(845, 8602, 'ท่าแซะ', 70),
(846, 8603, 'ปะทิว', 70),
(847, 8604, 'หลังสวน', 70),
(848, 8605, 'ละแม', 70),
(849, 8606, 'พะโต๊ะ', 70),
(850, 8607, 'สวี', 70),
(851, 8608, 'ทุ่งตะโก', 70),
(852, 9001, 'เมืองสงขลา', 71),
(853, 9002, 'สทิงพระ', 71),
(854, 9003, 'จะนะ', 71),
(855, 9004, 'นาทวี', 71),
(856, 9005, 'เทพา', 71),
(857, 9006, 'สะบ้าย้อย', 71),
(858, 9007, 'ระโนด', 71),
(859, 9008, 'กระแสสินธุ์', 71),
(860, 9009, 'รัตภูมิ', 71),
(861, 9010, 'สะเดา', 71),
(862, 9011, 'หาดใหญ่', 71),
(863, 9012, 'นาหม่อม', 71),
(864, 9013, 'ควนเนียง', 71),
(865, 9014, 'บางกล่ำ', 71),
(866, 9015, 'สิงหนคร', 71),
(867, 9016, 'คลองหอยโข่ง', 71),
(868, 9101, 'เมืองสตูล', 72),
(869, 9102, 'ควนโดน', 72),
(870, 9103, 'ควนกาหลง', 72),
(871, 9104, 'ท่าแพ', 72),
(872, 9105, 'ละงู', 72),
(873, 9106, 'ทุ่งหว้า', 72),
(874, 9107, 'มะนัง', 72),
(875, 9201, 'เมืองตรัง', 73),
(876, 9202, 'กันตัง', 73),
(877, 9203, 'ย่านตาขาว', 73),
(878, 9204, 'ปะเหลียน', 73),
(879, 9205, 'สิเกา', 73),
(880, 9206, 'ห้วยยอด', 73),
(881, 9207, 'วังวิเศษ', 73),
(882, 9208, 'นาโยง', 73),
(883, 9209, 'รัษฎา', 73),
(884, 9210, 'หาดสำราญ', 73),
(885, 9301, 'เมืองพัทลุง', 74),
(886, 9302, 'กงหรา', 74),
(887, 9303, 'เขาชัยสน', 74),
(888, 9304, 'ตะโหมด', 74),
(889, 9305, 'ควนขนุน', 74),
(890, 9306, 'ปากพะยูน', 74),
(891, 9307, 'ศรีบรรพต', 74),
(892, 9308, 'ป่าบอน', 74),
(893, 9309, 'บางแก้ว', 74),
(894, 9310, 'ป่าพยอม', 74),
(895, 9311, 'ศรีนครินทร์', 74),
(896, 9401, 'เมืองปัตตานี', 75),
(897, 9402, 'โคกโพธิ์', 75),
(898, 9403, 'หนองจิก', 75),
(899, 9404, 'ปะนาเระ', 75),
(900, 9405, 'มายอ', 75),
(901, 9406, 'ทุ่งยางแดง', 75),
(902, 9407, 'สายบุรี', 75),
(903, 9408, 'ไม้แก่น', 75),
(904, 9409, 'ยะหริ่ง', 75),
(905, 9410, 'ยะรัง', 75),
(906, 9411, 'กะพ้อ', 75),
(907, 9412, 'แม่ลาน', 75),
(908, 9501, 'เมืองยะลา', 76),
(909, 9502, 'เบตง', 76),
(910, 9503, 'บันนังสตา', 76),
(911, 9504, 'ธารโต', 76),
(912, 9505, 'ยะหา', 76),
(913, 9506, 'รามัน', 76),
(914, 9507, 'กาบัง', 76),
(915, 9508, 'กรงปีนัง', 76),
(916, 9601, 'เมืองนราธิวาส', 77),
(917, 9602, 'ตากใบ', 77),
(918, 9603, 'บาเจาะ', 77),
(919, 9604, 'ยี่งอ', 77),
(920, 9605, 'ระแงะ', 77),
(921, 9606, 'รือเสาะ', 77),
(922, 9607, 'ศรีสาคร', 77),
(923, 9608, 'แว้ง', 77),
(924, 9609, 'สุคิริน', 77),
(925, 9610, 'สุไหงโก-ลก', 77),
(926, 9611, 'สุไหงปาดี', 77),
(927, 9612, 'จะแนะ', 77),
(928, 9613, 'เจาะไอร้อง', 77);

-- --------------------------------------------------------

--
-- Table structure for table `db-emailtype`
--

CREATE TABLE `db-emailtype` (
  `ETID` int(11) NOT NULL,
  `Type` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-emailtype`
--

INSERT INTO `db-emailtype` (`ETID`, `Type`) VALUES
(1, 'gmail.com'),
(2, 'ku.ac.th'),
(3, 'ku.th');

-- --------------------------------------------------------

--
-- Table structure for table `db-farmer`
--

CREATE TABLE `db-farmer` (
  `UFID` int(11) NOT NULL,
  `Title` enum('1','2','3') NOT NULL,
  `FirstName` varchar(25) NOT NULL,
  `LastName` varchar(30) NOT NULL,
  `Icon` varchar(4) NOT NULL COMMENT 'เก็บเฉพาะนามสกุลไฟล์',
  `Address` text NOT NULL COMMENT 'ที่อยู่ (ไม่รวม ตำบล อำเภอ จังหวัด)',
  `AD3ID` int(11) NOT NULL,
  `IsBlock` tinyint(1) DEFAULT NULL,
  `ModifyDT` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-farmer`
--

INSERT INTO `db-farmer` (`UFID`, `Title`, `FirstName`, `LastName`, `Icon`, `Address`, `AD3ID`, `IsBlock`, `ModifyDT`) VALUES
(1, '1', 'โสภณ', 'โตใหญ่', 'png', '67 หมู่ 7', 306, 0, '2019-10-12 05:31:15');

-- --------------------------------------------------------

--
-- Table structure for table `db-fercondition`
--

CREATE TABLE `db-fercondition` (
  `FID` int(11) NOT NULL,
  `Order` int(11) NOT NULL,
  `Condition` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-fercondition`
--

INSERT INTO `db-fercondition` (`FID`, `Order`, `Condition`) VALUES
(1, 2, 'วันแดดออก'),
(2, 1, 'วันฝนตก'),
(2, 2, 'หลังการลดน้ำ');

-- --------------------------------------------------------

--
-- Table structure for table `db-fertilizer`
--

CREATE TABLE `db-fertilizer` (
  `FID` int(11) NOT NULL,
  `Name` varchar(25) NOT NULL,
  `lcon` varchar(4) NOT NULL,
  `Start` varchar(4) NOT NULL DEFAULT '0101',
  `End` varchar(4) NOT NULL DEFAULT '3112',
  `Modify` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `Usage` enum('1','2','3') NOT NULL,
  `EQ1` float NOT NULL,
  `EQ2` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-fertilizer`
--

INSERT INTO `db-fertilizer` (`FID`, `Name`, `lcon`, `Start`, `End`, `Modify`, `Usage`, `EQ1`, `EQ2`) VALUES
(1, 'ปุ๋ยตรากระต่าย', 'jpg', '0101', '3112', '2019-10-14 03:50:54', '1', 10, 10),
(2, 'ปุ๋ยตราม้าบิน', 'png', '0104', '0905', '2019-10-14 03:50:54', '1', 20, 20);

-- --------------------------------------------------------

--
-- Table structure for table `db-pestlist`
--

CREATE TABLE `db-pestlist` (
  `PID` int(11) NOT NULL,
  `Name` varchar(50) NOT NULL,
  `Alias` varchar(50) NOT NULL,
  `PTID` int(11) NOT NULL,
  `Charactor` text NOT NULL,
  `lcon` varchar(4) NOT NULL,
  `NumPicChar` int(11) NOT NULL DEFAULT '0',
  `NumPicDanger` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-pestlist`
--

INSERT INTO `db-pestlist` (`PID`, `Name`, `Alias`, `PTID`, `Charactor`, `lcon`, `NumPicChar`, `NumPicDanger`) VALUES
(1, 'Acanthocoris scabrator (Fabricius)', 'squash bug', 1, 'ทั้งตัวอ่อนและตัวเต็มวัยดูดกินอยู่บนพืชต้นเดียวกัน โดยมากจะอาศัยอยู่ใต้ใบและดอก ตัวอ่อนและตัวเต็มวัยดูดกินน้ำเลี้ยงจากต้น ใบและเมล็ดอ่อน ส่วนของพืชที่ถูกทำลาย: ผล,ใบ,ยอด,ลำต้น', 'png', 3, 1),
(2, 'Trialeurodes vaporariorum  Westwood, 1856', 'greenhouse whitefly', 1, 'ทั้งตัวอ่อนและตัวเต็มวัยเข้าทำลายพืชได้ทุกระยะ ดูดกินน้ำเลี้ยงบริเวณใต้ใบพืชทำให้พืชอ่อนแอเจริญเติบโตผิดปรกติ ส่วนของพืชที่ถูกทำลาย: ใบ,ผล,ช่อดอก,ลำต้น', 'png', 3, 2);

-- --------------------------------------------------------

--
-- Table structure for table `db-pesttype`
--

CREATE TABLE `db-pesttype` (
  `PTID` int(11) NOT NULL,
  `TypeTH` varchar(50) NOT NULL,
  `TypeEN` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-pesttype`
--

INSERT INTO `db-pesttype` (`PTID`, `TypeTH`, `TypeEN`) VALUES
(1, 'แมลงศัตรูพืช', 'insect pest '),
(2, 'โรคพืช ', 'plant disease '),
(3, 'วัชพืช ', 'weed '),
(4, 'ศัตรูพืชอื่นๆ ', 'other pests ');

-- --------------------------------------------------------

--
-- Table structure for table `db-province`
--

CREATE TABLE `db-province` (
  `AD1ID` int(11) NOT NULL,
  `code` int(11) NOT NULL,
  `Province` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-province`
--

INSERT INTO `db-province` (`AD1ID`, `code`, `Province`) VALUES
(1, 10, 'กรุงเทพมหานคร'),
(2, 11, 'สมุทรปราการ'),
(3, 12, 'นนทบุรี'),
(4, 13, 'ปทุมธานี'),
(5, 14, 'พระนครศรีอยุธยา'),
(6, 15, 'อ่างทอง'),
(7, 16, 'ลพบุรี'),
(8, 17, 'สิงห์บุรี'),
(9, 18, 'ชัยนาท'),
(10, 19, 'สระบุรี'),
(11, 20, 'ชลบุรี'),
(12, 21, 'ระยอง'),
(13, 22, 'จันทบุรี'),
(14, 23, 'ตราด'),
(15, 24, 'ฉะเชิงเทรา'),
(16, 25, 'ปราจีนบุรี'),
(17, 26, 'นครนายก'),
(18, 27, 'สระแก้ว'),
(19, 30, 'นครราชสีมา'),
(20, 31, 'บุรีรัมย์'),
(21, 32, 'สุรินทร์'),
(22, 33, 'ศรีสะเกษ'),
(23, 34, 'อุบลราชธานี'),
(24, 35, 'ยโสธร'),
(25, 36, 'ชัยภูมิ'),
(26, 37, 'อำนาจเจริญ'),
(27, 38, 'บึงกาฬ'),
(28, 39, 'หนองบัวลำภู'),
(29, 40, 'ขอนแก่น'),
(30, 41, 'อุดรธานี'),
(31, 42, 'เลย'),
(32, 43, 'หนองคาย'),
(33, 44, 'มหาสารคาม'),
(34, 45, 'ร้อยเอ็ด'),
(35, 46, 'กาฬสินธุ์'),
(36, 47, 'สกลนคร'),
(37, 48, 'นครพนม'),
(38, 49, 'มุกดาหาร'),
(39, 50, 'เชียงใหม่'),
(40, 51, 'ลำพูน'),
(41, 52, 'ลำปาง'),
(42, 53, 'อุตรดิตถ์'),
(43, 54, 'แพร่'),
(44, 55, 'น่าน'),
(45, 56, 'พะเยา'),
(46, 57, 'เชียงราย'),
(47, 58, 'แม่ฮ่องสอน'),
(48, 60, 'นครสวรรค์'),
(49, 61, 'อุทัยธานี'),
(50, 62, 'กำแพงเพชร'),
(51, 63, 'ตาก'),
(52, 64, 'สุโขทัย'),
(53, 65, 'พิษณุโลก'),
(54, 66, 'พิจิตร'),
(55, 67, 'เพชรบูรณ์'),
(56, 70, 'ราชบุรี'),
(57, 71, 'กาญจนบุรี'),
(58, 72, 'สุพรรณบุรี'),
(59, 73, 'นครปฐม'),
(60, 74, 'สมุทรสาคร'),
(61, 75, 'สมุทรสงคราม'),
(62, 76, 'เพชรบุรี'),
(63, 77, 'ประจวบคีรีขันธ์'),
(64, 80, 'นครศรีธรรมราช'),
(65, 81, 'กระบี่'),
(66, 82, 'พังงา'),
(67, 83, 'ภูเก็ต'),
(68, 84, 'สุราษฎร์ธานี'),
(69, 85, 'ระนอง'),
(70, 86, 'ชุมพร'),
(71, 90, 'สงขลา'),
(72, 91, 'สตูล'),
(73, 92, 'ตรัง'),
(74, 93, 'พัทลุง'),
(75, 94, 'ปัตตานี'),
(76, 95, 'ยะลา'),
(77, 96, 'นราธิวาส');

-- --------------------------------------------------------

--
-- Table structure for table `db-subdistrinct`
--

CREATE TABLE `db-subdistrinct` (
  `AD3ID` int(11) NOT NULL,
  `code` int(11) NOT NULL,
  `subDistrinct` varchar(30) NOT NULL,
  `latitude` decimal(6,3) NOT NULL,
  `longitude` decimal(6,3) NOT NULL,
  `AD2ID` int(11) NOT NULL,
  `zip_code` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-subdistrinct`
--

INSERT INTO `db-subdistrinct` (`AD3ID`, `code`, `subDistrinct`, `latitude`, `longitude`, `AD2ID`, `zip_code`) VALUES
(1, 100101, 'พระบรมมหาราชวัง', '13.751', '100.492', 1, 10200),
(2, 100102, 'วังบูรพาภิรมย์', '13.744', '100.499', 1, 10200),
(3, 100103, 'วัดราชบพิธ', '13.750', '100.499', 1, 10200),
(4, 100104, 'สำราญราษฎร์', '13.751', '100.503', 1, 10200),
(5, 100105, 'ศาลเจ้าพ่อเสือ', '13.754', '100.497', 1, 10200),
(6, 100106, 'เสาชิงช้า', '13.753', '100.500', 1, 10200),
(7, 100107, 'บวรนิเวศ', '13.757', '100.501', 1, 10200),
(8, 100108, 'ตลาดยอด', '13.760', '100.498', 1, 10200),
(9, 100109, 'ชนะสงคราม', '13.762', '100.495', 1, 10200),
(10, 100110, 'บ้านพานถม', '13.762', '100.503', 1, 10200),
(11, 100111, 'บางขุนพรหม', '13.765', '100.505', 1, 10200),
(12, 100112, 'วัดสามพระยา', '13.768', '100.499', 1, 10200),
(13, 100201, 'ดุสิต', '13.772', '100.513', 2, 10300),
(14, 100202, 'วชิรพยาบาล', '13.778', '100.505', 2, 10300),
(15, 100203, 'สวนจิตรลดา', '13.767', '100.520', 2, 10300),
(16, 100204, 'สี่แยกมหานาค', '13.758', '100.517', 2, 10300),
(17, 100206, 'ถนนนครไชยศรี', '13.789', '100.522', 2, 10300),
(18, 100301, 'กระทุ่มราย', '13.823', '100.897', 3, 10530),
(19, 100302, 'หนองจอก', '13.869', '100.885', 3, 10530),
(20, 100303, 'คลองสิบ', '13.914', '100.820', 3, 10530),
(21, 100304, 'คลองสิบสอง', '13.914', '100.880', 3, 10530),
(22, 100305, 'โคกแฝด', '13.840', '100.836', 3, 10530),
(23, 100306, 'คู้ฝั่งเหนือ', '13.872', '100.810', 3, 10530),
(24, 100307, 'ลำผักชี', '13.797', '100.844', 3, 10530),
(25, 100308, 'ลำต้อยติ่ง', '13.781', '100.877', 3, 10530),
(26, 100401, 'มหาพฤฒาราม', '13.734', '100.520', 4, 10500),
(27, 100402, 'สีลม', '13.730', '100.525', 4, 10500),
(28, 100403, 'สุริยวงศ์', '13.724', '100.530', 4, 10500),
(29, 100404, 'บางรัก', '13.727', '100.527', 4, 10500),
(30, 100405, 'สี่พระยา', '13.725', '100.514', 4, 10500),
(31, 100502, 'อนุสาวรีย์', '13.868', '100.606', 5, 10220),
(32, 100508, 'ท่าแร้ง', '13.866', '100.650', 5, 10220),
(33, 100601, 'คลองจั่น', '13.786', '100.635', 6, 10240),
(34, 100608, 'หัวหมาก', '13.756', '100.660', 6, 10240),
(35, 100701, 'รองเมือง', '13.744', '100.520', 7, 10330),
(36, 100702, 'วังใหม่', '13.742', '100.526', 7, 10330),
(37, 100703, 'ปทุมวัน', '13.740', '100.535', 7, 10330),
(38, 100704, 'ลุมพินี', '13.736', '100.546', 7, 10330),
(39, 100801, 'ป้อมปราบ', '13.743', '100.514', 8, 10100),
(40, 100802, 'วัดเทพศิรินทร์', '13.749', '100.512', 8, 10100),
(41, 100803, 'คลองมหานาค', '13.753', '100.513', 8, 10100),
(42, 100804, 'บ้านบาตร', '13.752', '100.507', 8, 10100),
(43, 100805, 'วัดโสมนัส', '13.759', '100.511', 8, 10100),
(44, 100905, 'บางจาก', '13.692', '100.626', 9, 10260),
(45, 101001, 'มีนบุรี', '13.804', '100.723', 10, 10510),
(46, 101002, 'แสนแสบ', '13.812', '100.774', 10, 10510),
(47, 101101, 'ลาดกระบัง', '13.723', '100.771', 11, 10520),
(48, 101102, 'คลองสองต้นนุ่น', '13.753', '100.723', 11, 10520),
(49, 101103, 'คลองสามประเวศ', '13.753', '100.754', 11, 10520),
(50, 101104, 'ลำปลาทิว', '13.765', '100.817', 11, 10520),
(51, 101105, 'ทับยาว', '13.728', '100.815', 11, 10520),
(52, 101106, 'ขุมทอง', '13.736', '100.855', 11, 10520),
(53, 101203, 'ช่องนนทรี', '13.682', '100.533', 12, 10120),
(54, 101204, 'บางโพงพาง', '13.697', '100.544', 12, 10120),
(55, 101301, 'จักรวรรดิ', '13.741', '100.504', 13, 10100),
(56, 101302, 'สัมพันธวงศ์', '13.739', '100.511', 13, 10100),
(57, 101303, 'ตลาดน้อย', '13.734', '100.513', 13, 10100),
(58, 101401, 'สามเสนใน', '13.782', '100.545', 14, 10400),
(59, 101501, 'วัดกัลยาณ์', '13.737', '100.493', 15, 10600),
(60, 101502, 'หิรัญรูจี', '13.731', '100.490', 15, 10600),
(61, 101503, 'บางยี่เรือ', '13.720', '100.482', 15, 10600),
(62, 101504, 'บุคคโล', '13.707', '100.486', 15, 10600),
(63, 101505, 'ตลาดพลู', '13.715', '100.473', 15, 10600),
(64, 101601, 'วัดอรุณ', '13.743', '100.486', 16, 10600),
(65, 101602, 'วัดท่าพระ', '13.733', '100.475', 16, 10600),
(66, 101701, 'ห้วยขวาง', '13.769', '100.577', 17, 10310),
(67, 101702, 'บางกะปิ', '13.752', '100.586', 17, 10310),
(68, 101704, 'สามเสนนอก', '13.796', '100.579', 17, 10310),
(69, 101801, 'สมเด็จเจ้าพระยา', '13.731', '100.497', 18, 10600),
(70, 101802, 'คลองสาน', '13.735', '100.504', 18, 10600),
(71, 101803, 'บางลำภูล่าง', '13.715', '100.501', 18, 10600),
(72, 101804, 'คลองต้นไทร', '13.725', '100.508', 18, 10600),
(73, 101901, 'คลองชักพระ', '13.760', '100.456', 19, 10170),
(74, 101902, 'ตลิ่งชัน', '13.789', '100.459', 19, 10170),
(75, 101903, 'ฉิมพลี', '13.786', '100.432', 19, 10170),
(76, 101904, 'บางพรม', '13.752', '100.442', 19, 10170),
(77, 101905, 'บางระมาด', '13.767', '100.431', 19, 10170),
(78, 101907, 'บางเชือกหนัง', '13.751', '100.419', 19, 10170),
(79, 102004, 'ศิริราช', '13.759', '100.481', 20, 10700),
(80, 102005, 'บ้านช่างหล่อ', '13.752', '100.477', 20, 10700),
(81, 102006, 'บางขุนนนท์', '13.774', '100.466', 20, 10700),
(82, 102007, 'บางขุนศรี', '13.760', '100.463', 20, 10700),
(83, 102009, 'อรุณอมรินทร์', '13.772', '100.477', 20, 10700),
(84, 102105, 'ท่าข้าม', '13.555', '100.434', 21, 10150),
(85, 102107, 'แสมดำ', '13.605', '100.395', 21, 10150),
(86, 102201, 'บางหว้า', '13.714', '100.443', 22, 10160),
(87, 102202, 'บางด้วน', '13.723', '100.437', 22, 10160),
(88, 102206, 'บางจาก', '13.727', '100.450', 22, 10160),
(89, 102207, 'บางแวก', '13.736', '100.445', 22, 10160),
(90, 102208, 'คลองขวาง', '13.738', '100.423', 22, 10160),
(91, 102209, 'ปากคลองภาษีเจริญ', '13.722', '100.464', 22, 10160),
(92, 102210, 'คูหาสวรรค์', '13.727', '100.457', 22, 10160),
(93, 102302, 'หนองแขม', '13.680', '100.358', 23, 10160),
(94, 102303, 'หนองค้างพลู', '13.714', '100.351', 23, 10160),
(95, 102401, 'ราษฎร์บูรณะ', '13.670', '100.510', 24, 10140),
(96, 102402, 'บางปะกอก', '13.675', '100.491', 24, 10140),
(97, 102501, 'บางพลัด', '13.791', '100.487', 25, 10700),
(98, 102502, 'บางอ้อ', '13.802', '100.512', 25, 10700),
(99, 102503, 'บางบำหรุ', '13.781', '100.482', 25, 10700),
(100, 102504, 'บางยี่ขัน', '13.774', '100.492', 25, 10700),
(101, 102601, 'ดินแดง', '13.778', '100.567', 26, 10400),
(102, 102701, 'คลองกุ่ม', '13.808', '100.650', 27, 10240),
(103, 102801, 'ทุ่งวัดดอน', '13.710', '100.532', 28, 10120),
(104, 102802, 'ยานนาวา', '13.714', '100.514', 28, 10120),
(105, 102803, 'ทุ่งมหาเมฆ', '13.718', '100.541', 28, 10120),
(106, 102901, 'บางซื่อ', '13.820', '100.529', 29, 10800),
(107, 103001, 'ลาดยาว', '13.826', '100.565', 30, 10900),
(108, 103101, 'บางคอแหลม', '13.696', '100.494', 31, 10120),
(109, 103102, 'วัดพระยาไกร', '13.706', '100.508', 31, 10120),
(110, 103103, 'บางโคล่', '13.694', '100.516', 31, 10120),
(111, 103201, 'ประเวศ', '13.719', '100.664', 32, 10250),
(112, 103202, 'หนองบอน', '13.687', '100.656', 32, 10250),
(113, 103203, 'ดอกไม้', '13.680', '100.689', 32, 10250),
(114, 103301, 'คลองเตย', '13.710', '100.570', 33, 10110),
(115, 103302, 'คลองตัน', '13.723', '100.571', 33, 10110),
(116, 103303, 'พระโขนง', '13.707', '100.595', 33, 10110),
(117, 103401, 'สวนหลวง', '13.726', '100.628', 34, 10250),
(118, 103501, 'บางขุนเทียน', '13.694', '100.450', 35, 10150),
(119, 103502, 'บางค้อ', '13.702', '100.476', 35, 10150),
(120, 103503, 'บางมด', '13.672', '100.468', 35, 10150),
(121, 103504, 'จอมทอง', '13.693', '100.468', 35, 10150),
(122, 103602, 'สีกัน', '13.925', '100.593', 36, 10210),
(123, 103701, 'ทุ่งพญาไท', '13.763', '100.530', 37, 10400),
(124, 103702, 'ถนนพญาไท', '13.757', '100.538', 37, 10400),
(125, 103703, 'ถนนเพชรบุรี', '13.752', '100.559', 37, 10400),
(126, 103704, 'มักกะสัน', '13.752', '100.528', 37, 10400),
(127, 103801, 'ลาดพร้าว', '13.811', '100.612', 38, 10230),
(128, 103802, 'จรเข้บัว', '13.840', '100.600', 38, 10230),
(129, 103901, 'คลองเตยเหนือ', '13.743', '100.560', 39, 10110),
(130, 103902, 'คลองตันเหนือ', '13.736', '100.576', 39, 10110),
(131, 103903, 'พระโขนงเหนือ', '13.719', '100.596', 39, 10110),
(132, 104001, 'บางแค', '13.698', '100.409', 40, 10160),
(133, 104002, 'บางแคเหนือ', '13.720', '100.400', 40, 10160),
(134, 104003, 'บางไผ่', '13.741', '100.385', 40, 10160),
(135, 104004, 'หลักสอง', '13.683', '100.396', 40, 10160),
(136, 104101, 'ทุ่งสองห้อง', '13.883', '100.564', 41, 10210),
(137, 104102, 'ตลาดบางเขน', '13.871', '100.580', 41, 10210),
(138, 104201, 'สายไหม', '13.921', '100.654', 42, 10220),
(139, 104202, 'ออเงิน', '13.896', '100.672', 42, 10220),
(140, 104203, 'คลองถนน', '13.898', '100.630', 42, 10220),
(141, 104301, 'คันนายาว', '13.821', '100.677', 43, 10230),
(142, 104401, 'สะพานสูง', '13.761', '100.688', 44, 10240),
(143, 104501, 'วังทองหลาง', '13.779', '100.609', 45, 10310),
(144, 104601, 'สามวาตะวันตก', '13.889', '100.708', 46, 10510),
(145, 104602, 'สามวาตะวันออก', '13.896', '100.760', 46, 10510),
(146, 104603, 'บางชัน', '13.839', '100.700', 46, 10510),
(147, 104604, 'ทรายกองดิน', '13.854', '100.745', 46, 10510),
(148, 104605, 'ทรายกองดินใต้', '13.861', '100.786', 46, 10510),
(149, 104701, 'บางนา', '13.672', '100.616', 47, 10260),
(150, 104801, 'ทวีวัฒนา', '13.758', '100.348', 48, 10170),
(151, 104802, 'ศาลาธรรมสพน์', '13.783', '100.390', 48, 10170),
(152, 104901, 'บางมด', '13.651', '100.510', 49, 10140),
(153, 104902, 'ทุ่งครุ', '13.614', '100.497', 49, 10140),
(154, 105001, 'บางบอน', '13.646', '100.370', 50, 10150),
(155, 110101, 'เทศบาลนครสมุทรปราการ', '13.593', '100.597', 51, 10270),
(156, 110102, 'สำโรงเหนือ', '13.649', '100.617', 51, 10270),
(157, 110103, 'บางเมือง', '13.601', '100.622', 51, 10270),
(158, 110104, 'ท้ายบ้าน', '13.556', '100.599', 51, 10280),
(159, 110105, 'ท้ายบ้านใหม่', '13.572', '100.621', 51, NULL),
(160, 110108, 'บางปูใหม่', '13.526', '100.670', 51, 10280),
(161, 110110, 'แพรกษา', '13.564', '100.653', 51, 10280),
(162, 110111, 'บางโปรง', '13.623', '100.565', 51, 10270),
(163, 110112, 'เทศบาลบางปู', '13.510', '100.751', 51, 10270),
(164, 110113, 'บางด้วน', '13.622', '100.581', 51, 10270),
(165, 110114, 'เทศบาลบางเมือง', '13.622', '100.605', 51, 10270),
(166, 110115, 'เทพารักษ์', '13.634', '100.610', 51, 10270),
(167, 110117, 'แพรกษาใหม่', '13.559', '100.691', 51, 10280),
(168, 110201, 'บางบ่อ', '13.611', '100.862', 52, 10560),
(169, 110202, 'บ้านระกาศ', '13.639', '100.904', 52, 10560),
(170, 110203, 'บางพลีน้อย', '13.574', '100.900', 52, 10560),
(171, 110204, 'บางเพรียง', '13.545', '100.805', 52, 10560),
(172, 110205, 'คลองด่าน', '13.511', '100.835', 52, 10550),
(173, 110206, 'คลองสวน', '13.659', '100.925', 52, 10560),
(174, 110207, 'เปร็ง', '13.672', '100.881', 52, 10560),
(175, 110208, 'คลองนิยมยาตรา', '13.624', '100.935', 52, 10560),
(176, 110301, 'บางพลีใหญ่', '13.618', '100.694', 53, 10540),
(177, 110302, 'บางแก้ว', '13.642', '100.662', 53, 10540),
(178, 110303, 'บางปลา', '13.561', '100.739', 53, 10540),
(179, 110304, 'บางโฉลง', '13.623', '100.755', 53, 10540),
(180, 110308, 'ราชาเทวะ', '13.681', '100.733', 53, 10540),
(181, 110309, 'หนองปรือ', '13.678', '100.750', 53, 10540),
(182, 110401, 'เทศบาลเมืองพระประแดง', '13.656', '100.533', 54, 10130),
(183, 110402, 'ตลาด', '13.671', '100.520', 54, 10130),
(184, 110403, 'บางจาก', '13.616', '100.536', 54, 10130),
(185, 110404, 'บางครุ', '13.631', '100.526', 54, 10130),
(186, 110405, 'บางหญ้าแพรก', '13.645', '100.546', 54, 10130),
(187, 110406, 'บางหัวเสือ', '13.625', '100.549', 54, 10130),
(188, 110407, 'เทศบาลสำโรงใต้', '13.641', '100.573', 54, 10130),
(189, 110408, 'บางยอ', '13.679', '100.558', 54, 10130),
(190, 110409, 'บางกะเจ้า', '13.697', '100.561', 54, 10130),
(191, 110410, 'บางน้ำผึ้ง', '13.679', '100.578', 54, 10130),
(192, 110411, 'บางกระสอบ', '13.666', '100.566', 54, 10130),
(193, 110412, 'บางกอบัว', '13.693', '100.577', 54, 10130),
(194, 110413, 'ทรงคนอง', '13.665', '100.545', 54, 10130),
(195, 110414, 'สำโรง', '13.659', '100.584', 54, 10130),
(196, 110415, 'สำโรงกลาง', '13.653', '100.564', 54, 10130),
(197, 110501, 'นาเกลือ', '13.530', '100.494', 55, 10290),
(198, 110502, 'บ้านคลองสวน', '13.571', '100.476', 55, 10290),
(199, 110503, 'แหลมฟ้าผ่า', '13.539', '100.559', 55, 10290),
(200, 110504, 'ปากคลองบางปลากด', '13.606', '100.567', 55, 10290),
(201, 110505, 'ในคลองบางปลากด', '13.588', '100.541', 55, 10290),
(202, 110601, 'บางเสาธง', '13.600', '100.815', 56, 10540),
(203, 110602, 'ศรีษะจรเข้น้อย', '13.689', '100.799', 56, 10540),
(204, 110603, 'ศรีษะจรเข้ใหญ่', '13.641', '100.803', 56, 10540),
(205, 120101, 'สวนใหญ่', '13.842', '100.494', 57, 11000),
(206, 120102, 'ตลาดขวัญ', '13.850', '100.509', 57, 11000),
(207, 120103, 'บางเขน', '13.835', '100.516', 57, 11000),
(208, 120104, 'บางกระสอ', '13.869', '100.491', 57, 11000),
(209, 120105, 'ท่าทราย', '13.884', '100.501', 57, 11000),
(210, 120106, 'บางไผ่', '13.823', '100.492', 57, 11000),
(211, 120107, 'บางศรีเมือง', '13.841', '100.475', 57, 11000),
(212, 120108, 'บางกร่าง', '13.835', '100.438', 57, 11000),
(213, 120109, 'ไทรม้า', '13.870', '100.472', 57, 11000),
(214, 120110, 'บางรักน้อย', '13.859', '100.464', 57, 11000),
(215, 120201, 'วัดชลอ', '13.802', '100.476', 58, 11130),
(216, 120202, 'บางกรวย', '13.809', '100.499', 58, 11130),
(217, 120203, 'บางสีทอง', '13.818', '100.479', 58, 11130),
(218, 120204, 'บางขนุน', '13.811', '100.453', 58, 11130),
(219, 120205, 'บางขุนกอง', '13.821', '100.444', 58, 11130),
(220, 120206, 'บางคูเวียง', '13.822', '100.417', 58, 11130),
(221, 120207, 'มหาสวัสดิ์', '13.806', '100.434', 58, 11130),
(222, 120208, 'ปลายบาง', '13.814', '100.402', 58, 11130),
(223, 120209, 'ศาลากลาง', '13.810', '100.358', 58, 11130),
(224, 120301, 'บางม่วง', '13.838', '100.406', 59, 11140),
(225, 120302, 'บางแม่นาง', '13.868', '100.381', 59, 11140),
(226, 120303, 'บางเลน', '13.854', '100.434', 59, 11140),
(227, 120304, 'เสาธงหิน', '13.875', '100.404', 59, 11140),
(228, 120305, 'บางใหญ่', '13.837', '100.375', 59, 11140),
(229, 120306, 'บ้านใหม่', '13.861', '100.333', 59, 11140),
(230, 120401, 'โสนลอย', '13.914', '100.422', 60, 11110),
(231, 120402, 'บางบัวทอง', '13.944', '100.390', 60, 11110),
(232, 120403, 'บางรักใหญ่', '13.878', '100.438', 60, 11110),
(233, 120404, 'บางคูรัด', '13.907', '100.351', 60, 11110),
(234, 120405, 'ละหาร', '13.964', '100.401', 60, 11110),
(235, 120406, 'ลำโพ', '13.970', '100.416', 60, 11110),
(236, 120407, 'พิมลราช', '13.934', '100.366', 60, 11110),
(237, 120408, 'บางรักพัฒนา', '13.894', '100.410', 60, 11110),
(238, 120501, 'ไทรน้อย', '13.976', '100.344', 61, 11150),
(239, 120502, 'ราษฎร์นิยม', '14.088', '100.329', 61, 11150),
(240, 120503, 'หนองเพรางาย', '13.906', '100.322', 61, 11150),
(241, 120504, 'ไทรใหญ่', '14.085', '100.292', 61, 11150),
(242, 120505, 'ขุนศรี', '14.005', '100.287', 61, 11150),
(243, 120506, 'คลองขวาง', '14.004', '100.306', 61, 11150),
(244, 120507, 'ทวีวัฒนา', '13.942', '100.312', 61, 11150),
(245, 120601, 'ปากเกร็ด', '13.912', '100.506', 62, 11120),
(246, 120602, 'บางตลาด', '13.896', '100.521', 62, 11120),
(247, 120603, 'บ้านใหม่', '13.930', '100.546', 62, 11120),
(248, 120604, 'บางพูด', '13.927', '100.516', 62, 11120),
(249, 120605, 'บางตะไนย์', '13.931', '100.492', 62, 11120),
(250, 120606, 'คลองพระอุดม', '13.930', '100.479', 62, 11120),
(251, 120607, 'ท่าอิฐ', '13.894', '100.480', 62, 11120),
(252, 120608, 'เกาะเกร็ด', '13.910', '100.472', 62, 11120),
(253, 120609, 'อ้อมเกร็ด', '13.909', '100.453', 62, 11120),
(254, 120610, 'คลองข่อย', '13.959', '100.450', 62, 11120),
(255, 120611, 'บางพลับ', '13.929', '100.458', 62, 11120),
(256, 120612, 'คลองเกลือ', '13.902', '100.550', 62, 11120),
(257, 130101, 'บางปรอก', '14.012', '100.528', 63, 12000),
(258, 130102, 'บ้านใหม่', '13.963', '100.553', 63, 12000),
(259, 130103, 'บ้านกลาง', '14.001', '100.558', 63, 12000),
(260, 130104, 'บ้านฉาง', '14.029', '100.507', 63, 12000),
(261, 130105, 'บ้านกระแชง', '14.031', '100.552', 63, 12000),
(262, 130106, 'บางขะแยง', '13.967', '100.523', 63, 12000),
(263, 130107, 'บางคูวัด', '13.963', '100.495', 63, 12000),
(264, 130108, 'บางหลวง', '14.007', '100.509', 63, 12000),
(265, 130109, 'บางเดื่อ', '13.990', '100.487', 63, 12000),
(266, 130110, 'บางพูด', '14.035', '100.572', 63, 12000),
(267, 130111, 'บางพูน', '13.988', '100.594', 63, 12000),
(268, 130112, 'บางกะดี', '13.983', '100.537', 63, 12000),
(269, 130113, 'สวนพริกไทย', '14.018', '100.568', 63, 12000),
(270, 130114, 'หลักหก', '13.963', '100.590', 63, 12000),
(271, 130201, 'คลองหนึ่ง', '14.066', '100.607', 64, 12120),
(272, 130202, 'คลองสอง', '14.079', '100.642', 64, 12120),
(273, 130203, 'คลองสาม', '14.087', '100.664', 64, 12120),
(274, 130204, 'คลองสี่', '14.097', '100.687', 64, 12120),
(275, 130205, 'คลองห้า', '14.106', '100.710', 64, 12120),
(276, 130206, 'คลองหก', '14.117', '100.733', 64, 12120),
(277, 130207, 'คลองเจ็ด', '14.125', '100.750', 64, 12120),
(278, 130301, 'ประชาธิปัตย์', '13.987', '100.632', 65, 12130),
(279, 130302, 'บึงยี่โถ', '13.999', '100.687', 65, 12130),
(280, 130303, 'รังสิต', '14.018', '100.731', 65, 12110),
(281, 130304, 'ลำผักกูด', '14.036', '100.779', 65, 12110),
(282, 130305, 'บึงสนั่น', '14.052', '100.824', 65, 12110),
(283, 130306, 'บึงน้ำรักษ์', '14.071', '100.880', 65, 12110),
(284, 130401, 'บึงบา', '14.112', '100.824', 66, 12170),
(285, 130402, 'บึงบอน', '14.087', '100.778', 66, 12170),
(286, 130403, 'บึงกาสาม', '14.200', '100.824', 66, 12170),
(287, 130404, 'บึงชำอ้อ', '14.172', '100.778', 66, 12170),
(288, 130405, 'หนองสามวัง', '14.130', '100.881', 66, 12170),
(289, 130406, 'ศาลาครุ', '14.244', '100.928', 66, 12170),
(290, 130407, 'นพรัตน์', '14.223', '100.866', 66, 12170),
(291, 130501, 'ระแหง', '14.059', '100.396', 67, 12140),
(292, 130502, 'ลาดหลุมแก้ว', '14.006', '100.410', 67, 12140),
(293, 130503, 'คูบางหลวง', '14.047', '100.467', 67, 12140),
(294, 130504, 'คูขวาง', '14.068', '100.437', 67, 12140),
(295, 130505, 'คลองพระอุดม', '13.990', '100.449', 67, 12140),
(296, 130506, 'บ่อเงิน', '14.102', '100.383', 67, 12140),
(297, 130507, 'หน้าไม้', '14.034', '100.359', 67, 12140),
(298, 130601, 'คูคต', '13.955', '100.641', 68, 12130),
(299, 130602, 'ลาดสวาย', '13.958', '100.685', 68, 12150),
(300, 130603, 'บึงคำพร้อย', '13.961', '100.731', 68, 12150),
(301, 130604, 'ลำลูกกา', '13.972', '100.774', 68, 12150),
(302, 130605, 'บึงทองหลาง', '13.984', '100.820', 68, 12150),
(303, 130606, 'ลำไทร', '13.973', '100.861', 68, 12150),
(304, 130607, 'บึงคอไห', '14.029', '100.862', 68, 12150),
(305, 130608, 'พืชอุดม', '13.975', '100.896', 68, 12150),
(306, 130701, 'บางเตย', '14.062', '100.504', 69, 12160),
(307, 130702, 'คลองควาย', '14.097', '100.478', 69, 12160),
(308, 130703, 'สามโคก', '14.052', '100.529', 69, 12160),
(309, 130704, 'กระแชง', '14.043', '100.544', 69, 12160),
(310, 130705, 'บางโพธิ์เหนือ', '14.042', '100.515', 69, 12160),
(311, 130706, 'เชียงรากใหญ่', '14.057', '100.574', 69, 12160),
(312, 130707, 'บ้านปทุม', '14.067', '100.546', 69, 12160),
(313, 130708, 'บ้านงิ้ว', '14.084', '100.539', 69, 12160),
(314, 130709, 'เชียงรากน้อย', '14.105', '100.567', 69, 12160),
(315, 130710, 'บางกระบือ', '14.103', '100.538', 69, 12160),
(316, 130711, 'ท้ายเกาะ', '14.105', '100.496', 69, 12160),
(317, 140101, 'ประตูชัย', '14.349', '100.551', 70, 13000),
(318, 140102, 'กะมัง', '14.341', '100.581', 70, 13000),
(319, 140103, 'หอรัตนไชย', '14.354', '100.578', 70, 13000),
(320, 140104, 'หัวรอ', '14.368', '100.578', 70, 13000),
(321, 140105, 'ท่าวาสุกรี', '14.361', '100.552', 70, 13000),
(322, 140106, 'ไผ่ลิง', '14.356', '100.589', 70, 13000),
(323, 140107, 'ปากกราน', '14.310', '100.532', 70, 13000),
(324, 140108, 'ภูเขาทอง', '14.365', '100.542', 70, 13000),
(325, 140109, 'สำเภาล่ม', '14.340', '100.570', 70, 13000),
(326, 140110, 'สวนพริก', '14.391', '100.558', 70, 13000),
(327, 140111, 'คลองตะเคียน', '14.331', '100.554', 70, 13000),
(328, 140112, 'วัดตูม', '14.390', '100.539', 70, 13000),
(329, 140113, 'หันตรา', '14.371', '100.600', 70, 13000),
(330, 140114, 'ลุมพลี', '14.376', '100.548', 70, 13000),
(331, 140115, 'บ้านใหม่', '14.390', '100.521', 70, 13000),
(332, 140116, 'บ้านเกาะ', '14.389', '100.582', 70, 13000),
(333, 140117, 'คลองสวนพลู', '14.334', '100.595', 70, 13000),
(334, 140118, 'คลองสระบัว', '14.371', '100.563', 70, 13000),
(335, 140119, 'เกาะเรียน', '14.318', '100.579', 70, 13000),
(336, 140120, 'บ้านป้อม', '14.347', '100.529', 70, 13000),
(337, 140121, 'บ้านรุม', '14.312', '100.559', 70, 13000),
(338, 140201, 'ท่าเรือ', '14.566', '100.719', 71, 13130),
(339, 140202, 'จำปา', '14.550', '100.741', 71, 13130),
(340, 140203, 'ท่าหลวง', '14.548', '100.764', 71, 13130),
(341, 140204, 'บ้านร่อม', '14.567', '100.698', 71, 13130),
(342, 140205, 'ศาลาลอย', '14.532', '100.700', 71, 13130),
(343, 140206, 'วังแดง', '14.541', '100.670', 71, 13130),
(344, 140207, 'โพธิ์เอน', '14.519', '100.676', 71, 13130),
(345, 140208, 'ปากท่า', '14.504', '100.692', 71, 13130),
(346, 140209, 'หนองขนาก', '14.512', '100.732', 71, 13130),
(347, 140210, 'ท่าเจ้าสนุก', '14.543', '100.717', 71, 13130),
(348, 140301, 'นครหลวง', '14.469', '100.622', 72, 13260),
(349, 140302, 'ท่าช้าง', '14.511', '100.652', 72, 13260),
(350, 140303, 'บ่อโพง', '14.406', '100.603', 72, 13260),
(351, 140304, 'บ้านชุ้ง', '14.458', '100.655', 72, 13260),
(352, 140305, 'ปากจั่น', '14.440', '100.620', 72, 13260),
(353, 140306, 'บางระกำ', '14.466', '100.589', 72, 13260),
(354, 140307, 'บางพระครู', '14.483', '100.613', 72, 13260),
(355, 140308, 'แม่ลา', '14.503', '100.619', 72, 13260),
(356, 140309, 'หนองปลิง', '14.423', '100.640', 72, 13260),
(357, 140310, 'คลองสะแก', '14.424', '100.604', 72, 13260),
(358, 140311, 'สามไถ', '14.489', '100.675', 72, 13260),
(359, 140312, 'พระนอน', '14.485', '100.650', 72, 13260),
(360, 140401, 'บางไทร', '14.191', '100.480', 73, 13190),
(361, 140402, 'บางพลี', '14.212', '100.465', 73, 13190),
(362, 140403, 'สนามชัย', '14.213', '100.522', 73, 13190),
(363, 140404, 'บ้านแป้ง', '14.232', '100.507', 73, 13190),
(364, 140405, 'หน้าไม้', '14.315', '100.462', 73, 13190),
(365, 140406, 'บางยี่โท', '14.299', '100.445', 73, 13190),
(366, 140407, 'แคออก', '14.305', '100.472', 73, 13190),
(367, 140408, 'แคตก', '14.287', '100.480', 73, 13190),
(368, 140409, 'ช่างเหล็ก', '14.278', '100.453', 73, 13190),
(369, 140410, 'กระแชง', '14.279', '100.505', 73, 13190),
(370, 140411, 'บ้างกลึง', '14.309', '100.499', 73, 13190),
(371, 140412, 'ช้างน้อย', '14.252', '100.505', 73, 13190),
(372, 140413, 'ห่อหมก', '14.259', '100.474', 73, 13190),
(373, 140414, 'ไผ่พระ', '14.222', '100.432', 73, 13190),
(374, 140415, 'กกแก้วบูรพา', '14.188', '100.435', 73, 13190),
(375, 140416, 'ไม้ตรา', '14.164', '100.473', 73, 13190),
(376, 140417, 'บ้านม้า', '14.141', '100.490', 73, 13190),
(377, 140418, 'บ้านเกาะ', '14.236', '100.460', 73, 13190),
(378, 140419, 'ราชคราม', '14.186', '100.519', 73, 13290),
(379, 140420, 'ช้างใหญ่', '14.161', '100.522', 73, 13290),
(380, 140422, 'เชียงรากน้อย', '14.134', '100.561', 73, 13290),
(381, 140423, 'โคกช้าง', '14.123', '100.492', 73, 13190),
(382, 140501, 'บางบาล', '14.410', '100.464', 74, 13250),
(383, 140502, 'วัดยม', '14.390', '100.497', 74, 13250),
(384, 140503, 'ไทรน้อย', '14.407', '100.486', 74, 13250),
(385, 140504, 'สะพานไทย', '14.363', '100.486', 74, 13250),
(386, 140505, 'มหาพราหมณ์', '14.364', '100.505', 74, 13250),
(387, 140506, 'กบเจา', '14.347', '100.485', 74, 13250),
(388, 140507, 'บ้านคลัง', '14.347', '100.457', 74, 13250),
(389, 140508, 'พระขาว', '14.328', '100.482', 74, 13250),
(390, 140509, 'น้ำเต้า', '14.339', '100.438', 74, 13250),
(391, 140510, 'ทางช้าง', '14.375', '100.432', 74, 13250),
(392, 140511, 'วัดตะกู', '14.388', '100.424', 74, 13250),
(393, 140512, 'บางหลวง', '14.403', '100.433', 74, 13250),
(394, 140513, 'บางหลวงโดด', '14.419', '100.430', 74, 13250),
(395, 140514, 'บางหัก', '14.436', '100.439', 74, 13250),
(396, 140515, 'บางชะนี', '14.429', '100.461', 74, 13250),
(397, 140516, 'บ้านกุ่ม', '14.436', '100.492', 74, 13250),
(398, 140601, 'บ้านเลน', '14.241', '100.598', 75, 13160),
(399, 140602, 'เชียงรากน้อย', '14.160', '100.594', 75, 13180),
(400, 140603, 'บ้านโพ', '14.272', '100.588', 75, 13160),
(401, 140604, 'บ้านกรด', '14.307', '100.604', 75, 13160),
(402, 140605, 'บางกระสั้น', '14.189', '100.565', 75, 13160),
(403, 140606, 'คลองจิก', '14.214', '100.597', 75, 13160),
(404, 140607, 'บ้านหว้า', '14.258', '100.616', 75, 13160),
(405, 140608, 'วัดยม', '14.260', '100.568', 75, 13160),
(406, 140609, 'บางประแดง', '14.288', '100.544', 75, 13160),
(407, 140610, 'สามเรือน', '14.292', '100.647', 75, 13160),
(408, 140611, 'เกาะเกิด', '14.206', '100.539', 75, 13160),
(409, 140612, 'บ้านพลับ', '14.223', '100.552', 75, 13160),
(410, 140613, 'บ้านแป้ง', '14.239', '100.557', 75, 13160),
(411, 140614, 'คุ้งลาน', '14.295', '100.621', 75, 13160),
(412, 140615, 'ตลิ่งชัน', '14.250', '100.642', 75, 13160),
(413, 140616, 'บ้านสร้าง', '14.289', '100.668', 75, 13170),
(414, 140618, 'ขนอนหลวง', '14.266', '100.542', 75, 13160),
(415, 140701, 'บางปะหัน', '14.458', '100.558', 76, 13220),
(416, 140702, 'ขยาย', '14.414', '100.564', 76, 13220),
(417, 140703, 'บางเดื่อ', '14.436', '100.576', 76, 13220),
(418, 140704, 'เสาธง', '14.496', '100.549', 76, 13220),
(419, 140705, 'ทางกลาง', '14.513', '100.544', 76, 13220),
(420, 140706, 'บางเพลิง', '14.500', '100.577', 76, 13220),
(421, 140707, 'หันสัง', '14.512', '100.517', 76, 13220),
(422, 140708, 'บางนางร้า', '14.474', '100.531', 76, 13220),
(423, 140709, 'ตานิม', '14.491', '100.532', 76, 13220),
(424, 140710, 'ทับน้ำ', '14.464', '100.508', 76, 13220),
(425, 140711, 'บ้านม้า', '14.492', '100.510', 76, 13220),
(426, 140712, 'ขวัญเมือง', '14.444', '100.536', 76, 13220),
(427, 140713, 'บ้านลี่', '14.449', '100.521', 76, 13220),
(428, 140714, 'โพธิ์สามต้น', '14.421', '100.547', 76, 13220),
(429, 140715, 'พุทเลา', '14.419', '100.525', 76, 13220),
(430, 140716, 'ตาลเอน', '14.524', '100.563', 76, 13220),
(431, 140717, 'บ้านขล้อ', '14.532', '100.586', 76, 13220),
(432, 140801, 'ผักไห่', '14.462', '100.379', 77, 13120),
(433, 140802, 'อมฤต', '14.472', '100.361', 77, 13120),
(434, 140803, 'บ้านแค', '14.495', '100.405', 77, 13120),
(435, 140804, 'ลาดน้ำเค็ม', '14.482', '100.393', 77, 13120),
(436, 140805, 'ตาลาน', '14.446', '100.387', 77, 13120),
(437, 140806, 'ท่าดินแดง', '14.416', '100.388', 77, 13120),
(438, 140807, 'ดอนลาน', '14.433', '100.286', 77, 13280),
(439, 140808, 'นาคู', '14.468', '100.272', 77, 13280),
(440, 140809, 'กุฎี', '14.439', '100.407', 77, 13120),
(441, 140810, 'ลำตะเคียน', '14.419', '100.318', 77, 13280),
(442, 140811, 'โคกช้าง', '14.500', '100.388', 77, 13120),
(443, 140812, 'จักราช', '14.447', '100.340', 77, 13280),
(444, 140813, 'หนองน้ำใหญ่', '14.474', '100.311', 77, 13280),
(445, 140814, 'ลาดชิด', '14.422', '100.358', 77, 13120),
(446, 140815, 'หน้าโคก', '14.490', '100.351', 77, 13120),
(447, 140816, 'บ้านใหญ่', '14.435', '100.384', 77, 13120),
(448, 140901, 'ภาชี', '14.442', '100.725', 78, 13140),
(449, 140902, 'โคกม่วง', '14.428', '100.750', 78, 13140),
(450, 140903, 'ระโสม', '14.390', '100.770', 78, 13140),
(451, 140904, 'หนองน้ำใส', '14.457', '100.751', 78, 13140),
(452, 140905, 'ดอนหญ้านาง', '14.478', '100.739', 78, 13140),
(453, 140906, 'ไผ่ล้อม', '14.474', '100.693', 78, 13140),
(454, 140907, 'กระจิว', '14.420', '100.690', 78, 13140),
(455, 140908, 'พระแก้ว', '14.440', '100.675', 78, 13140),
(456, 141001, 'ลาดบัวหลวง', '14.193', '100.319', 79, 13230),
(457, 141002, 'หลักชัย', '14.195', '100.277', 79, 13230),
(458, 141003, 'สามเมือง', '14.153', '100.297', 79, 13230),
(459, 141004, 'พระยาบันลือ', '14.161', '100.395', 79, 13230),
(460, 141005, 'สิงหนาท', '14.132', '100.423', 79, 13230),
(461, 141006, 'คู้สลอด', '14.196', '100.369', 79, 13230),
(462, 141007, 'คลองพระยาบันลือ', '14.134', '100.368', 79, 13230),
(463, 141101, 'ลำตาเสา', '14.275', '100.708', 80, 13170),
(464, 141102, 'บ่อตาโล่', '14.241', '100.674', 80, 13170),
(465, 141103, 'วังน้อย', '14.201', '100.699', 80, 13170),
(466, 141104, 'ลำไทร', '14.200', '100.641', 80, 13170),
(467, 141105, 'สนับทึบ', '14.298', '100.813', 80, 13170),
(468, 141106, 'พยอม', '14.166', '100.632', 80, 13170),
(469, 141107, 'หันตะเภา', '14.304', '100.780', 80, 13170),
(470, 141108, 'ข้าวงาม', '14.229', '100.758', 80, 13170),
(471, 141109, 'วังจุฬา', '14.249', '100.800', 80, 13170),
(472, 141110, 'ชะแมบ', '14.257', '100.748', 80, 13170),
(473, 141201, 'เสนา', '14.328', '100.404', 81, 13110),
(474, 141202, 'บ้านแพน', '14.342', '100.417', 81, 13110),
(475, 141203, 'เจ้าเจ็ด', '14.303', '100.378', 81, 13110),
(476, 141204, 'สามกอ', '14.306', '100.399', 81, 13110),
(477, 141205, 'บางนมโค', '14.292', '100.424', 81, 13110),
(478, 141206, 'หัวเวียง', '14.376', '100.402', 81, 13110),
(479, 141207, 'มารวิชัย', '14.240', '100.371', 81, 13110),
(480, 141208, 'บ้านโพธิ์', '14.351', '100.394', 81, 13110),
(481, 141209, 'รางจรเข้', '14.351', '100.366', 81, 13110),
(482, 141210, 'บ้านกระทุ่ม', '14.390', '100.383', 81, 13110),
(483, 141211, 'บ้านแถว', '14.301', '100.348', 81, 13110),
(484, 141212, 'ชายนา', '14.258', '100.348', 81, 13110),
(485, 141213, 'สามตุ่ม', '14.240', '100.406', 81, 13110),
(486, 141214, 'ลาดงา', '14.372', '100.358', 81, 13110),
(487, 141215, 'ดอนทอง', '14.240', '100.306', 81, 13110),
(488, 141216, 'บ้านหลวง', '14.278', '100.401', 81, 13110),
(489, 141217, 'เจ้าเสด็จ', '14.331', '100.363', 81, 13110),
(490, 141301, 'บางซ้าย', '14.314', '100.286', 82, 13270),
(491, 141302, 'แก้วฟ้า', '14.313', '100.326', 82, 13270),
(492, 141303, 'เต่าเล่า', '14.340', '100.319', 82, 13270),
(493, 141304, 'ปลายกลัด', '14.382', '100.315', 82, 13270),
(494, 141305, 'เทพมงคล', '14.236', '100.258', 82, 13270),
(495, 141306, 'วังพัฒนา', '14.272', '100.296', 82, 13270),
(496, 141401, 'คานหาม', '14.335', '100.641', 83, 13210),
(497, 141402, 'บ้านช้าง', '14.322', '100.680', 83, 13210),
(498, 141403, 'สามบัณฑิต', '14.349', '100.742', 83, 13210),
(499, 141404, 'บ้านหีบ', '14.372', '100.712', 83, 13210),
(500, 141405, 'หนองไม้ซุง', '14.376', '100.751', 83, 13210),
(501, 141406, 'อุทัย', '14.373', '100.655', 83, 13210),
(502, 141407, 'เสนา', '14.392', '100.689', 83, 13210),
(503, 141408, 'หนองน้ำส้ม', '14.320', '100.714', 83, 13210),
(504, 141409, 'โพสาวหาญ', '14.332', '100.759', 83, 13210),
(505, 141410, 'ธนู', '14.355', '100.622', 83, 13210),
(506, 141411, 'ข้าวเม่า', '14.379', '100.624', 83, 13210),
(507, 141501, 'หัวไผ่', '14.532', '100.525', 84, 13150),
(508, 141502, 'กะทุ่ม', '14.546', '100.556', 84, 13150),
(509, 141503, 'มหาราช', '14.552', '100.528', 84, 13150),
(510, 141504, 'น้ำเต้า', '14.566', '100.542', 84, 13150),
(511, 141505, 'บางนา', '14.576', '100.581', 84, 13150),
(512, 141506, 'โรงช้าง', '14.602', '100.563', 84, 13150),
(513, 141507, 'เจ้าปลุก', '14.584', '100.538', 84, 13150),
(514, 141508, 'พิตเพียน', '14.608', '100.544', 84, 13150),
(515, 141509, 'บ้านนา', '14.606', '100.510', 84, 13150),
(516, 141510, 'บ้านขวาง', '14.576', '100.518', 84, 13150),
(517, 141511, 'ท่าตอ', '14.556', '100.511', 84, 13150),
(518, 141512, 'บ้านใหม่', '14.531', '100.500', 84, 13150),
(519, 141601, 'บ้านแพรก', '14.640', '100.585', 85, 13240),
(520, 141602, 'บ้านใหม่', '14.655', '100.586', 85, 13240),
(521, 141603, 'สำพะเนียง', '14.638', '100.567', 85, 13240),
(522, 141604, 'คลองน้อย', '14.627', '100.553', 85, 13240),
(523, 141605, 'สองห้อง', '14.646', '100.519', 85, 13240),
(524, 150101, 'ตลาดหลวง', '14.592', '100.453', 86, 14000),
(525, 150102, 'บางแก้ว', '14.588', '100.459', 86, 14000),
(526, 150103, 'ศาลาแดง', '14.599', '100.445', 86, 14000),
(527, 150104, 'ป่างิ้ว', '14.612', '100.413', 86, 14000),
(528, 150105, 'บ้านแห', '14.565', '100.434', 86, 14000),
(529, 150106, 'ตลาดกรวด', '14.619', '100.478', 86, 14000),
(530, 150107, 'มหาดไทย', '14.568', '100.400', 86, 14000),
(531, 150108, 'บ้านอิฐ', '14.583', '100.476', 86, 14000),
(532, 150109, 'หัวไผ่', '14.553', '100.474', 86, 14000),
(533, 150110, 'จำปาหล่อ', '14.539', '100.433', 86, 14000),
(534, 150111, 'โพสะ', '14.542', '100.457', 86, 14000),
(535, 150112, 'บ้านรี', '14.605', '100.485', 86, 14000),
(536, 150113, 'คลองวัว', '14.578', '100.432', 86, 14000),
(537, 150114, 'ย่านซื่อ', '14.619', '100.447', 86, 14000),
(538, 150201, 'จรเข้ร้อง', '14.658', '100.482', 87, 14140),
(539, 150202, 'ไชยภูมิ', '14.705', '100.465', 87, 14140),
(540, 150203, 'ชัยฤทธิ์', '14.637', '100.472', 87, 14140),
(541, 150204, 'เทวราช', '14.646', '100.449', 87, 14140),
(542, 150205, 'ราชสถิตย์', '14.672', '100.456', 87, 14140),
(543, 150206, 'ไชโย', '14.707', '100.436', 87, 14140),
(544, 150207, 'หลักฟ้า', '14.684', '100.462', 87, 14140),
(545, 150208, 'ชะไว', '14.687', '100.494', 87, 14140),
(546, 150209, 'ตรีณรงค์', '14.676', '100.498', 87, 14140),
(547, 150301, 'บางปลากด', '14.509', '100.461', 88, 14130),
(548, 150302, 'ป่าโมก', '14.501', '100.437', 88, 14130),
(549, 150303, 'สายทอง', '14.513', '100.484', 88, 14130),
(550, 150304, 'โรงช้าง', '14.488', '100.472', 88, 14130),
(551, 150305, 'บางเสด็จ', '14.461', '100.473', 88, 14130),
(552, 150306, 'นรสิงห์', '14.518', '100.431', 88, 14130),
(553, 150307, 'เอกราช', '14.477', '100.426', 88, 14130),
(554, 150308, 'โผงเผง', '14.455', '100.442', 88, 14130),
(555, 150401, 'อ่างแก้ว', '14.666', '100.393', 89, 14120),
(556, 150402, 'อินทประมูล', '14.651', '100.425', 89, 14120),
(557, 150403, 'บางพลับ', '14.641', '100.406', 89, 14120),
(558, 150404, 'หนองแม่ไก่', '14.708', '100.351', 89, 14120),
(559, 150405, 'รำมะสัก', '14.679', '100.242', 89, 14120),
(560, 150406, 'บางระกำ', '14.691', '100.428', 89, 14120),
(561, 150407, 'โพธิ์รังนก', '14.614', '100.378', 89, 14120),
(562, 150408, 'องครักษ์', '14.731', '100.398', 89, 14120),
(563, 150409, 'โคกพุทรา', '14.689', '100.375', 89, 14120),
(564, 150410, 'ยางซ้าย', '14.658', '100.297', 89, 14120),
(565, 150411, 'บ่อแร่', '14.637', '100.372', 89, 14120),
(566, 150412, 'ทางพระ', '14.677', '100.360', 89, 14120),
(567, 150413, 'สามง่าม', '14.638', '100.389', 89, 14120),
(568, 150414, 'บางเจ้าฉ่า', '14.695', '100.398', 89, 14120),
(569, 150415, 'คำหยาด', '14.676', '100.323', 89, 14120),
(570, 150501, 'แสวงหา', '14.763', '100.310', 90, 14150),
(571, 150502, 'ศรีพราน', '14.725', '100.328', 90, 14150),
(572, 150503, 'บ้านพราน', '14.709', '100.306', 90, 14150),
(573, 150504, 'วังน้ำเย็น', '14.738', '100.221', 90, 14150),
(574, 150505, 'สีบัวทอง', '14.769', '100.248', 90, 14150),
(575, 150506, 'ห้วยไผ่', '14.789', '100.324', 90, 14150),
(576, 150507, 'จำลอง', '14.741', '100.364', 90, 14150),
(577, 150601, 'ไผ่จำศีล', '14.590', '100.366', 91, 14110),
(578, 150602, 'ศาลเจ้าโรงทอง', '14.597', '100.340', 91, 14110),
(579, 150603, 'ไผ่ดำพัฒนา', '14.529', '100.392', 91, 14110),
(580, 150604, 'สาวร้องไห้', '14.546', '100.223', 91, 14110),
(581, 150605, 'ท่าช้าง', '14.562', '100.333', 91, 14110),
(582, 150606, 'ยี่ล้น', '14.579', '100.301', 91, 14110),
(583, 150607, 'บางจัก', '14.502', '100.330', 91, 14110),
(584, 150608, 'ห้วยคันแหลน', '14.555', '100.294', 91, 14110),
(585, 150609, 'คลองขนาก', '14.530', '100.337', 91, 14110),
(586, 150610, 'ไผ่วง', '14.505', '100.251', 91, 14110),
(587, 150611, 'สี่ร้อย', '14.550', '100.370', 91, 14110),
(588, 150612, 'ม่วงเตี้ย', '14.636', '100.323', 91, 14110),
(589, 150613, 'หัวตะพาน', '14.583', '100.387', 91, 14110),
(590, 150614, 'หลักแก้ว', '14.517', '100.289', 91, 14110),
(591, 150615, 'ตลาดใหม่', '14.542', '100.315', 91, 14110),
(592, 150701, 'สามโก้', '14.606', '100.252', 92, 14160),
(593, 150702, 'ราษฎรพัฒนา', '14.605', '100.293', 92, 14160),
(594, 150703, 'อบทม', '14.581', '100.246', 92, 14160),
(595, 150704, 'โพธิ์ม่วงพันธ์', '14.561', '100.254', 92, 14160),
(596, 150705, 'มงคลธรรมนิมิต', '14.640', '100.260', 92, 14160),
(597, 160101, 'ทะเลชุบศร', '14.804', '100.634', 93, 15000),
(598, 160102, 'ท่าหิน', '14.802', '100.611', 93, 15000),
(599, 160103, 'กกโก', '14.767', '100.684', 93, 15000),
(600, 160104, 'โก่งธนู', '14.674', '100.597', 93, 13240),
(601, 160105, 'เขาพระงาม', '14.901', '100.670', 93, 15000),
(602, 160106, 'เขาสามยอด', '14.830', '100.671', 93, 15000),
(603, 160107, 'โคกกระเทียม', '14.890', '100.580', 93, 15000),
(604, 160108, 'โคกลำพาน', '14.740', '100.640', 93, 15000),
(605, 160109, 'โคกตูม', '14.866', '100.817', 93, 15210),
(606, 160110, 'งิ้วราย', '14.704', '100.592', 93, 15000),
(607, 160111, 'ดอนโพธิ์', '14.691', '100.627', 93, 15000),
(608, 160112, 'ตะลุง', '14.737', '100.601', 93, 15000),
(609, 160114, 'ท่าแค', '14.865', '100.619', 93, 15000),
(610, 160115, 'ท่าศาลา', '14.792', '100.671', 93, 15000),
(611, 160116, 'นิคมสร้างตนเอง', '14.824', '100.732', 93, 15000),
(612, 160117, 'บางขันหมาก', '14.820', '100.583', 93, 15000),
(613, 160118, 'บ้านข่อย', '14.683', '100.529', 93, 15000),
(614, 160119, 'ท้ายตลาด', '14.725', '100.563', 93, 15000),
(615, 160120, 'ป่าตาล', '14.778', '100.640', 93, 15000),
(616, 160121, 'พรหมมาสตร์', '14.820', '100.603', 93, 15000),
(617, 160122, 'โพธิ์เก้าต้น', '14.775', '100.599', 93, 15000),
(618, 160123, 'โพธิ์ตรุ', '14.725', '100.532', 93, 15000),
(619, 160124, 'สี่คลอง', '14.681', '100.563', 93, 15000),
(620, 160125, 'ถนนใหญ่', '14.831', '100.629', 93, 15000),
(621, 160201, 'พัฒนานิคม', '14.896', '100.966', 94, 15140),
(622, 160202, 'ช่องสาริกา', '14.802', '100.909', 94, 15220),
(623, 160203, 'มะนาวหวาน', '14.934', '101.093', 94, 15140),
(624, 160204, 'ดีลัง', '14.940', '100.852', 94, 15220),
(625, 160205, 'โคกสลุง', '15.010', '100.969', 94, 15140),
(626, 160206, 'ชอนน้อย', '14.795', '100.985', 94, 15140),
(627, 160207, 'หนองบัว', '14.851', '101.054', 94, 15140),
(628, 160208, 'ห้วยขุนราม', '14.951', '101.205', 94, 18220),
(629, 160209, 'น้ำสุด', '14.952', '101.146', 94, 15140),
(630, 160301, 'โคกสำโรง', '15.071', '100.713', 95, 15120),
(631, 160302, 'เกาะแก้ว', '15.136', '100.736', 95, 15120),
(632, 160303, 'ถลุงเหล็ก', '15.064', '100.680', 95, 15120),
(633, 160304, 'หลุมข้าว', '15.024', '100.642', 95, 15120),
(634, 160305, 'ห้วยโป่ง', '14.981', '100.677', 95, 15120),
(635, 160306, 'คลองเกตุ', '14.967', '100.802', 95, 15120),
(636, 160307, 'สะแกราบ', '15.120', '100.797', 95, 15120),
(637, 160308, 'เพนียด', '15.036', '100.812', 95, 15120),
(638, 160309, 'วังเพลิง', '15.062', '100.841', 95, 15120),
(639, 160310, 'ดงมะรุม', '15.127', '100.877', 95, 15120),
(640, 160318, 'วังขอนขว้าง', '15.023', '100.697', 95, 15120),
(641, 160320, 'วังจั่น', '15.102', '100.673', 95, 15120),
(642, 160322, 'หนองแขม', '15.143', '100.685', 95, 15120),
(643, 160401, 'ลำนารายณ์', '15.214', '101.146', 96, 15130),
(644, 160402, 'ชัยนารายณ์', '15.195', '101.037', 96, 15130),
(645, 160403, 'ศิลาทิพย์', '15.314', '101.087', 96, 15130),
(646, 160404, 'ห้วยหิน', '15.154', '101.044', 96, 15130),
(647, 160405, 'ม่วงค่อม', '15.078', '101.024', 96, 15230),
(648, 160406, 'บัวชุม', '15.176', '101.238', 96, 15130),
(649, 160407, 'ท่าดินดำ', '15.150', '101.134', 96, 15130),
(650, 160408, 'มะกอกหวาน', '15.059', '101.077', 96, 15230),
(651, 160409, 'ซับตะเคียน', '15.112', '101.327', 96, 15130),
(652, 160410, 'นาโสม', '15.245', '101.282', 96, 15190),
(653, 160411, 'หนองยายโต๊ะ', '15.220', '101.264', 96, 15130),
(654, 160412, 'เกาะรัง', '15.318', '101.251', 96, 15130),
(655, 160414, 'ท่ามะนาว', '15.187', '101.162', 96, 15130),
(656, 160417, 'นิคมลำนารายณ์', '15.264', '101.150', 96, 15130),
(657, 160418, 'ชัยบาดาล', '15.095', '101.058', 96, 15230),
(658, 160419, 'บ้านใหม่สามัคคี', '15.258', '101.022', 96, 15130),
(659, 160422, 'เขาแหลม', '15.126', '100.964', 96, 15130),
(660, 160501, 'ท่าวุ้ง', '14.820', '100.496', 97, 15150),
(661, 160502, 'บางคู้', '14.804', '100.529', 97, 15150),
(662, 160503, 'โพตลาดแก้ว', '14.795', '100.558', 97, 15150),
(663, 160504, 'บางลี่', '14.849', '100.526', 97, 15150),
(664, 160505, 'บางงา', '14.850', '100.492', 97, 15150),
(665, 160506, 'โคกสลุด', '14.881', '100.482', 97, 15150),
(666, 160507, 'เขาสมอคอน', '14.906', '100.447', 97, 15180),
(667, 160508, 'หัวสำโรง', '14.776', '100.494', 97, 15150),
(668, 160509, 'ลาดสาลี', '14.723', '100.487', 97, 15150),
(669, 160511, 'มุจลินท์', '14.876', '100.509', 97, 15150),
(670, 160601, 'ไผ่ใหญ่', '15.089', '100.459', 98, 15110),
(671, 160602, 'บ้านทราย', '15.034', '100.582', 98, 15110),
(672, 160603, 'บ้านกล้วย', '15.016', '100.578', 98, 15110),
(673, 160604, 'ดงพลับ', '15.059', '100.630', 98, 15110),
(674, 160605, 'บ้านชี', '14.947', '100.500', 98, 15180),
(675, 160606, 'พุคา', '14.953', '100.598', 98, 15110),
(676, 160607, 'หินปัก', '15.048', '100.592', 98, 15110),
(677, 160608, 'บางพึ่ง', '14.994', '100.496', 98, 15110),
(678, 160609, 'หนองทรายขาว', '14.996', '100.597', 98, 15110),
(679, 160610, 'บางกะพี้', '15.073', '100.613', 98, 15110),
(680, 160611, 'หนองเต่า', '14.963', '100.555', 98, 15110),
(681, 160612, 'โพนทอง', '15.040', '100.559', 98, 15110),
(682, 160613, 'บางขาม', '14.953', '100.457', 98, 15180),
(683, 160614, 'ดอนดึง', '15.146', '100.612', 98, 15110),
(684, 160615, 'ชอนม่วง', '15.210', '100.610', 98, 15110),
(685, 160616, 'หนองกระเบียน', '15.148', '100.534', 98, 15110),
(686, 160617, 'สายห้วยแก้ว', '15.095', '100.509', 98, 15110),
(687, 160618, 'มหาสอน', '15.021', '100.484', 98, 15110),
(688, 160621, 'หนองเมือง', '15.124', '100.569', 98, 15110),
(689, 160622, 'สนามแจง', '15.008', '100.538', 98, 15110),
(690, 160701, 'ท่าหลวง', '15.071', '101.117', 99, 15230),
(691, 160702, 'แก่งผักกูด', '15.014', '101.085', 99, 15230),
(692, 160703, 'ซับจำปา', '15.026', '101.228', 99, 15230),
(693, 160704, 'หนองผักแว่น', '15.119', '101.216', 99, 15230),
(694, 160705, 'ทะเลวังวัด', '15.023', '101.184', 99, 15230),
(695, 160706, 'หัวลำ', '15.029', '101.292', 99, 15230),
(696, 160801, 'สระโบสถ์', '15.224', '100.846', 100, 15240),
(697, 160802, 'มหาโพธิ', '15.289', '100.861', 100, 15240),
(698, 160803, 'ทุ่งท่าช้าง', '15.169', '100.817', 100, 15240),
(699, 160804, 'ห้วยใหญ่', '15.169', '100.793', 100, 15240),
(700, 160805, 'นิยมชัย', '15.183', '100.904', 100, 15240),
(701, 160901, 'โคกเจริญ', '15.408', '100.777', 101, 15250),
(702, 160902, 'ยางราก', '15.366', '100.935', 101, 15250),
(703, 160903, 'หนองมะค่า', '15.515', '100.839', 101, 15250),
(704, 160904, 'วังทอง', '15.469', '100.811', 101, 15250),
(705, 160905, 'โคกแสมสาร', '15.344', '100.850', 101, 15250),
(706, 161001, 'ลำสนธิ', '15.341', '101.362', 102, 15190),
(707, 161002, 'ซับสมบูรณ์', '15.193', '101.354', 102, 15190),
(708, 161003, 'หนองรี', '15.282', '101.319', 102, 15190),
(709, 161004, 'กุดตาเพชร', '15.523', '101.346', 102, 15190),
(710, 161005, 'เขารวก', '15.374', '101.330', 102, 15190),
(711, 161006, 'เขาน้อย', '15.112', '101.387', 102, 15130),
(712, 161101, 'หนองม่วง', '15.230', '100.664', 103, 15170),
(713, 161102, 'บ่อทอง', '15.293', '100.652', 103, 15170),
(714, 161103, 'ดงดินแดง', '15.385', '100.679', 103, 15170),
(715, 161104, 'ชอนสมบูรณ์', '15.288', '100.763', 103, 15170),
(716, 161105, 'ยางโทน', '15.248', '100.702', 103, 15170),
(717, 161106, 'ชอนสารเดช', '15.195', '100.709', 103, 15170),
(718, 170101, 'บางพุทรา', '14.890', '100.404', 104, 16000),
(719, 170102, 'บางมัญ', '14.916', '100.400', 104, 16000),
(720, 170103, 'โพกรวม', '14.944', '100.394', 104, 16000),
(721, 170104, 'ม่วงหมู่', '14.869', '100.432', 104, 16000),
(722, 170105, 'หัวไผ่', '14.965', '100.429', 104, 16000),
(723, 170106, 'ต้นโพธิ์', '14.869', '100.398', 104, 16000),
(724, 170107, 'จักรสีห์', '14.836', '100.398', 104, 16000),
(725, 170108, 'บางกระบือ', '14.907', '100.363', 104, 16000),
(726, 170201, 'สิงห์', '14.890', '100.338', 105, 16130),
(727, 170202, 'ไม้ดัด', '14.858', '100.345', 105, 16130),
(728, 170203, 'เชิงกลัด', '14.910', '100.269', 105, 16130),
(729, 170204, 'โพชนไก่', '14.929', '100.292', 105, 16130),
(730, 170205, 'แม่ลา', '14.941', '100.319', 105, 16130),
(731, 170206, 'บ้านจ่า', '14.852', '100.284', 105, 16130),
(732, 170207, 'พักทัน', '14.924', '100.220', 105, 16130),
(733, 170208, 'สระแจง', '14.873', '100.235', 105, 16130),
(734, 170301, 'โพทะเล', '14.829', '100.257', 106, 16150),
(735, 170302, 'บางระจัน', '14.799', '100.296', 106, 16150),
(736, 170303, 'โพสังโฆ', '14.833', '100.349', 106, 16150),
(737, 170304, 'ท่าข้าม', '14.827', '100.368', 106, 16150),
(738, 170305, 'คอทราย', '14.817', '100.281', 106, 16150),
(739, 170306, 'หนองกระทุ่ม', '14.820', '100.225', 106, 16150),
(740, 170401, 'พระงาม', '14.748', '100.422', 107, 16120),
(741, 170402, 'พรหมบุรี', '14.837', '100.451', 107, 16160),
(742, 170403, 'บางน้ำเชี่ยว', '14.783', '100.458', 107, 16120),
(743, 170404, 'บ้านหม้อ', '14.746', '100.461', 107, 16120),
(744, 170405, 'บ้านแป้ง', '14.811', '100.458', 107, 16120),
(745, 170406, 'หัวป่า', '14.831', '100.425', 107, 16120),
(746, 170407, 'โรงช้าง', '14.801', '100.425', 107, 16120),
(747, 170501, 'ถอนสมอ', '14.765', '100.384', 108, 16140),
(748, 170502, 'โพประจักษ์', '14.774', '100.360', 108, 16140),
(749, 170503, 'วิหารขาว', '14.801', '100.409', 108, 16140),
(750, 170504, 'พิกุลทอง', '14.772', '100.410', 108, 16140),
(751, 170601, 'อินทร์บุรี', '15.009', '100.329', 109, 16110),
(752, 170602, 'ประศุก', '15.042', '100.291', 109, 16110),
(753, 170603, 'ทับยา', '14.960', '100.334', 109, 16110),
(754, 170604, 'งิ้วราย', '14.988', '100.389', 109, 16110),
(755, 170605, 'ชีน้ำร้าย', '15.081', '100.331', 109, 16110),
(756, 170606, 'ท่างาม', '15.041', '100.343', 109, 16110),
(757, 170607, 'น้ำตาล', '14.976', '100.361', 109, 16110),
(758, 170608, 'ทองเอน', '15.046', '100.385', 109, 16110),
(759, 170609, 'ห้วยชัน', '15.019', '100.269', 109, 16110),
(760, 170610, 'โพธิ์ชัย', '15.027', '100.439', 109, 16110),
(761, 180101, 'ในเมือง', '15.181', '100.127', 110, 17000),
(762, 180102, 'บ้านกล้วย', '15.182', '100.153', 110, 17000),
(763, 180103, 'ท่าชัย', '15.163', '100.113', 110, 17000),
(764, 180104, 'ชัยนาท', '15.129', '100.151', 110, 17000),
(765, 180105, 'เขาท่าพระ', '15.218', '100.134', 110, 17000),
(766, 180106, 'หาดท่าเสา', '15.200', '100.079', 110, 17000),
(767, 180107, 'ธรรมามูล', '15.264', '100.133', 110, 17000),
(768, 180108, 'เสือโฮก', '15.238', '100.224', 110, 17000),
(769, 180109, 'นางลือ', '15.122', '100.082', 110, 17000),
(770, 180201, 'คุ้งสำเภา', '15.291', '100.091', 111, 17110),
(771, 180202, 'วัดโคก', '15.326', '100.107', 111, 17110),
(772, 180203, 'ศิลาดาน', '15.354', '100.122', 111, 17110),
(773, 180204, 'ท่าฉนวน', '15.379', '100.138', 111, 17110),
(774, 180205, 'หางน้ำสาคร', '15.292', '100.146', 111, 17170),
(775, 180206, 'ไร่พัฒนา', '15.333', '100.225', 111, 17170),
(776, 180207, 'อู่ตะเภา', '15.274', '100.219', 111, 17170),
(777, 180301, 'วัดสิงห์', '15.263', '100.041', 112, 17120),
(778, 180302, 'มะขามเฒ่า', '15.227', '100.040', 112, 17120),
(779, 180303, 'หนองน้อย', '15.177', '100.015', 112, 17120),
(780, 180304, 'หนองบัว', '15.283', '100.013', 112, 17120),
(781, 180306, 'หนองขุ่น', '15.235', '99.970', 112, 17120),
(782, 180307, 'บ่อแร่', '15.283', '99.958', 112, 17120),
(783, 180311, 'วังหมัน', '15.171', '99.916', 112, 17120),
(784, 180401, 'สรรพยา', '15.128', '100.233', 113, 17150),
(785, 180402, 'ตลุก', '15.195', '100.198', 113, 17150),
(786, 180403, 'เขาแก้ว', '15.142', '100.316', 113, 17150),
(787, 180404, 'โพนางดำตก', '15.084', '100.272', 113, 17150),
(788, 180405, 'โพนางดำออก', '15.120', '100.283', 113, 17150),
(789, 180406, 'บางหลวง', '15.143', '100.197', 113, 17150),
(790, 180407, 'หาดอาษา', '15.165', '100.262', 113, 17150),
(791, 180501, 'แพรกศรีราชา', '15.062', '100.107', 114, 17140),
(792, 180502, 'เที่ยงแท้', '15.089', '100.161', 114, 17140),
(793, 180503, 'ห้วยกรด', '15.096', '100.203', 114, 17140),
(794, 180504, 'โพงาม', '14.995', '100.249', 114, 17140),
(795, 180505, 'บางขุด', '14.991', '100.194', 114, 17140),
(796, 180506, 'ดงคอน', '14.976', '100.135', 114, 17140),
(797, 180507, 'ดอนกำ', '14.966', '100.236', 114, 17140),
(798, 180508, 'ห้วยกรดพัฒนา', '15.074', '100.228', 114, 17140),
(799, 180601, 'หันคา', '15.016', '99.998', 115, 17130),
(800, 180602, 'บ้านเชี่ยน', '14.942', '99.997', 115, 17130),
(801, 180605, 'ไพรนกยูง', '15.081', '99.856', 115, 17130),
(802, 180606, 'หนองแซง', '15.107', '99.973', 115, 17160),
(803, 180607, 'ห้วยงู', '15.072', '100.067', 115, 17160),
(804, 180608, 'วังไก่เถื่อน', '15.004', '100.056', 115, 17130),
(805, 180609, 'เด่นใหญ่', '15.017', '99.930', 115, 17130),
(806, 180611, 'สามง่ามท่าโบสถ์', '15.065', '100.026', 115, 17160),
(807, 180701, 'หนองมะโมง', '15.216', '99.772', 116, 17120),
(808, 180702, 'วังตะเคียน', '15.278', '99.802', 116, 17120),
(809, 180703, 'สะพานหิน', '15.197', '99.827', 116, 17120),
(810, 180704, 'กุดจอก', '15.241', '99.894', 116, 17120),
(811, 180801, 'เนินขาม', '14.957', '99.901', 117, 17130),
(812, 180802, 'กะบกเตี้ย', '15.036', '99.816', 117, 17130),
(813, 180803, 'สุขเดือนห้า', '14.968', '99.828', 117, 17130),
(814, 190101, 'ปากเพรียว', '14.527', '100.915', 118, 18000),
(815, 190105, 'ดาวเรือง', '14.563', '100.901', 118, 18000),
(816, 190106, 'นาโฉง', '14.529', '100.886', 118, 18000),
(817, 190107, 'โคกสว่าง', '14.510', '100.886', 118, 18000),
(818, 190108, 'หนองโน', '14.489', '100.861', 118, 18000),
(819, 190109, 'หนองยาว', '14.472', '100.890', 118, 18000),
(820, 190110, 'ปากข้าวสาร', '14.490', '100.913', 118, 18000),
(821, 190111, 'หนองปลาไหล', '14.456', '100.962', 118, 18000),
(822, 190112, 'กุดนกเปล้า', '14.502', '100.976', 118, 18000),
(823, 190113, 'ตลิ่งชัน', '14.544', '100.956', 118, 18000),
(824, 190114, 'ตะกุด', '14.553', '100.933', 118, 18000),
(825, 190201, 'แก่งคอย', '14.586', '101.002', 119, 18110),
(826, 190202, 'ทับกวาง', '14.605', '101.095', 119, 18260),
(827, 190203, 'ตาลเดี่ยว', '14.552', '101.015', 119, 18110),
(828, 190204, 'ห้วยแห้ง', '14.477', '101.004', 119, 18110),
(829, 190205, 'ท่าคล้อ', '14.712', '100.993', 119, 18110),
(830, 190206, 'หินซ้อน', '14.753', '101.033', 119, 18110),
(831, 190207, 'บ้านธาตุ', '14.626', '100.997', 119, 18110),
(832, 190208, 'บ้านป่า', '14.622', '101.029', 119, 18110),
(833, 190209, 'ท่าตูม', '14.662', '100.993', 119, 18110),
(834, 190210, 'ชะอม', '14.418', '101.134', 119, 18110),
(835, 190211, 'สองคอน', '14.636', '100.968', 119, 18110),
(836, 190212, 'เตาปูน', '14.603', '100.956', 119, 18110),
(837, 190213, 'ชำผักแพว', '14.529', '101.090', 119, 18110),
(838, 190215, 'ท่ามะปราง', '14.483', '101.103', 119, 18110),
(839, 190301, 'หนองแค', '14.337', '100.869', 120, 18140),
(840, 190302, 'กุ่มหัก', '14.312', '100.863', 120, 18140),
(841, 190303, 'คชสิทธิ์', '14.391', '100.807', 120, 18250),
(842, 190304, 'โคกตูม', '14.421', '100.784', 120, 18250),
(843, 190305, 'โคกแย้', '14.387', '100.928', 120, 18230),
(844, 190306, 'บัวลอย', '14.404', '100.851', 120, 18230),
(845, 190307, 'ไผ่ต่ำ', '14.326', '100.834', 120, 18140),
(846, 190308, 'โพนทอง', '14.425', '100.813', 120, 18250),
(847, 190309, 'ห้วยขมิ้น', '14.381', '100.871', 120, 18230),
(848, 190310, 'ห้วยทราย', '14.420', '100.933', 120, 18230),
(849, 190311, 'หนองไข่น้ำ', '14.360', '100.878', 120, 18140),
(850, 190312, 'หนองแขม', '14.339', '100.797', 120, 18140),
(851, 190313, 'หนองจิก', '14.441', '100.866', 120, 18230),
(852, 190314, 'หนองจรเข้', '14.334', '100.907', 120, 18140),
(853, 190315, 'หนองนาก', '14.444', '100.891', 120, 18230),
(854, 190316, 'หนองปลาหมอ', '14.369', '100.845', 120, 18140),
(855, 190317, 'หนองปลิง', '14.370', '100.829', 120, 18140),
(856, 190318, 'หนองโรง', '14.279', '100.865', 120, 18140),
(857, 190401, 'หนองหมู', '14.288', '100.932', 121, 18150),
(858, 190402, 'บ้านลำ', '14.391', '100.979', 121, 18150),
(859, 190403, 'คลองเรือ', '14.366', '101.032', 121, 18150),
(860, 190404, 'วิหารแดง', '14.313', '100.990', 121, 18150),
(861, 190405, 'หนองสรวง', '14.340', '100.983', 121, 18150),
(862, 190406, 'เจริญธรรม', '14.387', '101.006', 121, 18150),
(863, 190501, 'หนองแซง', '14.510', '100.759', 122, 18170),
(864, 190502, 'หนองควายโซ', '14.487', '100.795', 122, 18170),
(865, 190503, 'หนองหัวโพ', '14.483', '100.817', 122, 18170),
(866, 190504, 'หนองสีดา', '14.515', '100.841', 122, 18170),
(867, 190505, 'หนองกบ', '14.456', '100.776', 122, 18170),
(868, 190506, 'ไก่เส่า', '14.516', '100.793', 122, 18170),
(869, 190507, 'โคกสะอาด', '14.456', '100.802', 122, 18170),
(870, 190508, 'ม่วงหวาน', '14.476', '100.836', 122, 18170),
(871, 190601, 'บ้านหมอ', '14.616', '100.724', 123, 18130),
(872, 190602, 'บางโขมด', '14.591', '100.742', 123, 18130),
(873, 190603, 'สร้างโศก', '14.622', '100.754', 123, 18130),
(874, 190604, 'ตลาดน้อย', '14.643', '100.716', 123, 18130),
(875, 190605, 'หรเทพ', '14.628', '100.670', 123, 18130),
(876, 190606, 'โคกใหญ่', '14.606', '100.677', 123, 18130),
(877, 190607, 'ไผ่ขวาง', '14.579', '100.648', 123, 18130);
INSERT INTO `db-subdistrinct` (`AD3ID`, `code`, `subDistrinct`, `latitude`, `longitude`, `AD2ID`, `zip_code`) VALUES
(878, 190608, 'บ้านครัว', '14.584', '100.767', 123, 18270),
(879, 190609, 'หนองบัว', '14.618', '100.774', 123, 18130),
(880, 190701, 'ดอนพุด', '14.596', '100.621', 124, 18210),
(881, 190702, 'ไผ่หลิ่ว', '14.625', '100.632', 124, 18210),
(882, 190703, 'บ้านหลวง', '14.571', '100.620', 124, 18210),
(883, 190704, 'ดงตะงาว', '14.624', '100.599', 124, 18210),
(884, 190801, 'หนองโดน', '14.688', '100.693', 125, 18190),
(885, 190802, 'บ้านกลับ', '14.730', '100.684', 125, 18190),
(886, 190803, 'ดอนทอง', '14.664', '100.654', 125, 18190),
(887, 190804, 'บ้านโปร่ง', '14.716', '100.734', 125, 18190),
(888, 190901, 'พระพุทธบาท', '14.732', '100.782', 126, 18120),
(889, 190902, 'ขุนโขลน', '14.713', '100.831', 126, 18120),
(890, 190903, 'ธารเกษม', '14.763', '100.812', 126, 18120),
(891, 190904, 'นายาว', '14.768', '100.763', 126, 18120),
(892, 190905, 'พุคำจาน', '14.744', '100.847', 126, 18120),
(893, 190906, 'เขาวง', '14.679', '100.830', 126, 18120),
(894, 190907, 'ห้วยป่าหวาย', '14.638', '100.830', 126, 18120),
(895, 190908, 'พุกร่าง', '14.682', '100.784', 126, 18120),
(896, 191001, 'เสาไห้', '14.538', '100.850', 127, 18160),
(897, 191002, 'บ้านยาง', '14.582', '100.816', 127, 18160),
(898, 191003, 'หัวปลวก', '14.615', '100.844', 127, 18160),
(899, 191004, 'งิ้วงาม', '14.590', '100.851', 127, 18160),
(900, 191005, 'ศาลารีไทย', '14.565', '100.848', 127, 18160),
(901, 191006, 'ต้นตาล', '14.574', '100.885', 127, 18160),
(902, 191007, 'ท่าช้าง', '14.586', '100.863', 127, 18160),
(903, 191008, 'พระยาทด', '14.572', '100.871', 127, 18160),
(904, 191009, 'ม่วงงาม', '14.544', '100.807', 127, 18160),
(905, 191010, 'เริงราง', '14.558', '100.786', 127, 18160),
(906, 191011, 'เมืองเก่า', '14.540', '100.825', 127, 18160),
(907, 191012, 'สวนดอกไม้', '14.540', '100.868', 127, 18160),
(908, 191101, 'มวกเหล็ก', '14.705', '101.151', 128, 18180),
(909, 191102, 'มิตรภาพ', '14.474', '101.213', 128, 18180),
(910, 191104, 'หนองย่างเสือ', '14.789', '101.270', 128, 18180),
(911, 191105, 'ลำสมพุง', '15.007', '101.381', 128, 18180),
(912, 191107, 'ลำพญากลาง', '14.871', '101.367', 128, 18180),
(913, 191109, 'ซับสนุ่น', '14.932', '101.309', 128, 18220),
(914, 191201, 'แสลงพัน', '14.745', '101.116', 129, 18220),
(915, 191202, 'คำพราน', '14.818', '101.132', 129, 18220),
(916, 191203, 'วังม่วง', '14.861', '101.151', 129, 18220),
(917, 191301, 'เขาดินพัฒนา', '14.612', '100.906', 130, 18000),
(918, 191302, 'บ้านแก้ง', '14.582', '100.936', 130, 18000),
(919, 191303, 'ผึ้งรวง', '14.607', '100.931', 130, 18000),
(920, 191304, 'พุแค', '14.656', '100.905', 130, 18240),
(921, 191305, 'ห้วยบง', '14.626', '100.877', 130, 18000),
(922, 191306, 'หน้าพระลาน', '14.713', '100.904', 130, 18240),
(923, 200101, 'บางปลาสร้อย', '13.364', '100.987', 131, 20000),
(924, 200102, 'มะขามหย่ง', '13.372', '100.985', 131, 20000),
(925, 200103, 'บ้านโขด', '13.376', '100.990', 131, 20000),
(926, 200104, 'แสนสุข', '13.274', '100.928', 131, 20000),
(927, 200105, 'บ้านสวน', '13.347', '100.977', 131, 20000),
(928, 200106, 'หนองรี', '13.307', '101.057', 131, 20000),
(929, 200107, 'นาป่า', '13.385', '101.030', 131, 20000),
(930, 200108, 'หนองข้างคอก', '13.305', '101.006', 131, 20000),
(931, 200109, 'ดอนหัวฬอ', '13.421', '101.044', 131, 20000),
(932, 200110, 'หนองไม้แดง', '13.406', '101.003', 131, 20000),
(933, 200111, 'บางทราย', '13.393', '100.996', 131, 20000),
(934, 200112, 'คลองตำหรุ', '13.441', '100.982', 131, 20000),
(935, 200113, 'เหมือง', '13.263', '100.959', 131, 20130),
(936, 200114, 'บ้านปึก', '13.302', '100.928', 131, 20130),
(937, 200115, 'ห้วยกะปิ', '13.304', '100.968', 131, 20000),
(938, 200116, 'เสม็ด', '13.326', '100.951', 131, 20130),
(939, 200117, 'อ่างศิลา', '13.325', '100.929', 131, 20000),
(940, 200118, 'สำนักบก', '13.368', '101.061', 131, 20000),
(941, 200201, 'บ้านบึง', '13.297', '101.107', 132, 20170),
(942, 200202, 'คลองกิ่ว', '13.225', '101.107', 132, 20220),
(943, 200203, 'มาบไผ่', '13.359', '101.093', 132, 20170),
(944, 200204, 'หนองซ้ำซาก', '13.330', '101.072', 132, 20170),
(945, 200205, 'หนองบอนแดง', '13.353', '101.159', 132, 20170),
(946, 200206, 'หนองชาก', '13.298', '101.172', 132, 20170),
(947, 200207, 'หนองอิรุณ', '13.280', '101.247', 132, 20220),
(948, 200208, 'หนองไผ่แก้ว', '13.213', '101.246', 132, 20220),
(949, 200301, 'หนองใหญ่', '13.153', '101.375', 133, 20190),
(950, 200302, 'คลองพลู', '13.115', '101.476', 133, 20190),
(951, 200303, 'หนองเสือช้าง', '13.117', '101.283', 133, 20190),
(952, 200304, 'ห้างสูง', '13.243', '101.347', 133, 20190),
(953, 200305, 'เขาซก', '13.070', '101.420', 133, 20190),
(954, 200401, 'บางละมุง', '13.052', '100.922', 134, 20150),
(955, 200402, 'หนองปรือ', '12.920', '100.935', 134, 20150),
(956, 200403, 'หนองปลาไหล', '12.982', '100.945', 134, 20150),
(957, 200404, 'โป่ง', '12.933', '100.987', 134, 20150),
(958, 200405, 'เขาไม้แก้ว', '12.951', '101.057', 134, 20150),
(959, 200406, 'ห้วยใหญ่', '12.835', '100.985', 134, 20150),
(960, 200407, 'ตะเคียนเตี้ย', '13.002', '101.015', 134, 20150),
(961, 200408, 'นาเกลือ', '12.955', '100.909', 134, 20150),
(962, 200409, 'เขตการปกคองพิเศษพัทยา', '12.910', '100.884', 134, NULL),
(963, 200501, 'พานทอง', '13.461', '101.084', 135, 20160),
(964, 200502, 'หนองตำลึง', '13.408', '101.078', 135, 20160),
(965, 200503, 'มาบโป่ง', '13.431', '101.121', 135, 20160),
(966, 200504, 'หนองกะขะ', '13.431', '101.095', 135, 20160),
(967, 200505, 'หนองหงษ์', '13.389', '101.113', 135, 20160),
(968, 200506, 'โคกขี้หนอน', '13.552', '101.114', 135, 20160),
(969, 200507, 'บ้านเก่า', '13.454', '101.059', 135, 20160),
(970, 200508, 'หน้าประดู่', '13.497', '101.099', 135, 20160),
(971, 200509, 'บางนาง', '13.487', '101.067', 135, 20160),
(972, 200510, 'เกาะลอย', '13.519', '101.074', 135, 20160),
(973, 200511, 'บางหัก', '13.544', '101.075', 135, 20160),
(974, 200601, 'พนัสนิคม', '13.450', '101.180', 136, 20140),
(975, 200602, 'หน้าพระธาตุ', '13.468', '101.147', 136, 20140),
(976, 200603, 'วัดหลวง', '13.518', '101.161', 136, 20140),
(977, 200604, 'บ้านเชิด', '13.444', '101.144', 136, 20140),
(978, 200605, 'นาเริก', '13.405', '101.248', 136, 20140),
(979, 200606, 'หมอนนาง', '13.346', '101.257', 136, 20140),
(980, 200607, 'สระสี่เหลี่ยม', '13.554', '101.239', 136, 20140),
(981, 200608, 'วัดโบสถ์', '13.498', '101.139', 136, 20140),
(982, 200609, 'กุฎโง้ง', '13.444', '101.165', 136, 20140),
(983, 200610, 'หัวถนน', '13.531', '101.265', 136, 20140),
(984, 200611, 'ท่าข้าม', '13.559', '101.177', 136, 20140),
(985, 200613, 'หนองปรือ', '13.511', '101.254', 136, 20140),
(986, 200614, 'หนองขยาด', '13.402', '101.151', 136, 20140),
(987, 200615, 'ทุ่งขวาง', '13.400', '101.188', 136, 20140),
(988, 200616, 'หนองเหียง', '13.464', '101.330', 136, 20140),
(989, 200617, 'นาวังหิน', '13.442', '101.251', 136, 20140),
(990, 200618, 'บ้านช้าง', '13.435', '101.213', 136, 20140),
(991, 200620, 'โคกเพลาะ', '13.520', '101.121', 136, 20140),
(992, 200621, 'ไร่หลักทอง', '13.484', '101.184', 136, 20140),
(993, 200701, 'ศรีราชา', '13.174', '100.920', 137, 20110),
(994, 200702, 'สุรศักดิ์', '13.160', '100.983', 137, 20110),
(995, 200703, 'ทุ่งสุขลา', '13.097', '100.912', 137, 20230),
(996, 200704, 'บึง', '13.073', '101.006', 137, 20230),
(997, 200705, 'หนองขาม', '13.134', '101.038', 137, 20110),
(998, 200706, 'เขาคันทรง', '13.129', '101.123', 137, 20110),
(999, 200707, 'บางพระ', '13.223', '101.007', 137, 20110),
(1000, 200708, 'บ่อวิน', '13.052', '101.093', 137, 20230),
(1001, 200801, 'ท่าเทววงษ์', '13.151', '100.809', 138, 20120),
(1002, 200901, 'สัตหีบ', '12.638', '100.871', 139, 20180),
(1003, 200902, 'นาจอมเทียน', '12.775', '100.940', 139, 20250),
(1004, 200903, 'พลูตาหลวง', '12.701', '100.967', 139, 20180),
(1005, 200904, 'บางเสร่', '12.744', '100.908', 139, 20250),
(1006, 200905, 'แสมสาร', '12.572', '100.932', 139, 20180),
(1007, 201001, 'บ่อทอง', '13.193', '101.504', 140, 20270),
(1008, 201002, 'วัดสุวรรณ', '13.332', '101.419', 140, 20270),
(1009, 201003, 'บ่อกวางทอง', '13.318', '101.308', 140, 20270),
(1010, 201004, 'ธาตุทอง', '13.259', '101.389', 140, 20270),
(1011, 201005, 'เกษตรสุวรรณ', '13.326', '101.526', 140, 20270),
(1012, 201006, 'พลวงทอง', '13.217', '101.626', 140, 20270),
(1013, 201101, 'เกาะจันทร์', '13.403', '101.421', 141, 20240),
(1014, 201102, 'ท่าบุญมี', '13.389', '101.288', 141, 20240),
(1015, 210101, 'ท่าประดู่', '12.672', '101.266', 142, 21000),
(1016, 210102, 'เชิงเนิน', '12.677', '101.318', 142, 21000),
(1017, 210103, 'ตะพง', '12.653', '101.364', 142, 21000),
(1018, 210105, 'เพ', '12.568', '101.455', 142, 21160),
(1019, 210106, 'แกลง', '12.663', '101.467', 142, 21160),
(1020, 210107, 'บ้านแลง', '12.707', '101.377', 142, 21000),
(1021, 210108, 'นาตาขวัญ', '12.741', '101.369', 142, 21000),
(1022, 210109, 'เนินพระ', '12.681', '101.223', 142, 21000),
(1023, 210110, 'กระเฉด', '12.843', '101.456', 142, 21100),
(1024, 210111, 'ทับมา', '12.708', '101.247', 142, 21000),
(1025, 210112, 'น้ำคอก', '12.716', '101.269', 142, 21000),
(1026, 210114, 'มาบตาพุด', '12.701', '101.188', 142, 21150),
(1027, 210115, 'สำนักทอง', '12.721', '101.472', 142, 21100),
(1028, 210201, 'สำนักท้อน', '12.804', '101.066', 143, 21130),
(1029, 210202, 'พลา', '12.688', '101.025', 143, 21130),
(1030, 210203, 'บ้านฉาง', '12.732', '101.076', 143, 21130),
(1031, 210301, 'ทางเกวียน', '12.807', '101.625', 144, 21110),
(1032, 210302, 'วังหว้า', '12.763', '101.624', 144, 21110),
(1033, 210303, 'ชากโดน', '12.700', '101.604', 144, 21110),
(1034, 210304, 'เนินฆ้อ', '12.704', '101.678', 144, 21110),
(1035, 210305, 'กร่ำ', '12.668', '101.631', 144, 21190),
(1036, 210306, 'ชากพง', '12.668', '101.549', 144, 21190),
(1037, 210307, 'กระแสบน', '12.871', '101.611', 144, 21110),
(1038, 210308, 'บ้านนา', '12.846', '101.674', 144, 21110),
(1039, 210309, 'ทุ่งควายกิน', '12.808', '101.733', 144, 21110),
(1040, 210310, 'กองดิน', '12.815', '101.792', 144, 22160),
(1041, 210311, 'คลองปูน', '12.765', '101.750', 144, 21170),
(1042, 210312, 'พังราด', '12.729', '101.772', 144, 21110),
(1043, 210313, 'ปากน้ำกระแส', '12.717', '101.709', 144, 21170),
(1044, 210317, 'ห้วยยาง', '12.812', '101.533', 144, 21110),
(1045, 210318, 'สองสลึง', '12.743', '101.548', 144, 21110),
(1046, 210401, 'วังจันทร์', '12.858', '101.528', 145, 21210),
(1047, 210402, 'ชุมแสง', '12.956', '101.526', 145, 21210),
(1048, 210403, 'ป่ายุบใน', '13.005', '101.479', 145, 21210),
(1049, 210404, 'พลงตาเอี่ยม', '12.912', '101.541', 145, 21210),
(1050, 210501, 'บ้านค่าย', '12.775', '101.304', 146, 21120),
(1051, 210502, 'หนองละลอก', '12.821', '101.256', 146, 21120),
(1052, 210503, 'หนองตะพาน', '12.752', '101.258', 146, 21120),
(1053, 210504, 'ตาขัน', '12.735', '101.321', 146, 21120),
(1054, 210505, 'บางบุตร', '12.848', '101.391', 146, 21120),
(1055, 210506, 'หนองบัว', '12.906', '101.373', 146, 21120),
(1056, 210507, 'ชากบก', '12.783', '101.364', 146, 21120),
(1057, 210601, 'ปลวกแดง', '12.978', '101.226', 147, 21140),
(1058, 210602, 'ตาสิทธิ์', '13.038', '101.225', 147, 21140),
(1059, 210603, 'ละหาร', '12.973', '101.311', 147, 21140),
(1060, 210604, 'แม่น้ำคู้', '12.908', '101.230', 147, 21140),
(1061, 210605, 'มาบยางพร', '12.970', '101.136', 147, 21140),
(1062, 210606, 'หนองไร่', '13.039', '101.338', 147, 21140),
(1063, 210701, 'น้ำเป็น', '12.901', '101.749', 148, 21110),
(1064, 210702, 'ห้วยทับมอญ', '13.027', '101.686', 148, 21110),
(1065, 210703, 'ชำฆ้อ', '12.933', '101.641', 148, 21110),
(1066, 210704, 'เขาน้อย', '13.062', '101.617', 148, 21110),
(1067, 210801, 'นิคมพัฒนา', '12.856', '101.177', 149, 21180),
(1068, 210802, 'มาบข่า', '12.782', '101.193', 149, 21180),
(1069, 210803, 'พนานิคม', '12.902', '101.135', 149, 21180),
(1070, 210804, 'มะขามคู่', '12.847', '101.101', 149, 21180),
(1071, 220101, 'ตลาด', '12.591', '102.087', 150, 22000),
(1072, 220102, 'วัดใหม่', '12.611', '102.105', 150, 22000),
(1073, 220103, 'คลองนารายณ์', '12.574', '102.166', 150, 22000),
(1074, 220104, 'เกาะขวาง', '12.562', '102.090', 150, 22000),
(1075, 220105, 'คมบาง', '12.542', '102.169', 150, 22000),
(1076, 220106, 'ท่าช้าง', '12.644', '102.098', 150, 22000),
(1077, 220107, 'จันทนิมิต', '12.610', '102.123', 150, 22000),
(1078, 220108, 'บางกะจะ', '12.563', '102.056', 150, 22000),
(1079, 220109, 'แสลง', '12.694', '102.107', 150, 22000),
(1080, 220110, 'หนองบัว', '12.534', '102.101', 150, 22000),
(1081, 220111, 'พลับพลา', '12.605', '102.172', 150, 22000),
(1082, 220201, 'ขลุง', '12.452', '102.218', 151, 22110),
(1083, 220202, 'บ่อ', '12.412', '102.279', 151, 22110),
(1084, 220203, 'เกวียนหัก', '12.468', '102.200', 151, 22110),
(1085, 220204, 'ตะปอน', '12.493', '102.175', 151, 22110),
(1086, 220205, 'บางชัน', '12.288', '102.251', 151, 22110),
(1087, 220206, 'วันยาว', '12.439', '102.234', 151, 22110),
(1088, 220207, 'ซึ้ง', '12.487', '102.288', 151, 22110),
(1089, 220208, 'มาบไพ', '12.598', '102.258', 151, 22110),
(1090, 220209, 'วังสรรพรส', '12.560', '102.290', 151, 22110),
(1091, 220210, 'ตรอกนอง', '12.533', '102.275', 151, 22110),
(1092, 220211, 'ตกพรม', '12.625', '102.339', 151, 22110),
(1093, 220212, 'บ่อเวฬุ', '12.723', '102.367', 151, 22150),
(1094, 220301, 'ท่าใหม่', '12.628', '101.985', 152, 22120),
(1095, 220302, 'ยายร้า', '12.612', '102.027', 152, 22120),
(1096, 220303, 'สีพยา', '12.578', '102.029', 152, 22120),
(1097, 220304, 'บ่อพุ', '12.595', '102.028', 152, 22120),
(1098, 220305, 'พลอยแหวน', '12.617', '102.053', 152, 22120),
(1099, 220306, 'เขาวัว', '12.637', '102.035', 152, 22120),
(1100, 220307, 'เขาบายศรี', '12.740', '102.061', 152, 22120),
(1101, 220308, 'สองพี่น้อง', '12.672', '101.973', 152, 22120),
(1102, 220309, 'ทุ่งเบญจา', '12.814', '102.014', 152, 22170),
(1103, 220311, 'รำพัน', '12.669', '101.914', 152, 22170),
(1104, 220312, 'โขมง', '12.620', '101.940', 152, 22170),
(1105, 220313, 'ตะกาดเง้า', '12.581', '101.989', 152, 22120),
(1106, 220314, 'คลองขุด', '12.563', '101.935', 152, 22120),
(1107, 220324, 'เขาแก้ว', '12.867', '101.939', 152, 22170),
(1108, 220401, 'ทับไทร', '12.950', '102.247', 153, 22140),
(1109, 220402, 'โป่งน้ำร้อน', '12.890', '102.382', 153, 22140),
(1110, 220404, 'หนองตาคง', '13.067', '102.381', 153, 22140),
(1111, 220409, 'เทพนิมิต', '13.044', '102.453', 153, 22140),
(1112, 220410, 'คลองใหญ่', '12.873', '102.476', 153, 22140),
(1113, 220501, 'มะขาม', '12.677', '102.187', 154, 22150),
(1114, 220502, 'ท่าหลวง', '12.700', '102.147', 154, 22150),
(1115, 220503, 'ปัถวี', '12.743', '102.272', 154, 22150),
(1116, 220504, 'วังแซ้ม', '12.756', '102.156', 154, 22150),
(1117, 220506, 'ฉมัน', '12.817', '102.224', 154, 22150),
(1118, 220508, 'อ่างคีรี', '12.644', '102.226', 154, 22150),
(1119, 220601, 'ปากน้ำแหลมสิงห์', '12.452', '102.122', 155, 22130),
(1120, 220602, 'เกาะเปริด', '12.409', '102.122', 155, 22130),
(1121, 220603, 'หนองชิ่ม', '12.417', '102.178', 155, 22130),
(1122, 220604, 'พลิ้ว', '12.516', '102.161', 155, 22190),
(1123, 220605, 'คลองน้ำเค็ม', '12.498', '102.123', 155, 22190),
(1124, 220606, 'บางสระเก้า', '12.511', '102.109', 155, 22190),
(1125, 220607, 'บางกะไชย', '12.465', '102.066', 155, 22120),
(1126, 220701, 'ปะตง', '13.170', '102.194', 156, 22180),
(1127, 220702, 'ทุ่งขนาน', '13.232', '102.319', 156, 22180),
(1128, 220703, 'ทับช้าง', '13.265', '102.161', 156, 22180),
(1129, 220704, 'ทรายขาว', '13.086', '102.197', 156, 22180),
(1130, 220705, 'สะตอน', '13.174', '102.371', 156, 22180),
(1131, 220801, 'แก่งหางแมว', '12.982', '101.929', 157, 22160),
(1132, 220802, 'ขุนซ่อง', '13.169', '101.961', 157, 22160),
(1133, 220803, 'สามพี่น้อง', '12.977', '101.817', 157, 22160),
(1134, 220804, 'พวา', '13.105', '101.791', 157, 22160),
(1135, 220805, 'เขาวงกต', '12.881', '101.848', 157, 22160),
(1136, 220901, 'นายายอาม', '12.782', '101.847', 158, 22160),
(1137, 220902, 'วังโตนด', '12.701', '101.933', 158, 22170),
(1138, 220903, 'กระแจะ', '12.689', '101.861', 158, 22170),
(1139, 220904, 'สนามไชย', '12.625', '101.874', 158, 22170),
(1140, 220905, 'ช้างข้าม', '12.707', '101.819', 158, 22160),
(1141, 220906, 'วังใหม่', '12.764', '101.904', 158, 22170),
(1142, 221001, 'ซากไทย', '12.765', '102.101', 159, 22210),
(1143, 221002, 'พลวง', '12.822', '102.106', 159, 22210),
(1144, 221003, 'ตะเคียนทอง', '12.903', '102.132', 159, 22210),
(1145, 221004, 'คลองพลู', '12.931', '102.014', 159, 22210),
(1146, 221005, 'จันทเขลม', '13.071', '102.090', 159, 22210),
(1147, 230102, 'หนองเสม็ด', '12.216', '102.504', 160, 23000),
(1148, 230103, 'หนองโสน', '12.184', '102.488', 160, 23000),
(1149, 230104, 'หนองคันทรง', '12.194', '102.542', 160, 23000),
(1150, 230105, 'ห้วงน้ำขาว', '12.143', '102.518', 160, 23000),
(1151, 230106, 'อ่าวใหญ่', '12.078', '102.562', 160, 23000),
(1152, 230107, 'วังกระแจะ', '12.272', '102.479', 160, 23000),
(1153, 230108, 'ห้วยแร้ง', '12.387', '102.560', 160, 23000),
(1154, 230109, 'เนินทราย', '12.283', '102.547', 160, 23000),
(1155, 230110, 'ท่าพริก', '12.243', '102.589', 160, 23000),
(1156, 230111, 'ท่ากุ่ม', '12.345', '102.675', 160, 23000),
(1157, 230112, 'ตะกาง', '12.250', '102.659', 160, 23000),
(1158, 230113, 'ชำราก', '12.194', '102.677', 160, 23000),
(1159, 230114, 'แหลมกลัด', '12.117', '102.704', 160, 23000),
(1160, 230201, 'คลองใหญ่', '11.774', '102.889', 161, 23110),
(1161, 230202, 'ไม้รูด', '11.910', '102.805', 161, 23110),
(1162, 230203, 'หาดเล็ก', '11.699', '102.909', 161, 23110),
(1163, 230301, 'เขาสมิง', '12.340', '102.437', 162, 23130),
(1164, 230302, 'แสนตุ้ง', '12.398', '102.382', 162, 23150),
(1165, 230303, 'วังตะเคียน', '12.478', '102.531', 162, 23130),
(1166, 230304, 'ท่าโสม', '12.296', '102.346', 162, 23150),
(1167, 230305, 'สะตอ', '12.553', '102.434', 162, 23150),
(1168, 230306, 'ประณีต', '12.525', '102.359', 162, 23150),
(1169, 230307, 'เทพนิมิต', '12.469', '102.435', 162, 23150),
(1170, 230308, 'ทุ่งนนทรี', '12.405', '102.501', 162, 23130),
(1171, 230401, 'บ่อพลอย', '12.604', '102.559', 163, 23140),
(1172, 230402, 'ช้างทูน', '12.585', '102.469', 163, 23140),
(1173, 230403, 'ด่านชุมพล', '12.461', '102.664', 163, 23140),
(1174, 230404, 'หนองบอน', '12.683', '102.447', 163, 23140),
(1175, 230405, 'นนทรีย์', '12.544', '102.600', 163, 23140),
(1176, 230501, 'แหลมงอบ', '12.186', '102.419', 164, 23120),
(1177, 230502, 'น้ำเชี่ยว', '12.209', '102.436', 164, 23120),
(1178, 230503, 'บางปิด', '12.241', '102.301', 164, 23120),
(1179, 230507, 'คลองใหญ่', '12.226', '102.362', 164, 23120),
(1180, 230601, 'เกาะหมาก', '11.804', '102.383', 165, 23000),
(1181, 230602, 'เกาะกูด', '11.719', '102.519', 165, 23000),
(1182, 230701, 'เกาะช้าง', '12.070', '102.321', 166, 23170),
(1183, 230702, 'เกาะช้างใต้', '11.996', '102.331', 166, 23170),
(1184, 240101, 'หน้าเมือง', '13.686', '101.066', 167, 24000),
(1185, 240102, 'ท่าไข่', '13.736', '101.060', 167, 24000),
(1186, 240103, 'บ้านใหม่', '13.707', '101.100', 167, 24000),
(1187, 240104, 'คลองนา', '13.648', '101.102', 167, 24000),
(1188, 240105, 'บางตีนเป็ด', '13.661', '101.075', 167, 24000),
(1189, 240106, 'บางไผ่', '13.692', '101.102', 167, 24000),
(1190, 240107, 'คลองจุกกระเฌอ', '13.686', '101.125', 167, 24000),
(1191, 240108, 'บางแก้ว', '13.765', '101.094', 167, 24000),
(1192, 240109, 'บางขวัญ', '13.780', '101.054', 167, 24000),
(1193, 240110, 'คลองนครเนื่องเขต', '13.766', '101.008', 167, 24000),
(1194, 240111, 'วังตะเคียน', '13.719', '101.034', 167, 24000),
(1195, 240112, 'โสธร', '13.680', '101.053', 167, 24000),
(1196, 240113, 'บางพระ', '13.653', '101.020', 167, 24000),
(1197, 240114, 'บางกระไห', '13.670', '101.002', 167, 24000),
(1198, 240115, 'หนามแดง', '13.736', '100.989', 167, 24000),
(1199, 240116, 'คลองเปรง', '13.707', '100.933', 167, 24000),
(1200, 240117, 'คลองอุดมชลจร', '13.736', '100.920', 167, 24000),
(1201, 240118, 'คลองหลวงแพ่ง', '13.780', '100.927', 167, 24000),
(1202, 240119, 'บางเตย', '13.706', '100.993', 167, 24000),
(1203, 240201, 'บางคล้า', '13.722', '101.210', 168, 24110),
(1204, 240204, 'บางสวน', '13.696', '101.177', 168, 24110),
(1205, 240208, 'บางกระเจ็ด', '13.852', '101.208', 168, 24110),
(1206, 240209, 'ปากน้ำ', '13.753', '101.212', 168, 24110),
(1207, 240210, 'ท่าทองหลาง', '13.694', '101.229', 168, 24110),
(1208, 240211, 'สาวชะโงก', '13.683', '101.152', 168, 24110),
(1209, 240212, 'เสม็ดเหนือ', '13.673', '101.201', 168, 24110),
(1210, 240213, 'เสม็ดใต้', '13.653', '101.162', 168, 24110),
(1211, 240214, 'หัวไทร', '13.799', '101.221', 168, 24110),
(1212, 240301, 'บางน้ำเปรี้ยว', '13.829', '101.002', 169, 24150),
(1213, 240302, 'บางขนาก', '13.858', '101.115', 169, 24150),
(1214, 240303, 'สิงโตทอง', '13.911', '101.073', 169, 24150),
(1215, 240304, 'หมอนทอง', '13.874', '101.043', 169, 24150),
(1216, 240305, 'บึงน้ำรักษ์', '13.908', '100.926', 169, 24170),
(1217, 240306, 'ดอนเกาะกา', '13.944', '101.016', 169, 24170),
(1218, 240307, 'โยธะกา', '13.925', '101.128', 169, 24150),
(1219, 240308, 'ดอนฉิมพลี', '13.908', '100.964', 169, 24170),
(1220, 240309, 'ศาลาแดง', '13.838', '100.928', 169, 24000),
(1221, 240310, 'โพรงอากาศ', '13.827', '101.062', 169, 24150),
(1222, 240401, 'บางปะกง', '13.496', '100.966', 170, 24130),
(1223, 240402, 'ท่าสะอ้าน', '13.553', '100.995', 170, 24130),
(1224, 240403, 'บางวัว', '13.569', '100.964', 170, 24180),
(1225, 240404, 'บางสมัคร', '13.575', '100.936', 170, 24180),
(1226, 240405, 'บางผึ้ง', '13.527', '101.054', 170, 24130),
(1227, 240406, 'บางเกลือ', '13.526', '100.919', 170, 24180),
(1228, 240407, 'สองคลอง', '13.484', '100.910', 170, 24130),
(1229, 240408, 'หนองจอก', '13.603', '100.989', 170, 24130),
(1230, 240409, 'พิมพา', '13.599', '100.937', 170, 24130),
(1231, 240410, 'ท่าข้าม', '13.479', '100.994', 170, 24130),
(1232, 240411, 'หอมศีล', '13.543', '100.892', 170, 24180),
(1233, 240412, 'เขาดิน', '13.528', '101.026', 170, 24130),
(1234, 240501, 'บ้านโพธิ์', '13.588', '101.086', 171, 24140),
(1235, 240502, 'เกาะไร่', '13.678', '100.958', 171, 24140),
(1236, 240503, 'คลองขุด', '13.611', '101.194', 171, 24140),
(1237, 240504, 'คลองบ้านโพธิ์', '13.572', '101.057', 171, 24140),
(1238, 240505, 'คลองประเวศ', '13.630', '101.024', 171, 24140),
(1239, 240506, 'ดอนทราย', '13.631', '101.125', 171, 24140),
(1240, 240507, 'เทพราช', '13.641', '100.982', 171, 24140),
(1241, 240508, 'ท่าพลับ', '13.616', '101.075', 171, 24140),
(1242, 240509, 'หนองตีนนก', '13.585', '101.107', 171, 24140),
(1243, 240510, 'หนองบัว', '13.617', '101.101', 171, 24140),
(1244, 240511, 'บางซ่อน', '13.558', '101.058', 171, 24140),
(1245, 240512, 'บางกรูด', '13.633', '101.078', 171, 24140),
(1246, 240513, 'แหลมประดู่', '13.597', '101.209', 171, 24140),
(1247, 240514, 'ลาดขวาง', '13.605', '101.023', 171, 24140),
(1248, 240515, 'สนามจันทร์', '13.594', '101.066', 171, 24140),
(1249, 240516, 'แสนภูดาษ', '13.582', '101.015', 171, 24140),
(1250, 240517, 'สิบเอ็ดศอก', '13.605', '101.148', 171, 24140),
(1251, 240601, 'เกาะขนุน', '13.695', '101.399', 172, 24120),
(1252, 240602, 'บ้านซ่อง', '13.803', '101.403', 172, 24120),
(1253, 240603, 'พนมสารคาม', '13.771', '101.324', 172, 24120),
(1254, 240604, 'เมืองเก่า', '13.728', '101.319', 172, 24120),
(1255, 240605, 'หนองยาว', '13.816', '101.351', 172, 24120),
(1256, 240606, 'ท่าถ่าน', '13.760', '101.383', 172, 24120),
(1257, 240607, 'หนองแหน', '13.661', '101.335', 172, 24120),
(1258, 240608, 'เขาหินซ้อน', '13.750', '101.494', 172, 24120),
(1259, 240701, 'บางคา', '13.788', '101.278', 173, 24120),
(1260, 240702, 'เมืองใหม่', '13.715', '101.278', 173, 24120),
(1261, 240703, 'ดงน้อย', '13.836', '101.291', 173, 24120),
(1262, 240801, 'คู้ยายหมี', '13.644', '101.461', 174, 24160),
(1263, 240802, 'ท่ากระดาน', '13.606', '101.710', 174, 24160),
(1264, 240803, 'ทุ่งพระยา', '13.687', '101.745', 174, 24160),
(1265, 240805, 'ลาดกระทิง', '13.548', '101.475', 174, 24160),
(1266, 240901, 'แปลงยาว', '13.599', '101.293', 175, 24190),
(1267, 240902, 'วังเย็น', '13.536', '101.334', 175, 24190),
(1268, 240903, 'หัวสำโรง', '13.624', '101.315', 175, 24190),
(1269, 240904, 'หนองไม้แก่น', '13.504', '101.404', 175, 24190),
(1270, 241001, 'ท่าตะเกียบ', '13.508', '101.639', 176, 24160),
(1271, 241002, 'คลองตะเกรา', '13.299', '101.739', 176, 24160),
(1272, 241101, 'ก้อนแก้ว', '13.765', '101.136', 177, 24000),
(1273, 241102, 'คลองเขื่อน', '13.772', '101.185', 177, 24000),
(1274, 241103, 'บางเล่า', '13.721', '101.150', 177, 24000),
(1275, 241104, 'บางโรง', '13.824', '101.137', 177, 24000),
(1276, 241105, 'บางตลาด', '13.736', '101.165', 177, 24110),
(1277, 250101, 'หน้าเมือง', '14.057', '101.374', 178, 25000),
(1278, 250102, 'รอบเมือง', '14.066', '101.327', 178, 25000),
(1279, 250103, 'วัดโบสถ์', '14.034', '101.310', 178, 25000),
(1280, 250104, 'บางเดชะ', '13.991', '101.330', 178, 25000),
(1281, 250105, 'ท่างาม', '14.017', '101.413', 178, 25000),
(1282, 250106, 'บางบริบูรณ์', '14.039', '101.429', 178, 25000),
(1283, 250107, 'ดงพระราม', '14.072', '101.394', 178, 25000),
(1284, 250108, 'บ้านพระ', '14.116', '101.361', 178, 25230),
(1285, 250109, 'โคกไม้ลาย', '14.140', '101.298', 178, 25230),
(1286, 250111, 'ดงขี้เหล็ก', '14.132', '101.439', 178, 25000),
(1287, 250112, 'เนินหอม', '14.181', '101.378', 178, 25230),
(1288, 250113, 'โนนห้อม', '14.094', '101.463', 178, 25000),
(1289, 250201, 'กบินทร์', '13.939', '101.711', 179, 25110),
(1290, 250202, 'เมืองเก่า', '13.999', '101.770', 179, 25240),
(1291, 250203, 'วังดาล', '14.006', '101.645', 179, 25110),
(1292, 250204, 'นนทรี', '14.056', '101.668', 179, 25110),
(1293, 250205, 'ย่านรี', '13.897', '101.785', 179, 25110),
(1294, 250206, 'วังตะเคียน', '13.849', '101.870', 179, 25110),
(1295, 250207, 'หาดนางแก้ว', '13.963', '101.642', 179, 25110),
(1296, 250208, 'ลาดตะเคียน', '13.873', '101.658', 179, 25110),
(1297, 250209, 'บ้านนา', '13.990', '101.880', 179, 25110),
(1298, 250210, 'บ่อทอง', '13.935', '101.881', 179, 25110),
(1299, 250211, 'หนองกี่', '14.068', '101.841', 179, 25110),
(1300, 250212, 'นาแขม', '14.052', '101.723', 179, 25110),
(1301, 250213, 'เขาไม้แก้ว', '13.801', '101.775', 179, 25110),
(1302, 250214, 'วังท่าช้าง', '13.694', '101.885', 179, 25110),
(1303, 250301, 'นาดี', '14.189', '101.792', 180, 25220),
(1304, 250302, 'สำพันตา', '14.081', '101.766', 180, 25220),
(1305, 250303, 'สะพานหิน', '14.152', '101.665', 180, 25220),
(1306, 250304, 'ทุ่งโพธิ์', '14.141', '101.889', 180, 25220),
(1307, 250305, 'แก่งดินสอ', '14.095', '101.984', 180, 25220),
(1308, 250306, 'บุพราหมณ์', '14.268', '101.872', 180, 25220),
(1309, 250601, 'บ้านสร้าง', '14.026', '101.210', 181, 25150),
(1310, 250602, 'บางกระเบา', '13.984', '101.202', 181, 25150),
(1311, 250603, 'บางเตย', '13.946', '101.223', 181, 25150),
(1312, 250604, 'บางยาง', '13.940', '101.175', 181, 25150),
(1313, 250605, 'บางแตน', '13.890', '101.177', 181, 25150),
(1314, 250606, 'บางพลวง', '13.986', '101.282', 181, 25150),
(1315, 250607, 'บางปลาร้า', '13.926', '101.313', 181, 25150),
(1316, 250608, 'บางขาม', '13.893', '101.274', 181, 25150),
(1317, 250609, 'กระทุ่มแพ้ว', '13.891', '101.346', 181, 25150),
(1318, 250701, 'ประจันตคาม', '14.055', '101.497', 182, 25130),
(1319, 250702, 'เกาะลอย', '14.021', '101.515', 182, 25130),
(1320, 250703, 'บ้านหอย', '13.996', '101.567', 182, 25130),
(1321, 250704, 'หนองแสง', '14.052', '101.563', 182, 25130),
(1322, 250705, 'ดงบัง', '14.020', '101.579', 182, 25130),
(1323, 250706, 'คำโตนด', '14.112', '101.597', 182, 25130),
(1324, 250707, 'บุฝ้าย', '14.298', '101.601', 182, 25130),
(1325, 250708, 'หนองแก้ว', '14.111', '101.548', 182, 25130),
(1326, 250709, 'โพธิ์งาม', '14.214', '101.466', 182, 25130),
(1327, 250801, 'ศรีมหาโพธิ', '13.849', '101.567', 183, 25140),
(1328, 250802, 'สัมพันธ์', '13.997', '101.480', 183, 25140),
(1329, 250803, 'บ้านทาม', '13.976', '101.552', 183, 25140),
(1330, 250804, 'ท่าตูม', '13.932', '101.571', 183, 25140),
(1331, 250805, 'บางกุ้ง', '13.964', '101.483', 183, 25140),
(1332, 250806, 'ดงกระทงยาม', '13.958', '101.426', 183, 25140),
(1333, 250807, 'หนองโพรง', '13.787', '101.581', 183, 25140),
(1334, 250808, 'หัวหว้า', '13.908', '101.461', 183, 25140),
(1335, 250809, 'หาดยาง', '13.988', '101.432', 183, 25140),
(1336, 250810, 'กรอกสมบูรณ์', '13.767', '101.660', 183, 25140),
(1337, 250901, 'โคกปีบ', '13.880', '101.412', 184, 25190),
(1338, 250902, 'โคกไทย', '13.845', '101.448', 184, 25190),
(1339, 250903, 'คู้ลำพัน', '13.926', '101.410', 184, 25190),
(1340, 250904, 'ไผ่ชะเลือด', '13.919', '101.372', 184, 25190),
(1341, 260101, 'นครนายก', '14.198', '101.233', 185, 26000),
(1342, 260102, 'ท่าช้าง', '14.192', '101.176', 185, 26000),
(1343, 260103, 'บ้านใหญ่', '14.221', '101.225', 185, 26000),
(1344, 260104, 'วังกระโจม', '14.176', '101.212', 185, 26000),
(1345, 260105, 'ท่าทราย', '14.174', '101.111', 185, 26000),
(1346, 260106, 'ดอนยอ', '14.128', '101.109', 185, 26000),
(1347, 260107, 'ศรีจุฬา', '14.072', '101.132', 185, 26000),
(1348, 260108, 'ดงละคร', '14.136', '101.167', 185, 26000),
(1349, 260109, 'ศรีนาวา', '14.209', '101.267', 185, 26000),
(1350, 260110, 'สาริกา', '14.359', '101.261', 185, 26000),
(1351, 260111, 'หินตั้ง', '14.408', '101.352', 185, 26000),
(1352, 260112, 'เขาพระ', '14.301', '101.212', 185, 26000),
(1353, 260113, 'พรหมณี', '14.264', '101.164', 185, 26000),
(1354, 260201, 'เกาะหวาย', '14.175', '101.271', 186, 26130),
(1355, 260202, 'เกาะโพธิ์', '14.156', '101.231', 186, 26130),
(1356, 260203, 'ปากพลี', '14.132', '101.263', 186, 26130),
(1357, 260204, 'โคกกรวด', '14.180', '101.306', 186, 26130),
(1358, 260205, 'ท่าเรือ', '14.085', '101.235', 186, 26130),
(1359, 260206, 'หนองแสง', '14.211', '101.307', 186, 26130),
(1360, 260207, 'นาหินลาด', '14.317', '101.457', 186, 26130),
(1361, 260301, 'บ้านนา', '14.262', '101.059', 187, 26110),
(1362, 260302, 'บ้านพร้าว', '14.222', '101.101', 187, 26110),
(1363, 260303, 'บ้านพริก', '14.252', '100.976', 187, 26110),
(1364, 260304, 'อาษา', '14.226', '101.009', 187, 26110),
(1365, 260305, 'ทองหลาง', '14.207', '101.037', 187, 26110),
(1366, 260306, 'บางอ้อ', '14.176', '101.069', 187, 26110),
(1367, 260307, 'พิกุลออก', '14.244', '101.027', 187, 26110),
(1368, 260308, 'ป่าขะ', '14.297', '101.065', 187, 26110),
(1369, 260309, 'เขาเพิ่ม', '14.362', '101.096', 187, 26110),
(1370, 260310, 'ศรีกะอาง', '14.308', '101.117', 187, 26110),
(1371, 260401, 'พระอาจารย์', '13.986', '101.020', 188, 26120),
(1372, 260402, 'บึงศาล', '14.052', '100.938', 188, 26120),
(1373, 260403, 'ศรีษะกระบือ', '14.043', '100.986', 188, 26120),
(1374, 260404, 'โพธิ์แทน', '14.208', '100.949', 188, 26120),
(1375, 260405, 'บางสมบูรณ์', '14.021', '101.112', 188, 26120),
(1376, 260406, 'ทรายมูล', '14.123', '101.069', 188, 26120),
(1377, 260407, 'บางปลากด', '14.166', '100.971', 188, 26120),
(1378, 260408, 'บางลูกเสือ', '14.054', '101.066', 188, 26120),
(1379, 260409, 'องครักษ์', '14.107', '101.005', 188, 26120),
(1380, 260410, 'ชุมพล', '13.990', '100.937', 188, 26120),
(1381, 260411, 'คลองใหญ่', '14.127', '100.980', 188, 26120),
(1382, 270101, 'สระแก้ว', '13.803', '102.077', 189, 27000),
(1383, 270102, 'บ้านแก้ง', '13.984', '101.990', 189, 27000),
(1384, 270103, 'ศาลาลำดวน', '13.838', '101.964', 189, 27000),
(1385, 270104, 'โคกปี่ฆ้อง', '13.925', '102.028', 189, 27000),
(1386, 270105, 'ท่าแยก', '14.064', '102.266', 189, 27000),
(1387, 270106, 'ท่าเกษม', '13.766', '102.164', 189, 27000),
(1388, 270108, 'สระขวัญ', '13.763', '102.008', 189, 27000),
(1389, 270111, 'หนองบอน', '13.850', '102.087', 189, 27000),
(1390, 270201, 'คลองหาด', '13.429', '102.329', 190, 27260),
(1391, 270202, 'ไทยอุดม', '13.407', '102.260', 190, 27260),
(1392, 270203, 'ซับมะกรูด', '13.519', '102.228', 190, 27260),
(1393, 270204, 'ไทรเดี่ยว', '13.593', '102.212', 190, 27260),
(1394, 270205, 'คลองไก่เถื่อน', '13.346', '102.301', 190, 27260),
(1395, 270206, 'เบญจขร', '13.542', '102.307', 190, 27260),
(1396, 270207, 'ไทรทอง', '13.614', '102.309', 190, 27260),
(1397, 270301, 'ตาพระยา', '13.956', '102.764', 191, 27180),
(1398, 270302, 'ทัพเสด็จ', '14.047', '102.813', 191, 27180),
(1399, 270306, 'ทัพราช', '14.079', '102.639', 191, 27180),
(1400, 270307, 'ทัพไทย', '14.123', '102.845', 191, 27180),
(1401, 270309, 'โคคลาน', '13.968', '102.650', 191, 27180),
(1402, 270401, 'วังน้ำเย็น', '13.517', '102.166', 192, 27210),
(1403, 270403, 'ตาหลังใน', '13.471', '102.130', 192, 27210),
(1404, 270405, 'คลองหินปูน', '13.606', '102.104', 192, 27210),
(1405, 270406, 'ทุ่งมหาเจริญ', '13.482', '102.009', 192, 27210),
(1406, 270501, 'วัฒนานคร', '13.741', '102.325', 193, 27160),
(1407, 270502, 'ท่าเกวียน', '13.666', '102.251', 193, 27160),
(1408, 270503, 'ผักขะ', '13.710', '102.382', 193, 27160),
(1409, 270504, 'โนนหมากเค็ง', '13.824', '102.315', 193, 27160),
(1410, 270505, 'หนองน้ำใส', '13.871', '102.341', 193, 27160),
(1411, 270506, 'ช่องกุ่ม', '14.001', '102.449', 193, 27160),
(1412, 270507, 'หนองแวง', '13.799', '102.372', 193, 27160),
(1413, 270508, 'แซร์ออ', '13.974', '102.518', 193, 27160),
(1414, 270509, 'หนองหมากฝ้าย', '14.024', '102.358', 193, 27160),
(1415, 270510, 'หนองตะเคียนบอน', '13.916', '102.265', 193, 27160),
(1416, 270511, 'ห้วยโจด', '13.771', '102.281', 193, 27160),
(1417, 270601, 'อรัญประเทศ', '13.680', '102.517', 194, 27120),
(1418, 270602, 'เมืองไผ่', '13.651', '102.427', 194, 27120),
(1419, 270603, 'หันทราย', '13.806', '102.452', 194, 27120),
(1420, 270604, 'คลองน้ำใส', '13.590', '102.514', 194, 27120),
(1421, 270605, 'ท่าข้าม', '13.639', '102.531', 194, 27120),
(1422, 270606, 'ป่าไร่', '13.745', '102.585', 194, 27120),
(1423, 270607, 'ทับพริก', '13.506', '102.336', 194, 27120),
(1424, 270608, 'บ้านใหม่หนองไทร', '13.715', '102.510', 194, 27120),
(1425, 270609, 'ผ่านศึก', '13.592', '102.432', 194, 27120),
(1426, 270610, 'หนองสังข์', '13.804', '102.539', 194, 27120),
(1427, 270611, 'คลองทับจันทร์', '13.643', '102.387', 194, 27120),
(1428, 270612, 'ฟากห้วย', '13.646', '102.480', 194, 27120),
(1429, 270613, 'บ้านด่าน', '13.746', '102.526', 194, 27120),
(1430, 270701, 'เขาฉกรรจ์', '13.663', '102.098', 195, 27000),
(1431, 270702, 'หนองหว้า', '13.672', '102.037', 195, 27000),
(1432, 270703, 'พระเพลิง', '13.596', '102.042', 195, 27000),
(1433, 270704, 'เขาสามสิบ', '13.708', '102.118', 195, 27000),
(1434, 270801, 'โคกสูง', '13.831', '102.719', 196, 27120),
(1435, 270802, 'หนองม่วง', '13.874', '102.582', 196, 27180),
(1436, 270803, 'หนองแวง', '13.866', '102.674', 196, 27180),
(1437, 270804, 'โนนหมากมุ่น', '13.774', '102.664', 196, 27120),
(1438, 270901, 'วังสมบูรณ์', '13.344', '102.207', 197, 27250),
(1439, 270902, 'วังใหม่', '13.413', '102.039', 197, 27250),
(1440, 270903, 'วังทอง', '13.338', '102.081', 197, 27250),
(1441, 300102, 'โพธิ์กลาง', '14.906', '102.102', 198, 30000),
(1442, 300103, 'หนองจะบก', '14.916', '102.064', 198, 30000),
(1443, 300104, 'โคกสูง', '15.095', '102.116', 198, 30310),
(1444, 300105, 'มะเริง', '14.980', '102.164', 198, 30000),
(1445, 300106, 'หนองระเวียง', '14.946', '102.199', 198, 30000),
(1446, 300107, 'ปรุใหญ่', '14.994', '102.052', 198, 30000),
(1447, 300108, 'หมื่นไวย', '15.011', '102.108', 198, 30000),
(1448, 300109, 'พลกรัง', '15.026', '102.011', 198, 30000),
(1449, 300110, 'หนองไผ่ล้อม', '14.947', '102.085', 198, 30000),
(1450, 300111, 'หัวทะเล', '14.965', '102.140', 198, 30000),
(1451, 300112, 'บ้านเกาะ', '14.981', '102.091', 198, 30000),
(1452, 300114, 'พุดซา', '15.049', '102.043', 198, 30000),
(1453, 300115, 'บ้านโพธิ์', '15.038', '102.191', 198, 30310),
(1454, 300116, 'จอหอ', '15.055', '102.148', 198, 30310),
(1455, 300117, 'โคกกรวด', '14.897', '101.974', 198, 30280),
(1456, 300118, 'ไชยมงคล', '14.849', '102.080', 198, 30000),
(1457, 300119, 'หนองบัวศาลา', '14.899', '102.152', 198, 30000),
(1458, 300120, 'สุรนารี', '14.915', '102.037', 198, 30000),
(1459, 300121, 'สีมุม', '14.986', '102.007', 198, 30000),
(1460, 300122, 'ตลาด', '15.018', '102.154', 198, 30310),
(1461, 300123, 'พะเนา', '14.986', '102.189', 198, 30000),
(1462, 300124, 'หนองกระทุ่ม', '15.009', '102.086', 198, 30000),
(1463, 300125, 'หนองไข่น้ำ', '15.105', '102.174', 198, 30310),
(1464, 300201, 'แชะ', '14.569', '102.278', 199, 30250),
(1465, 300202, 'เฉลียง', '14.489', '102.279', 199, 30250),
(1466, 300203, 'ครบุรี', '14.599', '102.130', 199, 30250),
(1467, 300204, 'โคกกระชาย', '14.301', '102.196', 199, 30250),
(1468, 300205, 'จระเข้หิน', '14.367', '102.100', 199, 30250),
(1469, 300206, 'มาบตะโกเอน', '14.570', '102.385', 199, 30250),
(1470, 300207, 'อรพิมพ์', '14.569', '102.207', 199, 30250),
(1471, 300208, 'บ้านใหม่', '14.449', '102.207', 199, 30250),
(1472, 300209, 'ลำเพียก', '14.255', '102.302', 199, 30250),
(1473, 300210, 'ครบุรีใต้', '14.529', '102.103', 199, 30250),
(1474, 300211, 'ตะแบกบาน', '14.462', '102.343', 199, 30250),
(1475, 300212, 'สระว่านพระยา', '14.528', '102.384', 199, 30250),
(1476, 300301, 'เสิงสาง', '14.426', '102.429', 200, 30330),
(1477, 300302, 'สระตะเคียน', '14.325', '102.552', 200, 30330),
(1478, 300303, 'โนนสมบูรณ์', '14.278', '102.398', 200, 30330),
(1479, 300304, 'กุดโบสถ์', '14.457', '102.540', 200, 30330),
(1480, 300305, 'สุขไพบูลย์', '14.526', '102.448', 200, 30330),
(1481, 300306, 'บ้านราษฎร์', '14.247', '102.474', 200, 30330),
(1482, 300401, 'เมืองคง', '15.451', '102.334', 201, 30260),
(1483, 300402, 'คูขาด', '15.445', '102.407', 201, 30260),
(1484, 300403, 'เทพาลัย', '15.368', '102.466', 201, 30260),
(1485, 300404, 'ตาจั่น', '15.314', '102.368', 201, 30260),
(1486, 300405, 'บ้านปรางค์', '15.474', '102.080', 201, 30260),
(1487, 300406, 'หนองมะนาว', '15.500', '102.280', 201, 30260),
(1488, 300407, 'หนองบัว', '15.496', '102.167', 201, 30260),
(1489, 300408, 'โนนเต็ง', '15.449', '102.266', 201, 30260),
(1490, 300409, 'ดอนใหญ่', '15.397', '102.357', 201, 30260),
(1491, 300410, 'ขามสมบูรณ์', '15.371', '102.403', 201, 30260),
(1492, 300501, 'บ้านเหลื่อม', '15.625', '102.136', 202, 30350),
(1493, 300502, 'วังโพธิ์', '15.571', '102.103', 202, 30350),
(1494, 300503, 'โคกกระเบื้อง', '15.571', '102.187', 202, 30350),
(1495, 300504, 'ช่อระกา', '15.540', '102.057', 202, 30350),
(1496, 300601, 'จักราช', '15.027', '102.432', 203, 30230),
(1497, 300603, 'ทองหลาง', '15.052', '102.353', 203, 30230),
(1498, 300604, 'สีสุก', '14.874', '102.385', 203, 30230),
(1499, 300605, 'หนองขาม', '14.931', '102.506', 203, 30230),
(1500, 300607, 'หนองพลวง', '15.070', '102.424', 203, 30230),
(1501, 300610, 'ศรีละกอ', '14.938', '102.427', 203, 30230),
(1502, 300611, 'คลองเมือง', '14.852', '102.502', 203, 30230),
(1503, 300613, 'หินโคน', '15.013', '102.498', 203, 30230),
(1504, 300701, 'กระโทก', '14.714', '102.189', 204, 30190),
(1505, 300702, 'พลับพลา', '14.755', '102.129', 204, 30190),
(1506, 300703, 'ท่าอ่าง', '14.821', '102.160', 204, 30190),
(1507, 300704, 'ทุ่งอรุณ', '14.631', '102.184', 204, 30190),
(1508, 300705, 'ท่าลาดขาว', '14.672', '102.154', 204, 30190),
(1509, 300706, 'ท่าจะหลุง', '14.870', '102.264', 204, 30190),
(1510, 300707, 'ท่าเยี่ยม', '14.716', '102.237', 204, 30190),
(1511, 300708, 'โชคชัย', '14.763', '102.172', 204, 30190),
(1512, 300709, 'ละลมใหม่พัฒนา', '14.811', '102.243', 204, 30190),
(1513, 300710, 'ด่านเกวียน', '14.864', '102.189', 204, 30190),
(1514, 300801, 'กุดพิมาน', '15.303', '101.759', 205, 30210),
(1515, 300802, 'ด่านขุนทด', '15.214', '101.788', 205, 30210),
(1516, 300803, 'ด่านนอก', '15.157', '101.870', 205, 30210),
(1517, 300804, 'ด่านใน', '15.119', '101.855', 205, 30210),
(1518, 300805, 'ตะเคียน', '15.124', '101.724', 205, 30210),
(1519, 300806, 'บ้านเก่า', '15.211', '101.673', 205, 30210),
(1520, 300807, 'บ้านแปรง', '15.372', '101.809', 205, 36220),
(1521, 300808, 'พันชนะ', '15.270', '101.689', 205, 30210),
(1522, 300809, 'สระจรเข้', '15.147', '101.808', 205, 30210),
(1523, 300810, 'หนองกราด', '15.348', '101.667', 205, 30210),
(1524, 300811, 'หนองบัวตะเกียด', '15.281', '101.821', 205, 30210),
(1525, 300812, 'หนองบัวละคร', '15.243', '101.863', 205, 30210),
(1526, 300813, 'หินดาด', '15.149', '101.618', 205, 30210),
(1527, 300815, 'ห้วยบง', '15.161', '101.486', 205, 30210),
(1528, 300817, 'โนนเมืองพัฒนา', '15.304', '101.897', 205, 30210),
(1529, 300818, 'หนองไทร', '15.360', '101.855', 205, 36220),
(1530, 300901, 'โนนไทย', '15.213', '102.061', 206, 30220),
(1531, 300902, 'ด่านจาก', '15.162', '102.095', 206, 30220),
(1532, 300903, 'กำปัง', '15.118', '102.060', 206, 30220),
(1533, 300904, 'สำโรง', '15.128', '102.018', 206, 30220),
(1534, 300905, 'ค้างพลู', '15.149', '101.973', 206, 30220),
(1535, 300906, 'บ้านวัง', '15.152', '101.914', 206, 30220),
(1536, 300907, 'บัลลังก์', '15.223', '101.928', 206, 30220),
(1537, 300908, 'สายออ', '15.226', '102.002', 206, 30220),
(1538, 300909, 'ถนนโพธิ์', '15.274', '102.138', 206, 30220),
(1539, 300914, 'มะค่า', '15.265', '102.098', 206, 30220),
(1540, 301001, 'โนนสูง', '15.179', '102.256', 207, 30160),
(1541, 301002, 'ใหม่', '15.152', '102.287', 207, 30160),
(1542, 301003, 'โตนด', '15.097', '102.293', 207, 30160),
(1543, 301004, 'บิง', '15.118', '102.333', 207, 30160),
(1544, 301005, 'ดอนชมพู', '15.171', '102.339', 207, 30160),
(1545, 301006, 'ธารปราสาท', '15.263', '102.392', 207, 30240),
(1546, 301007, 'หลุมข้าว', '15.224', '102.313', 207, 30160),
(1547, 301008, 'มะค่า', '15.315', '102.321', 207, 30160),
(1548, 301009, 'พลสงคราม', '15.299', '102.273', 207, 30160),
(1549, 301010, 'จันอัด', '15.161', '102.158', 207, 30160),
(1550, 301011, 'ขามเฒ่า', '15.305', '102.219', 207, 30160),
(1551, 301012, 'ด่านคล้า', '15.152', '102.212', 207, 30160),
(1552, 301013, 'ลำคอหงษ์', '15.252', '102.210', 207, 30160),
(1553, 301014, 'เมืองปราสาท', '15.201', '102.194', 207, 30160),
(1554, 301015, 'ดอนหวาย', '15.116', '102.287', 207, 30160),
(1555, 301016, 'ลำมูล', '15.072', '102.308', 207, 30160),
(1556, 301101, 'ขามสะแกแสง', '15.360', '102.195', 208, 30290),
(1557, 301102, 'โนนเมือง', '15.416', '102.116', 208, 30290),
(1558, 301103, 'เมืองนาท', '15.386', '102.248', 208, 30290),
(1559, 301104, 'ชีวึก', '15.351', '102.099', 208, 30290),
(1560, 301105, 'พะงาด', '15.334', '102.149', 208, 30290),
(1561, 301106, 'หนองหัวฟาน', '15.433', '102.237', 208, 30290),
(1562, 301107, 'เมืองเกษตร', '15.424', '102.159', 208, 30290),
(1563, 301201, 'บัวใหญ่', '15.602', '102.438', 209, 30120),
(1564, 301203, 'ห้วยยาง', '15.626', '102.363', 209, 30120),
(1565, 301204, 'เสมาใหญ่', '15.516', '102.429', 209, 30120),
(1566, 301206, 'ดอนตะหนิน', '15.486', '102.466', 209, 30120),
(1567, 301207, 'หนองบัวสะอาด', '15.593', '102.300', 209, 30120),
(1568, 301208, 'โนนทองหลาง', '15.522', '102.374', 209, 30120),
(1569, 301214, 'กุดจอก', '15.571', '102.502', 209, 30120),
(1570, 301215, 'ด่านช้าง', '15.623', '102.407', 209, 30120),
(1571, 301220, 'ขุนทอง', '15.683', '102.364', 209, 30120),
(1572, 301224, 'หนองแจ้งใหญ่', '15.567', '102.372', 209, 30120),
(1573, 301301, 'ประทาย', '15.536', '102.724', 210, 30180),
(1574, 301303, 'กระทุ่มราย', '15.530', '102.659', 210, 30180),
(1575, 301304, 'วังไม้แดง', '15.684', '102.632', 210, 30180),
(1576, 301306, 'ตลาดไทร', '15.528', '102.780', 210, 30180),
(1577, 301307, 'หนองพลวง', '15.583', '102.707', 210, 30180),
(1578, 301308, 'หนองค่าย', '15.596', '102.759', 210, 30180),
(1579, 301309, 'หันห้วยทราย', '15.611', '102.656', 210, 30180),
(1580, 301310, 'ดอนมัน', '15.491', '102.822', 210, 30180),
(1581, 301313, 'นางรำ', '15.484', '102.623', 210, 30180),
(1582, 301314, 'โนนเพ็ด', '15.677', '102.684', 210, 30180),
(1583, 301315, 'ทุ่งสว่าง', '15.493', '102.686', 210, 30180),
(1584, 301317, 'โคกกลาง', '15.463', '102.737', 210, 30180),
(1585, 301318, 'เมืองโดน', '15.635', '102.712', 210, 30180),
(1586, 301401, 'เมืองปัก', '14.719', '102.055', 211, 30150),
(1587, 301402, 'ตะคุ', '14.754', '101.953', 211, 30150),
(1588, 301403, 'โคกไทย', '14.741', '102.090', 211, 30150),
(1589, 301404, 'สำโรง', '14.650', '102.063', 211, 30150),
(1590, 301405, 'ตะขบ', '14.686', '101.745', 211, 30150),
(1591, 301406, 'นกออก', '14.686', '102.036', 211, 30150),
(1592, 301407, 'ดอน', '14.679', '102.108', 211, 30150),
(1593, 301409, 'ตูม', '14.701', '101.986', 211, 30150),
(1594, 301410, 'งิ้ว', '14.666', '101.997', 211, 30150),
(1595, 301411, 'สะแกราช', '14.604', '102.048', 211, 30150),
(1596, 301412, 'ลำนางแก้ว', '14.563', '101.870', 211, 30150),
(1597, 301416, 'ภูหลวง', '14.602', '101.984', 211, 30150),
(1598, 301417, 'ธงชัยเหนือ', '14.793', '102.034', 211, 30150),
(1599, 301418, 'สุขเกษม', '14.667', '101.939', 211, 30150),
(1600, 301419, 'เกษมทรัพย์', '14.663', '102.046', 211, 30150),
(1601, 301420, 'บ่อปลาทอง', '14.637', '101.902', 211, 30150),
(1602, 301501, 'ในเมือง', '15.206', '102.489', 212, 30110),
(1603, 301502, 'สัมฤทธิ์', '15.216', '102.424', 212, 30110),
(1604, 301503, 'โบสถ์', '15.215', '102.628', 212, 30110),
(1605, 301504, 'กระเบื้องใหญ่', '15.271', '102.458', 212, 30110),
(1606, 301505, 'ท่าหลวง', '15.282', '102.547', 212, 30110),
(1607, 301506, 'รังกาใหญ่', '15.190', '102.555', 212, 30110),
(1608, 301507, 'ชีวาน', '15.344', '102.540', 212, 30110),
(1609, 301508, 'นิคมสร้างตนเอง', '15.128', '102.490', 212, 30110),
(1610, 301509, 'กระชอน', '15.443', '102.670', 212, 30110),
(1611, 301510, 'ดงใหญ่', '15.338', '102.591', 212, 30110),
(1612, 301511, 'ธารละหลอด', '15.162', '102.403', 212, 30110),
(1613, 301512, 'หนองระเวียง', '15.113', '102.440', 212, 30110),
(1614, 301601, 'ห้วยแถลง', '14.967', '102.652', 213, 30240),
(1615, 301602, 'ทับสวาย', '15.021', '102.634', 213, 30240),
(1616, 301603, 'เมืองพลับพลา', '15.063', '102.634', 213, 30240),
(1617, 301604, 'หลุ่งตะเคียน', '15.120', '102.638', 213, 30240),
(1618, 301605, 'หินดาด', '14.995', '102.565', 213, 30240),
(1619, 301606, 'งิ้ว', '15.077', '102.689', 213, 30240),
(1620, 301607, 'กงรถ', '15.047', '102.752', 213, 30240),
(1621, 301608, 'หลุ่งประดู่', '15.060', '102.582', 213, 30240),
(1622, 301609, 'ตะโก', '15.019', '102.718', 213, 30240),
(1623, 301610, 'ห้วยแคน', '14.985', '102.687', 213, 30240),
(1624, 301701, 'ชุมพวง', '15.344', '102.750', 214, 30270),
(1625, 301702, 'ประสุข', '15.342', '102.685', 214, 30270),
(1626, 301703, 'ท่าลาด', '15.243', '102.720', 214, 30270),
(1627, 301704, 'สาหร่าย', '15.184', '102.735', 214, 30270),
(1628, 301705, 'ตลาดไทร', '15.109', '102.773', 214, 30270),
(1629, 301710, 'โนนรัง', '15.258', '102.810', 214, 30270),
(1630, 301714, 'หนองหลัก', '15.411', '102.732', 214, 30270),
(1631, 301716, 'โนนตูม', '15.167', '102.769', 214, 30270),
(1632, 301717, 'โนนยอ', '15.339', '102.828', 214, 30270),
(1633, 301801, 'สูงเนิน', '14.861', '101.842', 215, 30170),
(1634, 301802, 'เสมา', '14.982', '101.777', 215, 30170),
(1635, 301803, 'โคราช', '14.909', '101.851', 215, 30170),
(1636, 301804, 'บุ่งขี้เหล็ก', '14.952', '101.839', 215, 30170),
(1637, 301805, 'โนนค่า', '15.034', '101.840', 215, 30170),
(1638, 301806, 'โค้งยาง', '14.922', '101.903', 215, 30170),
(1639, 301807, 'มะเกลือเก่า', '14.779', '101.805', 215, 30170),
(1640, 301808, 'มะเกลือใหม่', '14.798', '101.728', 215, 30170),
(1641, 301809, 'นากลาง', '14.855', '101.942', 215, 30380),
(1642, 301810, 'หนองตะไก้', '14.790', '101.895', 215, 30380),
(1643, 301901, 'ขามทะเลสอ', '14.974', '101.959', 216, 30280),
(1644, 301902, 'โป่งแดง', '14.970', '101.916', 216, 30280),
(1645, 301903, 'พันดุง', '15.069', '101.952', 216, 30280),
(1646, 301904, 'หนองสรวง', '15.086', '101.894', 216, 30280),
(1647, 301905, 'บึงอ้อ', '15.028', '101.932', 216, 30280),
(1648, 302001, 'สีคิ้ว', '14.905', '101.687', 217, 30140),
(1649, 302002, 'บ้านหัน', '14.985', '101.750', 217, 30140),
(1650, 302003, 'กฤษณา', '15.046', '101.556', 217, 30140),
(1651, 302004, 'ลาดบัวขาว', '14.823', '101.629', 217, 30340),
(1652, 302005, 'หนองหญ้าขาว', '14.959', '101.574', 217, 30140),
(1653, 302006, 'กุดน้อย', '14.931', '101.753', 217, 30140),
(1654, 302007, 'หนองน้ำใส', '14.932', '101.485', 217, 30140),
(1655, 302008, 'วังโรงใหญ่', '15.045', '101.659', 217, 30140),
(1656, 302009, 'มิตรภาพ', '14.797', '101.685', 217, 30140),
(1657, 302010, 'คลองไผ่', '14.883', '101.515', 217, 30340),
(1658, 302011, 'ดอนเมือง', '15.020', '101.456', 217, 30140),
(1659, 302012, 'หนองบัวน้อย', '15.047', '101.760', 217, 30140),
(1660, 302101, 'ปากช่อง', '14.722', '101.363', 218, 30130),
(1661, 302102, 'กลางดง', '14.650', '101.283', 218, 30320),
(1662, 302103, 'จันทึก', '14.806', '101.456', 218, 30130),
(1663, 302104, 'วังกะทะ', '14.536', '101.640', 218, 30130),
(1664, 302105, 'หมูสี', '14.501', '101.402', 218, 30130),
(1665, 302106, 'หนองสาหร่าย', '14.689', '101.488', 218, 30130),
(1666, 302107, 'ขนงพระ', '14.594', '101.530', 218, 30130),
(1667, 302108, 'โป่งตาลอง', '14.472', '101.605', 218, 30130),
(1668, 302109, 'คลองม่วง', '14.647', '101.649', 218, 30130),
(1669, 302110, 'หนองน้ำแดง', '14.613', '101.398', 218, 30130),
(1670, 302111, 'วังไทร', '14.706', '101.573', 218, 30130),
(1671, 302112, 'พญาเย็น', '14.548', '101.246', 218, 30320),
(1672, 302201, 'หนองบุนนาก', '14.609', '102.400', 219, 30410),
(1673, 302202, 'สารภี', '14.814', '102.417', 219, 30410),
(1674, 302203, 'ไทยเจริญ', '14.743', '102.450', 219, 30410),
(1675, 302204, 'หนองหัวแรต', '14.715', '102.332', 219, 30410),
(1676, 302205, 'แหลมทอง', '14.780', '102.304', 219, 30410),
(1677, 302206, 'หนองตะไก้', '14.654', '102.397', 219, 30410),
(1678, 302207, 'ลุงเขว้า', '14.813', '102.339', 219, 30410),
(1679, 302208, 'หนองไม้ไผ่', '14.641', '102.320', 219, 30410),
(1680, 302209, 'บ้านใหม่', '14.754', '102.398', 219, 30410),
(1681, 302301, 'แก้งสนามนาง', '15.727', '102.277', 220, 30440),
(1682, 302302, 'โนนสำราญ', '15.750', '102.325', 220, 30440),
(1683, 302303, 'บึงพะไล', '15.661', '102.236', 220, 30440),
(1684, 302304, 'สีสุก', '15.640', '102.175', 220, 30440),
(1685, 302305, 'บึงสำโรง', '15.715', '102.198', 220, 30440),
(1686, 302402, 'โนนตาเถร', '15.435', '102.488', 221, 30360),
(1687, 302403, 'สำพะเนียง', '15.452', '102.568', 221, 30360),
(1688, 302404, 'วังหิน', '15.505', '102.567', 221, 30360),
(1689, 302405, 'ดอนยาวใหญ่', '15.410', '102.536', 221, 30360),
(1690, 302501, 'วังน้ำเขียว', '14.399', '101.817', 222, 30370),
(1691, 302502, 'วังหมี', '14.474', '101.769', 222, 30370),
(1692, 302503, 'ระเริง', '14.574', '101.731', 222, 30150),
(1693, 302504, 'อุดมทรัพย์', '14.490', '101.969', 222, 30370),
(1694, 302505, 'ไทยสามัคคี', '14.353', '101.966', 222, 30370),
(1695, 302601, 'สำนักตะคร้อ', '15.297', '101.564', 223, 30210),
(1696, 302602, 'หนองแวง', '15.256', '101.436', 223, 30210),
(1697, 302603, 'บึงปรือ', '15.303', '101.411', 223, 30210),
(1698, 302604, 'วังยายทอง', '15.349', '101.518', 223, 30210),
(1699, 302701, 'เมืองยาง', '15.418', '102.886', 224, 30270),
(1700, 302702, 'กระเบื้องนอก', '15.440', '102.957', 224, 30270),
(1701, 302703, 'ละหานปลาค้าว', '15.487', '102.889', 224, 30270),
(1702, 302704, 'โนนอุดม', '15.426', '102.812', 224, 30270),
(1703, 302801, 'สระพระ', '15.311', '101.959', 225, 30220),
(1704, 302802, 'มาบกราด', '15.369', '101.926', 225, 30220),
(1705, 302803, 'พังเทียม', '15.275', '101.995', 225, 30220),
(1706, 302804, 'ทัพรั้ง', '15.406', '101.976', 225, 30220),
(1707, 302805, 'หนองหอย', '15.334', '102.056', 225, 30220),
(1708, 302901, 'ขุย', '15.353', '102.866', 226, 30270),
(1709, 302902, 'บ้านยาง', '15.250', '102.944', 226, 30270),
(1710, 302903, 'ช่องแมว', '15.276', '102.874', 226, 30270),
(1711, 302904, 'ไพล', '15.360', '102.971', 226, 30270),
(1712, 303001, 'เมืองพะไล', '15.649', '102.532', 227, 30120),
(1713, 303002, 'โนนจาน', '15.699', '102.472', 227, 30120),
(1714, 303003, 'บัวลาย', '15.661', '102.468', 227, 30120),
(1715, 303004, 'หนองหว้า', '15.667', '102.573', 227, 30120),
(1716, 303101, 'สีดา', '15.564', '102.588', 228, 30430),
(1717, 303102, 'โพนทอง', '15.540', '102.590', 228, 30430),
(1718, 303103, 'โนนประดู่', '15.521', '102.479', 228, 30430),
(1719, 303104, 'สามเมือง', '15.591', '102.537', 228, 30430),
(1720, 303105, 'หนองตาดใหญ่', '15.617', '102.591', 228, 30430),
(1721, 303201, 'ช้างทอง', '15.029', '102.310', 229, 30230),
(1722, 303202, 'ท่าช้าง', '14.981', '102.323', 229, 30230),
(1723, 303203, 'พระพุทธ', '14.975', '102.232', 229, 30230),
(1724, 303204, 'หนองงูเหลือม', '15.053', '102.234', 229, 30000),
(1725, 303205, 'หนองยาง', '14.930', '102.287', 229, 30230),
(1726, 310101, 'ในเมือง', '14.999', '103.104', 230, 31000),
(1727, 310102, 'อิสาณ', '14.979', '103.128', 230, 31000),
(1728, 310103, 'เสม็ด', '14.941', '103.098', 230, 31000),
(1729, 310104, 'บ้านบัว', '14.949', '102.997', 230, 31000);
INSERT INTO `db-subdistrinct` (`AD3ID`, `code`, `subDistrinct`, `latitude`, `longitude`, `AD2ID`, `zip_code`) VALUES
(1730, 310105, 'สะแกโพรง', '14.853', '102.942', 230, 31000),
(1731, 310106, 'สวายจึก', '14.896', '103.146', 230, 31000),
(1732, 310108, 'บ้านยาง', '15.018', '103.156', 230, 31000),
(1733, 310112, 'พระครู', '15.099', '103.018', 230, 31000),
(1734, 310113, 'ถลุงเหล็ก', '15.116', '103.078', 230, 31000),
(1735, 310114, 'หนองตาด', '15.031', '103.024', 230, 31000),
(1736, 310117, 'ลุมปุ๊ก', '14.908', '102.951', 230, 31000),
(1737, 310118, 'สองห้อง', '14.808', '102.953', 230, 31000),
(1738, 310119, 'บัวทอง', '15.058', '103.136', 230, 31000),
(1739, 310120, 'ชุมเห็ด', '15.033', '103.093', 230, 31000),
(1740, 310122, 'หลักเขต', '14.824', '103.159', 230, 31000),
(1741, 310125, 'สะแกซำ', '14.871', '103.099', 230, 31000),
(1742, 310126, 'กลันทา', '15.095', '103.109', 230, 31000),
(1743, 310127, 'กระสัง', '14.974', '103.047', 230, 31000),
(1744, 310128, 'เมืองฝาง', '14.782', '102.982', 230, 31000),
(1745, 310201, 'คูเมือง', '15.240', '103.000', 231, 31190),
(1746, 310202, 'ปะเคียบ', '15.391', '103.054', 231, 31190),
(1747, 310203, 'บ้านแพ', '15.388', '103.008', 231, 31190),
(1748, 310204, 'พรสำราญ', '15.169', '103.027', 231, 31190),
(1749, 310205, 'หินเหล็กไฟ', '15.157', '103.064', 231, 31190),
(1750, 310206, 'ตูมใหญ่', '15.165', '103.137', 231, 31190),
(1751, 310207, 'หนองขมาร', '15.314', '102.995', 231, 31190),
(1752, 310301, 'กระสัง', '14.922', '103.296', 232, 31160),
(1753, 310302, 'ลำดวน', '15.061', '103.403', 232, 31160),
(1754, 310303, 'สองชั้น', '14.887', '103.224', 232, 31160),
(1755, 310304, 'สูงเนิน', '14.820', '103.239', 232, 31160),
(1756, 310305, 'หนองเต็ง', '14.905', '103.374', 232, 31160),
(1757, 310306, 'เมืองไผ่', '14.994', '103.292', 232, 31160),
(1758, 310307, 'ชุมแสง', '14.984', '103.395', 232, 31160),
(1759, 310308, 'บ้านปรือ', '14.848', '103.299', 232, 31160),
(1760, 310309, 'ห้วยสำราญ', '15.072', '103.336', 232, 31160),
(1761, 310310, 'กันทรารมย์', '14.966', '103.340', 232, 31160),
(1762, 310311, 'ศรีภูมิ', '15.027', '103.338', 232, 31160),
(1763, 310401, 'นางรอง', '14.673', '102.806', 233, 31110),
(1764, 310403, 'สะเดา', '14.577', '102.770', 233, 31110),
(1765, 310405, 'ชุมแสง', '14.561', '102.666', 233, 31110),
(1766, 310406, 'หนองโบสถ์', '14.612', '102.691', 233, 31110),
(1767, 310408, 'หนองกง', '14.674', '102.896', 233, 31110),
(1768, 310413, 'ถนนหัก', '14.616', '102.833', 233, 31110),
(1769, 310414, 'หนองไทร', '14.499', '102.757', 233, 31110),
(1770, 310415, 'ก้านเหลือง', '14.730', '102.711', 233, 31110),
(1771, 310416, 'บ้านสิงห์', '14.735', '102.789', 233, 31110),
(1772, 310417, 'ลำไทรโยง', '14.665', '102.735', 233, 31110),
(1773, 310418, 'ทรัพย์พระยา', '14.516', '102.662', 233, 31110),
(1774, 310424, 'หนองยายพิมพ์', '14.690', '102.863', 233, 31110),
(1775, 310425, 'หัวถนน', '14.661', '102.648', 233, 31110),
(1776, 310426, 'ทุ่งแสงทอง', '14.581', '102.705', 233, 31110),
(1777, 310427, 'หนองโสน', '14.737', '102.934', 233, 31110),
(1778, 310501, 'หนองกี่', '14.669', '102.571', 234, 31210),
(1779, 310502, 'เย้ยปราสาท', '14.739', '102.564', 234, 31210),
(1780, 310503, 'เมืองไผ่', '14.774', '102.645', 234, 31210),
(1781, 310504, 'ดอนอะราง', '14.642', '102.571', 234, 31210),
(1782, 310505, 'โคกสว่าง', '14.782', '102.489', 234, 31210),
(1783, 310506, 'ทุ่งกระตาดพัฒนา', '14.674', '102.497', 234, 31210),
(1784, 310507, 'ทุ่งกระเต็น', '14.693', '102.564', 234, 31210),
(1785, 310508, 'ท่าโพธิ์ชัย', '14.736', '102.635', 234, 31210),
(1786, 310509, 'โคกสูง', '14.806', '102.562', 234, 31210),
(1787, 310510, 'บุกระสัง', '14.724', '102.501', 234, 31210),
(1788, 310601, 'ละหานทราย', '14.418', '102.854', 235, 31170),
(1789, 310603, 'ตาจง', '14.439', '102.920', 235, 31170),
(1790, 310604, 'สำโรงใหม่', '14.284', '102.850', 235, 31170),
(1791, 310607, 'หนองแวง', '14.268', '102.935', 235, 31170),
(1792, 310610, 'หนองตระครอง', '14.393', '102.787', 235, 31170),
(1793, 310611, 'โคกว่าน', '14.449', '102.784', 235, 31170),
(1794, 310701, 'ประโคนชัย', '14.613', '103.081', 236, 31140),
(1795, 310702, 'แสลงโทน', '14.787', '103.055', 236, 31140),
(1796, 310703, 'บ้านไทร', '14.705', '103.065', 236, 31140),
(1797, 310705, 'ละเวี้ย', '14.599', '103.191', 236, 31140),
(1798, 310706, 'จรเข้มาก', '14.500', '102.989', 236, 31140),
(1799, 310707, 'ปังกู', '14.537', '103.067', 236, 31140),
(1800, 310708, 'โคกย่าง', '14.562', '103.005', 236, 31140),
(1801, 310710, 'โคกม้า', '14.641', '103.035', 236, 31140),
(1802, 310713, 'ไพศาล', '14.662', '103.208', 236, 31140),
(1803, 310714, 'ตะโกตาพิ', '14.638', '102.981', 236, 31140),
(1804, 310715, 'เขาคอก', '14.440', '103.004', 236, 31140),
(1805, 310716, 'หนองบอน', '14.542', '103.143', 236, 31140),
(1806, 310718, 'โคกมะขาม', '14.602', '103.129', 236, 31140),
(1807, 310719, 'โคกตูม', '14.702', '102.989', 236, 31140),
(1808, 310720, 'ประทัดบุ', '14.569', '102.962', 236, 31140),
(1809, 310721, 'สี่เหลี่ยม', '14.750', '103.003', 236, 31140),
(1810, 310801, 'บ้านกรวด', '14.429', '103.077', 237, 31180),
(1811, 310802, 'โนนเจริญ', '14.464', '103.189', 237, 31180),
(1812, 310803, 'หนองไม้งาม', '14.344', '102.997', 237, 31180),
(1813, 310804, 'ปราสาท', '14.362', '103.109', 237, 31180),
(1814, 310805, 'สายตะกู', '14.397', '103.211', 237, 31180),
(1815, 310806, 'หินลาด', '14.473', '103.143', 237, 31180),
(1816, 310807, 'บึงเจริญ', '14.337', '103.037', 237, 31180),
(1817, 310808, 'จันทบเพชร', '14.384', '103.164', 237, 31180),
(1818, 310809, 'เขาดินเหนือ', '14.524', '103.199', 237, 31180),
(1819, 310901, 'พุทไธสง', '15.582', '103.014', 238, 31120),
(1820, 310902, 'มะเฟือง', '15.497', '103.032', 238, 31120),
(1821, 310903, 'บ้านจาน', '15.507', '102.983', 238, 31120),
(1822, 310906, 'บ้านเป้า', '15.627', '102.892', 238, 31120),
(1823, 310907, 'บ้านแวง', '15.580', '102.959', 238, 31120),
(1824, 310909, 'บ้านยาง', '15.463', '103.097', 238, 31120),
(1825, 310910, 'หายโศก', '15.526', '102.937', 238, 31120),
(1826, 311001, 'ลำปลายมาศ', '15.019', '102.834', 239, 31130),
(1827, 311002, 'หนองคู', '14.999', '102.803', 239, 31130),
(1828, 311003, 'แสลงพัน', '14.990', '102.957', 239, 31130),
(1829, 311004, 'ทะเมนชัย', '15.051', '102.945', 239, 31130),
(1830, 311005, 'ตลาดโพธิ์', '15.083', '102.893', 239, 31130),
(1831, 311006, 'หนองกระทิง', '14.974', '102.760', 239, 31130),
(1832, 311007, 'โคกกลาง', '14.949', '102.862', 239, 31130),
(1833, 311008, 'โคกสะอาด', '15.154', '102.902', 239, 31130),
(1834, 311009, 'เมืองแฝก', '15.154', '102.973', 239, 31130),
(1835, 311010, 'บ้านยาง', '14.873', '102.886', 239, 31130),
(1836, 311011, 'ผไทรินทร์', '14.917', '102.777', 239, 31130),
(1837, 311012, 'โคกล่าม', '15.114', '102.839', 239, 31130),
(1838, 311013, 'หินโคน', '15.057', '102.820', 239, 31130),
(1839, 311014, 'หนองบัวโคก', '15.006', '102.889', 239, 31130),
(1840, 311015, 'บุโพธิ์', '15.109', '102.938', 239, 31130),
(1841, 311016, 'หนองโดน', '14.882', '102.824', 239, 31130),
(1842, 311101, 'สตึก', '15.263', '103.301', 240, 31150),
(1843, 311102, 'นิคม', '15.274', '103.225', 240, 31150),
(1844, 311103, 'ทุ่งวัง', '15.259', '103.386', 240, 31150),
(1845, 311104, 'เมืองแก', '15.190', '103.308', 240, 31150),
(1846, 311105, 'หนองใหญ่', '15.131', '103.291', 240, 31150),
(1847, 311106, 'ร่อนทอง', '15.200', '103.244', 240, 31150),
(1848, 311109, 'ดอนมนต์', '15.209', '103.183', 240, 31150),
(1849, 311110, 'ชุมแสง', '15.137', '103.377', 240, 31150),
(1850, 311111, 'ท่าม่วง', '15.300', '103.442', 240, 31150),
(1851, 311112, 'สะแก', '15.300', '103.354', 240, 31150),
(1852, 311114, 'สนามชัย', '15.207', '103.356', 240, 31150),
(1853, 311115, 'กระสัง', '15.195', '103.405', 240, 31150),
(1854, 311201, 'ปะคำ', '14.454', '102.721', 241, 31220),
(1855, 311202, 'ไทยเจริญ', '14.461', '102.683', 241, 31220),
(1856, 311203, 'หนองบัว', '14.432', '102.657', 241, 31220),
(1857, 311204, 'โคกมะม่วง', '14.402', '102.612', 241, 31220),
(1858, 311205, 'หูทำนบ', '14.364', '102.696', 241, 31220),
(1859, 311301, 'นาโพธิ์', '15.635', '102.944', 242, 31230),
(1860, 311302, 'บ้านคู', '15.712', '102.933', 242, 31230),
(1861, 311303, 'บ้านดู่', '15.713', '102.977', 242, 31230),
(1862, 311304, 'ดอนกอก', '15.763', '102.895', 242, 31230),
(1863, 311305, 'ศรีสว่าง', '15.673', '102.934', 242, 31230),
(1864, 311401, 'สระแก้ว', '14.828', '102.681', 243, 31240),
(1865, 311402, 'ห้วยหิน', '14.871', '102.594', 243, 31240),
(1866, 311403, 'ไทยสามัคคี', '14.885', '102.763', 243, 31240),
(1867, 311404, 'หนองชัยศรี', '14.823', '102.645', 243, 31240),
(1868, 311405, 'เสาเดียว', '14.911', '102.609', 243, 31240),
(1869, 311406, 'เมืองฝ้าย', '14.843', '102.741', 243, 31240),
(1870, 311407, 'สระทอง', '14.889', '102.670', 243, 31240),
(1871, 311501, 'จันดุม', '14.678', '103.118', 244, 31250),
(1872, 311502, 'โคกขมิ้น', '14.769', '103.193', 244, 31250),
(1873, 311503, 'ป่าชัน', '14.717', '103.241', 244, 31250),
(1874, 311504, 'สะเดา', '14.722', '103.168', 244, 31250),
(1875, 311505, 'สำโรง', '14.776', '103.111', 244, 31250),
(1876, 311601, 'ห้วยราช', '14.964', '103.183', 245, 31000),
(1877, 311602, 'สามแวง', '15.009', '103.192', 245, 31000),
(1878, 311603, 'ตาเสา', '15.088', '103.285', 245, 31000),
(1879, 311604, 'บ้านตะโก', '14.969', '103.233', 245, 31000),
(1880, 311605, 'สนวน', '14.933', '103.182', 245, 31000),
(1881, 311606, 'โคกเหล็ก', '15.023', '103.230', 245, 31000),
(1882, 311607, 'เมืองโพธิ์', '15.042', '103.268', 245, 31000),
(1883, 311608, 'ห้วยราชา', '14.982', '103.203', 245, 31000),
(1884, 311701, 'โนนสุวรรณ', '14.538', '102.604', 246, 31110),
(1885, 311702, 'ทุ่งจังหัน', '14.566', '102.558', 246, 31110),
(1886, 311703, 'โกรกแก้ว', '14.621', '102.637', 246, 31110),
(1887, 311704, 'ดงอีจาน', '14.546', '102.517', 246, 31110),
(1888, 311801, 'ชำนิ', '14.785', '102.810', 247, 31110),
(1889, 311802, 'หนองปล่อง', '14.743', '102.844', 247, 31110),
(1890, 311803, 'เมืองยาง', '14.794', '102.906', 247, 31110),
(1891, 311804, 'ช่อผกา', '14.809', '102.787', 247, 31110),
(1892, 311805, 'ละลวด', '14.780', '102.745', 247, 31110),
(1893, 311806, 'โคกสนวน', '14.755', '102.888', 247, 31110),
(1894, 311901, 'หนองแวง', '15.553', '102.907', 248, 31120),
(1895, 311902, 'ทองหลาง', '15.608', '102.805', 248, 31120),
(1896, 311903, 'แดงใหญ่', '15.605', '102.857', 248, 31120),
(1897, 311904, 'กู่สวนแตง', '15.534', '102.860', 248, 31120),
(1898, 311905, 'หนองเยือง', '15.555', '102.811', 248, 31120),
(1899, 312001, 'โนนดินแดง', '14.316', '102.721', 249, 31260),
(1900, 312002, 'ส้มป่อย', '14.346', '102.764', 249, 31260),
(1901, 312003, 'ลำนางรอง', '14.213', '102.698', 249, 31260),
(1902, 312101, 'บ้านด่าน', '15.112', '103.162', 250, 31000),
(1903, 312102, 'ปราสาท', '15.081', '103.217', 250, 31000),
(1904, 312103, 'วังเหนือ', '15.138', '103.219', 250, 31000),
(1905, 312104, 'โนนขวาง', '15.191', '103.157', 250, 31000),
(1906, 312201, 'แคนดง', '15.317', '103.123', 251, 31150),
(1907, 312202, 'ดงพลอง', '15.321', '103.172', 251, 31150),
(1908, 312203, 'สระบัว', '15.320', '103.077', 251, 31150),
(1909, 312204, 'หัวฝาย', '15.267', '103.180', 251, 31150),
(1910, 312301, 'เจริญสุข', '14.574', '102.865', 252, 31110),
(1911, 312302, 'ตาเป๊ก', '14.568', '102.924', 252, 31110),
(1912, 312303, 'อีสานเขต', '14.641', '102.931', 252, 31110),
(1913, 312304, 'ถาวร', '14.518', '102.870', 252, 31170),
(1914, 312305, 'ยายแย้มวัฒนา', '14.505', '102.918', 252, 31170),
(1915, 320101, 'ในเมือง', '14.884', '103.490', 253, 32000),
(1916, 320102, 'ตั้งใจ', '15.074', '103.550', 253, 32000),
(1917, 320103, 'เพี้ยราม', '15.067', '103.471', 253, 32000),
(1918, 320104, 'นาดี', '15.024', '103.528', 253, 32000),
(1919, 320105, 'ท่าสว่าง', '14.955', '103.452', 253, 32000),
(1920, 320106, 'สลักได', '14.855', '103.562', 253, 32000),
(1921, 320107, 'ตาอ็อง', '14.748', '103.617', 253, 32000),
(1922, 320109, 'สำโรง', '14.802', '103.627', 253, 32000),
(1923, 320110, 'แกใหญ่', '14.951', '103.513', 253, 32000),
(1924, 320111, 'นอกเมือง', '14.858', '103.491', 253, 32000),
(1925, 320112, 'คอโค', '14.903', '103.425', 253, 32000),
(1926, 320113, 'สวาย', '14.793', '103.337', 253, 32000),
(1927, 320114, 'เฉนียง', '14.796', '103.477', 253, 32000),
(1928, 320116, 'เทนมีย์', '14.774', '103.542', 253, 32000),
(1929, 320118, 'นาบัว', '14.782', '103.412', 253, 32000),
(1930, 320119, 'เมืองที', '14.910', '103.652', 253, 32000),
(1931, 320120, 'ราม', '14.848', '103.650', 253, 32000),
(1932, 320121, 'บุฤาษี', '14.904', '103.597', 253, 32000),
(1933, 320122, 'ตระแสง', '14.855', '103.403', 253, 32000),
(1934, 320125, 'แสลงพันธ์', '14.918', '103.545', 253, 32000),
(1935, 320126, 'กาเกาะ', '15.114', '103.473', 253, 32000),
(1936, 320201, 'ชุมพลบุรี', '15.377', '103.411', 254, 32190),
(1937, 320202, 'นาหนองไผ่', '15.376', '103.487', 254, 32190),
(1938, 320203, 'ไพรขลา', '15.395', '103.556', 254, 32190),
(1939, 320204, 'ศรีณรงค์', '15.373', '103.338', 254, 32190),
(1940, 320205, 'ยะวึก', '15.359', '103.230', 254, 32190),
(1941, 320206, 'เมืองบัว', '15.429', '103.205', 254, 32190),
(1942, 320207, 'สระขุด', '15.440', '103.150', 254, 32190),
(1943, 320208, 'กระเบื้อง', '15.359', '103.291', 254, 32190),
(1944, 320209, 'หนองเรือ', '15.312', '103.557', 254, 32190),
(1945, 320301, 'ท่าตูม', '15.295', '103.639', 255, 32120),
(1946, 320302, 'กระโพ', '15.245', '103.492', 255, 32120),
(1947, 320303, 'พรมเทพ', '15.351', '103.622', 255, 32120),
(1948, 320304, 'โพนครก', '15.401', '103.725', 255, 32120),
(1949, 320305, 'เมืองแก', '15.221', '103.670', 255, 32120),
(1950, 320306, 'บะ', '15.242', '103.569', 255, 32120),
(1951, 320307, 'หนองบัว', '15.327', '103.742', 255, 32120),
(1952, 320308, 'บัวโคก', '15.228', '103.710', 255, 32120),
(1953, 320309, 'หนองเมธี', '15.232', '103.615', 255, 32120),
(1954, 320310, 'ทุ่งกุลา', '15.429', '103.620', 255, 32120),
(1955, 320401, 'จอมพระ', '15.107', '103.599', 256, 32180),
(1956, 320402, 'เมืองลีง', '15.170', '103.465', 256, 32180),
(1957, 320403, 'กระหาด', '15.130', '103.529', 256, 32180),
(1958, 320404, 'บุแกรง', '15.079', '103.683', 256, 32180),
(1959, 320405, 'หนองสนิท', '15.160', '103.655', 256, 32180),
(1960, 320406, 'บ้านผือ', '15.123', '103.682', 256, 32180),
(1961, 320407, 'ลุ่มระวี', '15.162', '103.602', 256, 32180),
(1962, 320408, 'ชุมแสง', '15.178', '103.530', 256, 32180),
(1963, 320409, 'เป็นสุข', '15.136', '103.565', 256, 32180),
(1964, 320501, 'กังแอน', '14.656', '103.406', 257, 32140),
(1965, 320502, 'ทมอ', '14.722', '103.486', 257, 32140),
(1966, 320503, 'ไพล', '14.688', '103.377', 257, 32140),
(1967, 320504, 'ปรือ', '14.645', '103.288', 257, 32140),
(1968, 320505, 'ทุ่งมน', '14.720', '103.282', 257, 32140),
(1969, 320506, 'ตาเบา', '14.615', '103.493', 257, 32140),
(1970, 320507, 'หนองใหญ่', '14.552', '103.462', 257, 32140),
(1971, 320508, 'โคกยาง', '14.673', '103.529', 257, 32140),
(1972, 320509, 'โคกสะอาด', '14.541', '103.373', 257, 32140),
(1973, 320510, 'บ้านไทร', '14.622', '103.602', 257, 32140),
(1974, 320511, 'โชคนาสาม', '14.544', '103.280', 257, 32140),
(1975, 320512, 'เชื้อเพลิง', '14.713', '103.418', 257, 32140),
(1976, 320513, 'ปราสาททนง', '14.652', '103.356', 257, 32140),
(1977, 320514, 'ตานี', '14.617', '103.258', 257, 32140),
(1978, 320515, 'บ้านพลวง', '14.602', '103.408', 257, 32140),
(1979, 320516, 'กันตรวจระมวล', '14.592', '103.557', 257, 32140),
(1980, 320517, 'สมุด', '14.686', '103.339', 257, 32140),
(1981, 320518, 'ประทัดบุ', '14.727', '103.341', 257, 32140),
(1982, 320601, 'กาบเชิง', '14.488', '103.585', 258, 32210),
(1983, 320604, 'คูตัน', '14.533', '103.667', 258, 32210),
(1984, 320605, 'ด่าน', '14.465', '103.709', 258, 32210),
(1985, 320606, 'แนงมุด', '14.397', '103.459', 258, 32210),
(1986, 320607, 'โคกตะเคียน', '14.480', '103.505', 258, 32210),
(1987, 320610, 'ตะเคียน', '14.464', '103.632', 258, 32210),
(1988, 320701, 'รัตนบุรี', '15.311', '103.843', 259, 32130),
(1989, 320702, 'ธาตุ', '15.317', '103.940', 259, 32130),
(1990, 320703, 'แก', '15.355', '103.808', 259, 32130),
(1991, 320704, 'ดอนแรด', '15.369', '104.014', 259, 32130),
(1992, 320705, 'หนองบัวทอง', '15.392', '103.933', 259, 32130),
(1993, 320706, 'หนองบัวบาน', '15.239', '103.826', 259, 32130),
(1994, 320709, 'ไผ่', '15.324', '103.895', 259, 32130),
(1995, 320711, 'เบิด', '15.268', '103.921', 259, 32130),
(1996, 320713, 'น้ำเขียว', '15.316', '103.786', 259, 32130),
(1997, 320714, 'กุดขาคีม', '15.407', '103.846', 259, 32130),
(1998, 320715, 'ยางสว่าง', '15.306', '103.987', 259, 32130),
(1999, 320716, 'ทับใหญ่', '15.410', '103.890', 259, 32130),
(2000, 320801, 'สนม', '15.203', '103.761', 260, 32160),
(2001, 320802, 'โพนโก', '15.251', '103.766', 260, 32160),
(2002, 320803, 'หนองระฆัง', '15.152', '103.755', 260, 32160),
(2003, 320804, 'นานวน', '15.139', '103.793', 260, 32160),
(2004, 320805, 'แคน', '15.170', '103.828', 260, 32160),
(2005, 320806, 'หัวงัว', '15.124', '103.838', 260, 32160),
(2006, 320807, 'หนองอียอ', '15.157', '103.714', 260, 32160),
(2007, 320901, 'ระแงง', '14.898', '103.824', 261, 32110),
(2008, 320902, 'ตรึม', '15.035', '103.845', 261, 32110),
(2009, 320903, 'จารพัต', '14.867', '103.735', 261, 32110),
(2010, 320904, 'ยาง', '14.955', '103.856', 261, 32110),
(2011, 320905, 'แตล', '15.029', '103.710', 261, 32110),
(2012, 320906, 'หนองบัว', '15.083', '103.760', 261, 32110),
(2013, 320907, 'คาละแมะ', '15.081', '103.825', 261, 32110),
(2014, 320908, 'หนองเหล็ก', '14.812', '103.722', 261, 32110),
(2015, 320909, 'หนองขวาว', '14.979', '103.794', 261, 32110),
(2016, 320910, 'ช่างปี่', '14.946', '103.705', 261, 32110),
(2017, 320911, 'กุดหวาย', '14.920', '103.868', 261, 32110),
(2018, 320912, 'ขวาวใหญ่', '15.018', '103.770', 261, 32110),
(2019, 320913, 'นารุ่ง', '14.984', '103.829', 261, 32110),
(2020, 320914, 'ตรมไพร', '14.845', '103.785', 261, 32110),
(2021, 320915, 'ผักไหม', '14.848', '103.830', 261, 32110),
(2022, 321001, 'สังขะ', '14.663', '103.839', 262, 32150),
(2023, 321002, 'ขอนแตก', '14.717', '103.932', 262, 32150),
(2024, 321006, 'ดม', '14.575', '103.856', 262, 32150),
(2025, 321007, 'พระแก้ว', '14.653', '103.954', 262, 32150),
(2026, 321008, 'บ้านจารย์', '14.561', '103.749', 262, 32150),
(2027, 321009, 'กระเทียม', '14.604', '103.673', 262, 32150),
(2028, 321010, 'สะกาด', '14.612', '103.753', 262, 32150),
(2029, 321011, 'ตาตุม', '14.449', '103.779', 262, 32150),
(2030, 321012, 'ทับทัน', '14.676', '103.786', 262, 32150),
(2031, 321013, 'ตาคง', '14.660', '104.034', 262, 32150),
(2032, 321015, 'บ้านชบ', '14.618', '103.849', 262, 32150),
(2033, 321017, 'เทพรักษา', '14.481', '103.868', 262, 32150),
(2034, 321101, 'ลำดวน', '14.702', '103.642', 263, 32220),
(2035, 321102, 'โชคเหนือ', '14.738', '103.721', 263, 32220),
(2036, 321103, 'อู่โลก', '14.684', '103.691', 263, 32220),
(2037, 321104, 'ตรำดม', '14.763', '103.680', 263, 32220),
(2038, 321105, 'ตระเปียงเตีย', '14.751', '103.770', 263, 32220),
(2039, 321201, 'สำโรงทาบ', '14.989', '103.926', 264, 32170),
(2040, 321202, 'หนองไผ่ล้อม', '15.020', '103.905', 264, 32170),
(2041, 321203, 'กระออม', '15.130', '103.968', 264, 32170),
(2042, 321204, 'หนองฮะ', '15.097', '103.911', 264, 32170),
(2043, 321205, 'ศรีสุข', '15.070', '103.949', 264, 32170),
(2044, 321206, 'เกาะแก้ว', '14.958', '103.952', 264, 32170),
(2045, 321207, 'หมื่นศรี', '15.003', '103.968', 264, 32170),
(2046, 321208, 'เสม็จ', '15.092', '103.875', 264, 32170),
(2047, 321209, 'สะโน', '15.066', '103.999', 264, 32170),
(2048, 321210, 'ประดู่', '15.039', '103.952', 264, 32170),
(2049, 321301, 'บัวเชด', '14.527', '103.942', 265, 32230),
(2050, 321302, 'สะเดา', '14.532', '104.014', 265, 32230),
(2051, 321303, 'จรัส', '14.413', '103.976', 265, 32230),
(2052, 321304, 'ตาวัง', '14.609', '104.016', 265, 32230),
(2053, 321305, 'อาโพน', '14.479', '103.921', 265, 32230),
(2054, 321306, 'สำเภาลูน', '14.570', '103.953', 265, 32230),
(2055, 321401, 'บักได', '14.416', '103.350', 266, 32140),
(2056, 321402, 'โคกกลาง', '14.490', '103.249', 266, 32140),
(2057, 321403, 'จีกแดก', '14.497', '103.354', 266, 32140),
(2058, 321404, 'ตาเมียง', '14.386', '103.260', 266, 32140),
(2059, 321501, 'ณรงค์', '14.754', '103.882', 267, 32150),
(2060, 321502, 'แจนแวน', '14.797', '103.922', 267, 32150),
(2061, 321503, 'ตรวจ', '14.802', '103.846', 267, 32150),
(2062, 321504, 'หนองแวง', '14.757', '103.977', 267, 32150),
(2063, 321505, 'ศรีสุข', '14.738', '103.818', 267, 32150),
(2064, 321601, 'เขวาสินรินทร์', '15.009', '103.582', 268, 32000),
(2065, 321602, 'บึง', '15.060', '103.610', 268, 32000),
(2066, 321603, 'ตากูก', '15.026', '103.644', 268, 32000),
(2067, 321604, 'ปราสาททอง', '14.976', '103.648', 268, 32000),
(2068, 321605, 'บ้านแร่', '14.966', '103.576', 268, 32000),
(2069, 321701, 'หนองหลวง', '15.228', '103.927', 269, 32130),
(2070, 321702, 'คำผง', '15.186', '103.942', 269, 32130),
(2071, 321703, 'โนน', '15.173', '103.911', 269, 32130),
(2072, 321704, 'ระเวียง', '15.251', '103.885', 269, 32130),
(2073, 321705, 'หนองเทพ', '15.140', '103.880', 269, 32130),
(2074, 330101, 'เมืองเหนือ', '15.103', '104.336', 270, 33000),
(2075, 330103, 'คูซอด', '15.213', '104.278', 270, 33000),
(2076, 330104, 'ซำ', '15.040', '104.332', 270, 33000),
(2077, 330105, 'จาน', '14.989', '104.398', 270, 33000),
(2078, 330106, 'ตะดอบ', '15.037', '104.434', 270, 33000),
(2079, 330107, 'หนองครก', '15.078', '104.295', 270, 33000),
(2080, 330111, 'โพนข่า', '15.055', '104.385', 270, 33000),
(2081, 330112, 'โพนค้อ', '15.015', '104.369', 270, 33000),
(2082, 330116, 'หญ้าปล้อง', '15.135', '104.293', 270, 33000),
(2083, 330118, 'ทุ่ม', '14.980', '104.336', 270, 33000),
(2084, 330119, 'หนองไฮ', '15.007', '104.427', 270, 33000),
(2085, 330121, 'หนองแก้ว', '15.096', '104.433', 270, 33000),
(2086, 330122, 'น้ำคำ', '15.167', '104.340', 270, 33000),
(2087, 330123, 'โพธิ์', '15.124', '104.394', 270, 33000),
(2088, 330124, 'หมากเขียบ', '15.051', '104.258', 270, 33000),
(2089, 330127, 'หนองไผ่', '15.143', '104.271', 270, 33000),
(2090, 330201, 'ยางชุมน้อย', '15.260', '104.401', 271, 33190),
(2091, 330202, 'ลิ้นฟ้า', '15.180', '104.422', 271, 33190),
(2092, 330203, 'คอนกาม', '15.223', '104.360', 271, 33190),
(2093, 330204, 'โนนคูณ', '15.302', '104.354', 271, 33190),
(2094, 330205, 'กุดเมืองฮาม', '15.235', '104.319', 271, 33190),
(2095, 330206, 'บึงบอน', '15.251', '104.444', 271, 33190),
(2096, 330207, 'ยางชุมใหญ่', '15.212', '104.413', 271, 33190),
(2097, 330301, 'ดูน', '15.113', '104.578', 272, 33130),
(2098, 330302, 'โนนสัง', '15.100', '104.642', 272, 33130),
(2099, 330303, 'หนองหัวช้าง', '15.049', '104.643', 272, 33130),
(2100, 330304, 'ยาง', '15.072', '104.526', 272, 33130),
(2101, 330305, 'หนองแวง', '15.194', '104.658', 272, 33130),
(2102, 330306, 'หนองแก้ว', '15.143', '104.702', 272, 33130),
(2103, 330307, 'ทาม', '15.232', '104.616', 272, 33130),
(2104, 330308, 'ละทาย', '15.182', '104.583', 272, 33130),
(2105, 330309, 'เมืองน้อย', '15.203', '104.547', 272, 33130),
(2106, 330310, 'อีปาด', '15.223', '104.500', 272, 33130),
(2107, 330311, 'บัวน้อย', '15.173', '104.478', 272, 33130),
(2108, 330312, 'หนองบัว', '15.120', '104.525', 272, 33130),
(2109, 330313, 'ดู่', '15.080', '104.476', 272, 33130),
(2110, 330314, 'ผักแพว', '15.034', '104.537', 272, 33130),
(2111, 330315, 'จาน', '14.995', '104.494', 272, 33130),
(2112, 330320, 'คำเนียม', '15.066', '104.583', 272, 33130),
(2113, 330401, 'บึงมะลู', '14.535', '104.714', 273, 33110),
(2114, 330402, 'กุดเสลา', '14.679', '104.833', 273, 33110),
(2115, 330403, 'เมือง', '14.582', '104.670', 273, 33110),
(2116, 330405, 'สังเม็ก', '14.643', '104.729', 273, 33110),
(2117, 330406, 'น้ำอ้อม', '14.660', '104.657', 273, 33110),
(2118, 330407, 'ละลาย', '14.444', '104.547', 273, 33110),
(2119, 330408, 'รุง', '14.480', '104.630', 273, 33110),
(2120, 330409, 'ตระกาจ', '14.712', '104.596', 273, 33110),
(2121, 330411, 'จานใหญ่', '14.724', '104.655', 273, 33110),
(2122, 330412, 'ภูเงิน', '14.745', '104.571', 273, 33110),
(2123, 330413, 'ชำ', '14.543', '104.575', 273, 33110),
(2124, 330414, 'กระแชง', '14.650', '104.566', 273, 33110),
(2125, 330415, 'โนนสำราญ', '14.534', '104.800', 273, 33110),
(2126, 330416, 'หนองหญ้าลาด', '14.654', '104.621', 273, 33110),
(2127, 330419, 'เสาธงชัย', '14.447', '104.685', 273, 33110),
(2128, 330420, 'ขนุน', '14.602', '104.798', 273, 33110),
(2129, 330421, 'สวนกล้วย', '14.682', '104.777', 273, 33110),
(2130, 330423, 'เวียงเหนือ', '14.637', '104.686', 273, 33110),
(2131, 330424, 'ทุ่งใหญ่', '14.590', '104.591', 273, 33110),
(2132, 330425, 'ภูผาหมอก', '14.466', '104.809', 273, 33110),
(2133, 330501, 'กันทรารมย์', '14.717', '104.070', 274, 33140),
(2134, 330502, 'จะกง', '14.821', '104.253', 274, 33140),
(2135, 330503, 'ใจดี', '14.753', '104.150', 274, 33140),
(2136, 330504, 'ดองกำเม็ด', '14.775', '104.186', 274, 33140),
(2137, 330505, 'โสน', '14.657', '104.104', 274, 33140),
(2138, 330506, 'ปรือใหญ่', '14.601', '104.246', 274, 33140),
(2139, 330507, 'สะเดาใหญ่', '14.712', '104.268', 274, 33140),
(2140, 330508, 'ตาอุด', '14.669', '104.271', 274, 33140),
(2141, 330509, 'ห้วยเหนือ', '14.720', '104.205', 274, 33140),
(2142, 330510, 'ห้วยใต้', '14.662', '104.179', 274, 33140),
(2143, 330511, 'หัวเสือ', '14.834', '104.186', 274, 33140),
(2144, 330513, 'ตะเคียน', '14.773', '104.248', 274, 33140),
(2145, 330515, 'นิคมพัฒนา', '14.644', '104.234', 274, 33140),
(2146, 330517, 'โคกเพชร', '14.804', '104.149', 274, 33140),
(2147, 330518, 'ปราสาท', '14.727', '104.016', 274, 33140),
(2148, 330521, 'สำโรงตาเจ็น', '14.872', '104.170', 274, 33140),
(2149, 330522, 'ห้วยสำราญ', '14.715', '104.115', 274, 33140),
(2150, 330524, 'กฤษณา', '14.874', '104.255', 274, 33140),
(2151, 330525, 'ลมศักดิ์', '14.762', '104.283', 274, 33140),
(2152, 330526, 'หนองฉลอง', '14.684', '104.227', 274, 33140),
(2153, 330527, 'ศรีตระกูล', '14.639', '104.280', 274, 33140),
(2154, 330528, 'ศรีสะอาด', '14.754', '104.102', 274, 33140),
(2155, 330601, 'ไพรบึง', '14.744', '104.373', 275, 33180),
(2156, 330602, 'ดินแดง', '14.801', '104.308', 275, 33180),
(2157, 330603, 'ปราสาทเยอ', '14.811', '104.364', 275, 33180),
(2158, 330604, 'สำโรงพลัน', '14.700', '104.342', 275, 33180),
(2159, 330605, 'สุขสวัสดิ์', '14.856', '104.359', 275, 33180),
(2160, 330606, 'โนนปูน', '14.857', '104.303', 275, 33180),
(2161, 330701, 'พิมาย', '14.835', '104.032', 276, 33170),
(2162, 330702, 'กู่', '14.853', '103.957', 276, 33170),
(2163, 330703, 'หนองเชียงทูน', '14.875', '104.101', 276, 33170),
(2164, 330704, 'ตูม', '14.903', '104.009', 276, 33170),
(2165, 330705, 'สมอ', '14.820', '104.094', 276, 33170),
(2166, 330706, 'โพธิ์ศรี', '14.780', '104.082', 276, 33170),
(2167, 330707, 'สำโรงปราสาท', '14.917', '104.081', 276, 33170),
(2168, 330708, 'ดู่', '14.782', '104.027', 276, 33170),
(2169, 330709, 'สวาย', '14.913', '103.962', 276, 33170),
(2170, 330710, 'พิมายเหนือ', '14.881', '104.042', 276, 33170),
(2171, 330801, 'สิ', '14.625', '104.436', 277, 33150),
(2172, 330802, 'บักดอง', '14.476', '104.444', 277, 33150),
(2173, 330803, 'พราน', '14.592', '104.501', 277, 33150),
(2174, 330804, 'โพธิ์วงศ์', '14.666', '104.458', 277, 33150),
(2175, 330805, 'ไพร', '14.706', '104.454', 277, 33150),
(2176, 330806, 'กระหวัน', '14.673', '104.414', 277, 33150),
(2177, 330807, 'ขุนหาญ', '14.635', '104.371', 277, 33150),
(2178, 330808, 'โนนสูง', '14.581', '104.416', 277, 33150),
(2179, 330809, 'กันทรอม', '14.575', '104.353', 277, 33150),
(2180, 330810, 'ภูฝ้าย', '14.683', '104.510', 277, 33150),
(2181, 330811, 'โพธิ์กระสังข์', '14.628', '104.327', 277, 33150),
(2182, 330812, 'ห้วยจันทร์', '14.465', '104.353', 277, 33150),
(2183, 330901, 'เมืองคง', '15.356', '104.159', 278, 33160),
(2184, 330902, 'เมืองแคน', '15.351', '104.214', 278, 33160),
(2185, 330903, 'หนองแค', '15.380', '104.106', 278, 33160),
(2186, 330906, 'จิกสังข์ทอง', '15.435', '104.125', 278, 33160),
(2187, 330907, 'ด่าน', '15.421', '104.026', 278, 33160),
(2188, 330908, 'ดู่', '15.416', '104.162', 278, 33160),
(2189, 330909, 'หนองอึ่ง', '15.278', '104.176', 278, 33160),
(2190, 330910, 'บัวหุ่ง', '15.321', '104.105', 278, 33160),
(2191, 330911, 'ไผ่', '15.332', '104.257', 278, 33160),
(2192, 330912, 'ส้มป่อย', '15.283', '104.232', 278, 33160),
(2193, 330913, 'หนองหมี', '15.271', '104.293', 278, 33160),
(2194, 330914, 'หว้านคำ', '15.407', '104.200', 278, 33160),
(2195, 330915, 'สร้างปี่', '15.317', '104.305', 278, 33160),
(2196, 331001, 'กำแพง', '15.100', '104.150', 279, 33120),
(2197, 331002, 'อี่หล่ำ', '15.198', '104.188', 279, 33120),
(2198, 331003, 'ก้านเหลือง', '15.052', '104.143', 279, 33120),
(2199, 331004, 'ทุ่งไชย', '15.016', '104.109', 279, 33120),
(2200, 331005, 'สำโรง', '15.146', '104.148', 279, 33120),
(2201, 331006, 'แขม', '15.198', '104.140', 279, 33120),
(2202, 331007, 'หนองไฮ', '15.145', '104.093', 279, 33120),
(2203, 331008, 'ขะยูง', '15.126', '104.238', 279, 33120),
(2204, 331010, 'ตาเกษ', '15.143', '104.210', 279, 33120),
(2205, 331011, 'หัวช้าง', '15.251', '104.132', 279, 33120),
(2206, 331012, 'รังแร้ง', '15.223', '104.228', 279, 33120),
(2207, 331014, 'แต้', '15.120', '104.178', 279, 33120),
(2208, 331015, 'แข้', '15.067', '104.176', 279, 33120),
(2209, 331016, 'โพธิ์ชัย', '15.173', '104.227', 279, 33120),
(2210, 331017, 'ปะอาว', '15.101', '104.214', 279, 33120),
(2211, 331018, 'หนองห้าง', '15.098', '104.088', 279, 33120),
(2212, 331022, 'สระกำแพงใหญ่', '15.093', '104.128', 279, 33120),
(2213, 331024, 'โคกหล่าม', '15.220', '104.171', 279, 33120),
(2214, 331025, 'โคกจาน', '14.966', '104.104', 279, 33120),
(2215, 331101, 'เป๊าะ', '15.297', '104.060', 280, 33220),
(2216, 331102, 'บึงบูรพ์', '15.328', '104.067', 280, 33220),
(2217, 331201, 'ห้วยทับทัน', '15.065', '104.044', 281, 33210),
(2218, 331202, 'เมืองหลวง', '15.021', '104.047', 281, 33210),
(2219, 331203, 'กล้วยกว้าง', '14.966', '104.069', 281, 33210),
(2220, 331204, 'ผักไหม', '14.947', '104.013', 281, 33210),
(2221, 331205, 'จานแสนไชย', '14.981', '104.019', 281, 33210),
(2222, 331206, 'ปราสาท', '15.110', '104.027', 281, 33210),
(2223, 331301, 'โนนค้อ', '14.899', '104.710', 282, 33250),
(2224, 331302, 'บก', '14.976', '104.640', 282, 33250),
(2225, 331303, 'โพธิ์', '14.923', '104.614', 282, 33250),
(2226, 331304, 'หนองกุง', '14.861', '104.774', 282, 33250),
(2227, 331305, 'เหล่ากวาง', '14.880', '104.638', 282, 33250),
(2228, 331401, 'ศรีแก้ว', '14.766', '104.476', 283, 33240),
(2229, 331402, 'พิงพวย', '14.744', '104.453', 283, 33240),
(2230, 331403, 'สระเยาว์', '14.785', '104.515', 283, 33240),
(2231, 331404, 'ตูม', '14.866', '104.488', 283, 33240),
(2232, 331405, 'เสืองข้าว', '14.813', '104.555', 283, 33240),
(2233, 331406, 'ศรีโนนงาม', '14.806', '104.419', 283, 33240),
(2234, 331407, 'สะพุง', '14.828', '104.474', 283, 33240),
(2235, 331501, 'น้ำเกลี้ยง', '14.917', '104.550', 284, 33130),
(2236, 331502, 'ละเอาะ', '14.930', '104.451', 284, 33130),
(2237, 331503, 'ตองปิด', '14.964', '104.479', 284, 33130),
(2238, 331504, 'เขิน', '14.852', '104.580', 284, 33130),
(2239, 331505, 'รุ่งระวี', '14.876', '104.525', 284, 33130),
(2240, 331506, 'คูบ', '14.971', '104.569', 284, 33130),
(2241, 331601, 'บุสูง', '14.957', '104.209', 285, 33270),
(2242, 331602, 'ธาตุ', '14.988', '104.186', 285, 33270),
(2243, 331603, 'ดวนใหญ่', '14.945', '104.271', 285, 33270),
(2244, 331604, 'บ่อแก้ว', '14.992', '104.270', 285, 33270),
(2245, 331605, 'ศรีสำราญ', '14.909', '104.155', 285, 33270),
(2246, 331606, 'ทุ่งสว่าง', '15.018', '104.224', 285, 33270),
(2247, 331607, 'วังหิน', '14.920', '104.240', 285, 33270),
(2248, 331608, 'โพนยาง', '14.926', '104.204', 285, 33270),
(2249, 331701, 'โคกตาล', '14.549', '104.203', 286, 33140),
(2250, 331702, 'ห้วยตามอญ', '14.525', '104.077', 286, 33140),
(2251, 331703, 'ห้วยตึ๊กชู', '14.566', '104.120', 286, 33140),
(2252, 331704, 'ละลม', '14.588', '104.079', 286, 33140),
(2253, 331705, 'ตะเคียนราม', '14.606', '104.169', 286, 33140),
(2254, 331706, 'ดงรัก', '14.440', '104.189', 286, 33140),
(2255, 331707, 'ไพรพัฒนา', '14.426', '104.085', 286, 33140),
(2256, 331801, 'เมืองจันทร์', '15.155', '104.011', 287, 33120),
(2257, 331802, 'ตาโกน', '15.205', '103.996', 287, 33120),
(2258, 331803, 'หนองใหญ่', '15.198', '104.035', 287, 33120),
(2259, 331901, 'เสียว', '14.799', '104.668', 288, 33110),
(2260, 331902, 'หนองหว้า', '14.754', '104.722', 288, 33110),
(2261, 331903, 'หนองงูเหลือม', '14.836', '104.653', 288, 33110),
(2262, 331904, 'หนองฮาง', '14.778', '104.594', 288, 33110),
(2263, 331905, 'ท่าคล้อ', '14.761', '104.783', 288, 33110),
(2264, 332001, 'พยุห์', '14.935', '104.387', 289, 33230),
(2265, 332002, 'พรหมสวัสดิ์', '14.852', '104.427', 289, 33230),
(2266, 332003, 'ตำแย', '14.918', '104.422', 289, 33230),
(2267, 332004, 'โนนเพ็ก', '14.933', '104.327', 289, 33230),
(2268, 332005, 'หนองค้า', '14.898', '104.334', 289, 33230),
(2269, 332101, 'โดด', '15.204', '104.078', 290, 33120),
(2270, 332102, 'เสียว', '15.251', '104.043', 290, 33120),
(2271, 332103, 'หนองม้า', '15.254', '104.083', 290, 33120),
(2272, 332104, 'ผือใหญ่', '15.233', '104.111', 290, 33120),
(2273, 332105, 'อีเซ', '15.269', '104.009', 290, 33120),
(2274, 332201, 'กุง', '15.474', '104.084', 291, 33160),
(2275, 332202, 'คลีกลิ้ง', '15.529', '104.109', 291, 33160),
(2276, 332203, 'หนองบัวดง', '15.458', '104.046', 291, 33160),
(2277, 332204, 'โจดม่วง', '15.473', '104.139', 291, 33160),
(2278, 340101, 'ในเมือง', '15.232', '104.859', 292, 34000),
(2279, 340104, 'หัวเรือ', '15.367', '104.845', 292, 34000),
(2280, 340105, 'หนองขอน', '15.320', '104.766', 292, 34000),
(2281, 340107, 'ปทุม', '15.244', '104.894', 292, 34000),
(2282, 340108, 'ขามใหญ่', '15.302', '104.836', 292, 34000),
(2283, 340109, 'แจระแม', '15.251', '104.802', 292, 34000),
(2284, 340111, 'หนองบ่อ', '15.239', '104.727', 292, 34000),
(2285, 340112, 'ไร่น้อย', '15.314', '104.905', 292, 34000),
(2286, 340113, 'กระโสบ', '15.309', '104.970', 292, 34000),
(2287, 340116, 'กุดลาด', '15.291', '105.000', 292, 34000),
(2288, 340119, 'ขี้เหล็ก', '15.351', '104.815', 292, 34000),
(2289, 340120, 'ปะอาว', '15.365', '104.716', 292, 34000),
(2290, 340201, 'นาคำ', '15.507', '105.327', 293, 34250),
(2291, 340202, 'แก้งกอก', '15.478', '105.237', 293, 34250),
(2292, 340203, 'เอือดใหญ่', '15.520', '105.219', 293, 34250),
(2293, 340204, 'วาริน', '15.415', '105.260', 293, 34250),
(2294, 340205, 'ลาดควาย', '15.564', '105.329', 293, 34250),
(2295, 340206, 'สงยาง', '15.623', '105.286', 293, 34250),
(2296, 340207, 'ตะบ่าย', '15.560', '105.227', 293, 34250),
(2297, 340208, 'คำไหล', '15.409', '105.346', 293, 34250),
(2298, 340209, 'หนามแท่ง', '15.695', '105.565', 293, 34250),
(2299, 340210, 'นาเลิน', '15.607', '105.383', 293, 34250),
(2300, 340211, 'ดอนใหญ่', '15.447', '105.316', 293, 34250),
(2301, 340301, 'โขงเจียม', '15.296', '105.452', 294, 34220),
(2302, 340302, 'ห้วยยาง', '15.467', '105.455', 294, 34220),
(2303, 340303, 'นาโพธิ์กลาง', '15.553', '105.557', 294, 34220),
(2304, 340304, 'หนองแสงใหญ่', '15.339', '105.389', 294, 34220),
(2305, 340305, 'ห้วยไผ่', '15.420', '105.551', 294, 34220),
(2306, 340401, 'เขื่องใน', '15.371', '104.556', 295, 34150),
(2307, 340402, 'สร้างถ่อ', '15.367', '104.503', 295, 34150),
(2308, 340403, 'ค้อทอง', '15.399', '104.429', 295, 34150),
(2309, 340404, 'ก่อเอ้', '15.392', '104.623', 295, 34150),
(2310, 340405, 'หัวดอน', '15.307', '104.690', 295, 34150),
(2311, 340406, 'ชีทวน', '15.269', '104.653', 295, 34150),
(2312, 340407, 'ท่าไห', '15.319', '104.602', 295, 34150),
(2313, 340408, 'นาคำใหญ่', '15.283', '104.566', 295, 34150),
(2314, 340409, 'แดงหม้อ', '15.290', '104.513', 295, 34150),
(2315, 340410, 'ธาตุน้อย', '15.281', '104.480', 295, 34150),
(2316, 340411, 'บ้านไทย', '15.454', '104.424', 295, 34320),
(2317, 340412, 'บ้านกอก', '15.489', '104.464', 295, 34320),
(2318, 340413, 'กลางใหญ่', '15.515', '104.407', 295, 34320),
(2319, 340414, 'โนนรัง', '15.521', '104.500', 295, 34320),
(2320, 340415, 'ยางขี้นก', '15.446', '104.508', 295, 34150),
(2321, 340416, 'ศรีสุข', '15.477', '104.515', 295, 34150),
(2322, 340417, 'สหธาตุ', '15.338', '104.459', 295, 34150),
(2323, 340418, 'หนองเหล่า', '15.453', '104.592', 295, 34150),
(2324, 340501, 'เขมราฐ', '16.049', '105.136', 296, 34170),
(2325, 340503, 'ขามป้อม', '15.977', '105.179', 296, 34170),
(2326, 340504, 'เจียด', '15.872', '105.222', 296, 34170),
(2327, 340507, 'หนองผือ', '15.950', '105.058', 296, 34170),
(2328, 340508, 'นาแวง', '16.011', '105.329', 296, 34170),
(2329, 340510, 'แก้งเหนือ', '15.932', '105.128', 296, 34170),
(2330, 340511, 'หนองนกทา', '16.019', '105.096', 296, 34170),
(2331, 340512, 'หนองสิม', '16.025', '105.037', 296, 34170),
(2332, 340513, 'หัวนา', '15.867', '105.155', 296, 34170),
(2333, 340701, 'เมืองเดช', '14.920', '105.055', 297, 34160),
(2334, 340702, 'นาส่วง', '15.012', '104.983', 297, 34160),
(2335, 340704, 'นาเจริญ', '14.902', '104.955', 297, 34160),
(2336, 340706, 'ทุ่งเทิง', '14.819', '104.846', 297, 34160),
(2337, 340708, 'สมสะอาด', '14.824', '104.987', 297, 34160),
(2338, 340709, 'กุดประทาย', '14.966', '105.196', 297, 34160),
(2339, 340710, 'ตบหู', '14.702', '105.090', 297, 34160),
(2340, 340711, 'กลาง', '14.797', '105.141', 297, 34160),
(2341, 340712, 'แก้ง', '14.695', '105.014', 297, 34160),
(2342, 340713, 'ท่าโพธิ์ศรี', '14.840', '105.049', 297, 34160),
(2343, 340715, 'บัวงาม', '14.801', '105.218', 297, 34160),
(2344, 340716, 'คำครั่ง', '14.889', '105.205', 297, 34160),
(2345, 340717, 'นากระแซง', '14.870', '104.908', 297, 34160),
(2346, 340720, 'โพนงาม', '14.904', '105.115', 297, 34160),
(2347, 340721, 'ป่าโมง', '14.961', '104.976', 297, 34160),
(2348, 340723, 'โนนสมบูรณ์', '14.760', '105.030', 297, 34160),
(2349, 340801, 'นาจะหลวย', '14.487', '105.261', 298, 34280),
(2350, 340802, 'โนนสมบูรณ์', '14.688', '105.201', 298, 34280),
(2351, 340803, 'พรสวรรค์', '14.627', '105.180', 298, 34280);

-- --------------------------------------------------------

--
-- Table structure for table `db-user`
--

CREATE TABLE `db-user` (
  `UFID` int(11) NOT NULL,
  `Title` enum('1','2','3') NOT NULL,
  `FirstName` varchar(25) NOT NULL,
  `LastName` varchar(30) NOT NULL,
  `UserName` varchar(25) NOT NULL,
  `PWD` varchar(255) NOT NULL,
  `Icon` varchar(4) NOT NULL,
  `EMAIL` varchar(50) NOT NULL,
  `ETID` int(11) NOT NULL,
  `DID` int(11) NOT NULL,
  `IsAdmin` tinyint(1) NOT NULL DEFAULT '0',
  `IsResearch` tinyint(1) NOT NULL DEFAULT '0',
  `IsOperator` tinyint(1) NOT NULL DEFAULT '0',
  `IsFarmer` tinyint(1) NOT NULL DEFAULT '0',
  `IsBlock` tinyint(1) DEFAULT NULL,
  `ModifyDT` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-user`
--

INSERT INTO `db-user` (`UFID`, `Title`, `FirstName`, `LastName`, `UserName`, `PWD`, `Icon`, `EMAIL`, `ETID`, `DID`, `IsAdmin`, `IsResearch`, `IsOperator`, `IsFarmer`, `IsBlock`, `ModifyDT`) VALUES
(1, '1', 'โสภณ', 'โตใหญ่', 'sopon', '112fa4d3ce74374c71b97bf4f9aadc3a', 'jpg', 'sopon0714', 1, 1, 1, 1, 0, 0, 0, '2019-10-16 04:16:49');

-- --------------------------------------------------------

--
-- Table structure for table `department`
--

CREATE TABLE `department` (
  `d-id` int(11) NOT NULL,
  `d-name` varchar(50) CHARACTER SET utf8 NOT NULL,
  `d-alias` varchar(10) CHARACTER SET utf8 NOT NULL,
  `d-note` varchar(150) CHARACTER SET utf8 DEFAULT NULL,
  `d-is-delete` int(11) NOT NULL DEFAULT '0',
  `d-time-remark` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `department`
--

INSERT INTO `department` (`d-id`, `d-name`, `d-alias`, `d-note`, `d-is-delete`, `d-time-remark`) VALUES
(1, 'ศูนย์เทคโนโลยีชีวภาพเกษตร', 'CAB', 'ทีมนักวิจัย', 0, 1557569743),
(2, 'ภาควิชาวิศวกรรมคอมพิวเตอร์', 'CPE', 'ทีมพัฒนาระบบ', 0, 1557563250),
(3, 'ซีพีไอ อะโกรเทค', 'CPI', '', 0, 1557647397),
(16, 'test', 'test', '', 1, 1557651998),
(17, 'test', 'test', '', 0, 1557652010);

-- --------------------------------------------------------

--
-- Table structure for table `event`
--

CREATE TABLE `event` (
  `idEvent` int(11) NOT NULL,
  `date` datetime DEFAULT NULL,
  `name` varchar(45) DEFAULT NULL,
  `detail` varchar(45) DEFAULT NULL,
  `Farmer_idFarmer` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `event`
--

INSERT INTO `event` (`idEvent`, `date`, `name`, `detail`, `Farmer_idFarmer`) VALUES
(1, '2019-05-30 08:00:00', '0', '0', 1),
(2, '2019-05-30 12:00:00', '1', '1', 1);

-- --------------------------------------------------------

--
-- Table structure for table `farmer`
--

CREATE TABLE `farmer` (
  `idFarmer` int(11) NOT NULL,
  `username` varchar(100) DEFAULT NULL,
  `password` varchar(100) DEFAULT NULL,
  `Fname` varchar(45) DEFAULT NULL,
  `Lname` varchar(45) DEFAULT NULL,
  `idCard` varchar(20) DEFAULT NULL,
  `amphoe` text,
  `province` text,
  `address` text,
  `city` varchar(45) DEFAULT NULL,
  `PhoneNumber` varchar(15) DEFAULT NULL,
  `Image` varchar(100) DEFAULT NULL,
  `url` varchar(100) DEFAULT NULL,
  `status` int(1) DEFAULT NULL,
  `status_del` int(3) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `farmer`
--

INSERT INTO `farmer` (`idFarmer`, `username`, `password`, `Fname`, `Lname`, `idCard`, `amphoe`, `province`, `address`, `city`, `PhoneNumber`, `Image`, `url`, `status`, `status_del`) VALUES
(1, NULL, NULL, 'บรรยาวัชร', 'มาวัชระ', '1235467891111', 'บางบัวทอง', 'นนทบุรี', 'พิมลราข', 'Nonthaburi', 'null', '0', 'null', 1, 1),
(2, NULL, NULL, 'ธารินทร์', 'ตันตะโยธิน', '1235467892222', 'บางจาก', 'กรุงเทพ', 'Phimon Rat, Bang Bua Thong, Nonthaburi, 11110', 'Nonthaburi', '01', '0', '0', 1, 1),
(3, NULL, NULL, 'ไลอ้อน', 'คิง', '1235467893333', 'บางคอแหลม', 'สมุทรปราการ', 'Phimon Rat, Bang Bua Thong, Nonthaburi, 11110', 'Nonthaburi', '0', '0', '0', 1, 1),
(4, NULL, NULL, 'นัทส์', 'นัทนัท', '1235467894444', 'เมือง', 'นครปฐม', 'พิมลราข', 'Nonthaburi', NULL, '0', NULL, 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `fertilizer`
--

CREATE TABLE `fertilizer` (
  `F_ID` int(11) NOT NULL,
  `F_NAME` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `F_ICON` int(2) DEFAULT NULL,
  `F_DATE_START` varchar(5) COLLATE utf8_unicode_ci DEFAULT NULL,
  `F_DATE_END` varchar(5) COLLATE utf8_unicode_ci DEFAULT NULL,
  `F_COND` int(3) DEFAULT NULL,
  `F_EQ1` int(11) DEFAULT NULL,
  `F_EQ2` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `fertilizerreport`
--

CREATE TABLE `fertilizerreport` (
  `idFertilizerReport` int(11) NOT NULL,
  `Fertilizer` varchar(45) DEFAULT NULL,
  `date` datetime DEFAULT NULL,
  `volume` int(11) DEFAULT NULL,
  `datereport` datetime NOT NULL,
  `Farmer_idFarmer` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `harvestreport`
--

CREATE TABLE `harvestreport` (
  `idHarvestReport` int(11) NOT NULL,
  `date` datetime DEFAULT NULL,
  `number` int(11) DEFAULT NULL,
  `numToMoney` int(11) DEFAULT NULL,
  `money` int(11) DEFAULT NULL,
  `datereport` datetime NOT NULL,
  `Farmer_idFarmer` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `imagebugreport`
--

CREATE TABLE `imagebugreport` (
  `idImageBug` int(11) NOT NULL,
  `image` varchar(45) DEFAULT NULL,
  `url` varchar(100) NOT NULL,
  `Bug_idBug` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `imagefertilizerreport`
--

CREATE TABLE `imagefertilizerreport` (
  `idImageFertilizer` int(11) NOT NULL,
  `Image` varchar(45) DEFAULT NULL,
  `url` varchar(100) NOT NULL,
  `FertilizerReport_idFertilizerReport` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `imageharvestreport`
--

CREATE TABLE `imageharvestreport` (
  `idImageHarvest` int(11) NOT NULL,
  `url` varchar(100) NOT NULL,
  `image` varchar(45) DEFAULT NULL,
  `HarvestReport_idHarvestReport` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `imageplantdiseases`
--

CREATE TABLE `imageplantdiseases` (
  `idImagePlantDiseases` int(11) NOT NULL,
  `image` varchar(45) DEFAULT NULL,
  `url` varchar(100) NOT NULL,
  `PlantDiseases_idPlantDiseases` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `main-menu-list`
--

CREATE TABLE `main-menu-list` (
  `ut-id` int(11) NOT NULL,
  `mm-mainmenu` int(11) NOT NULL,
  `mm-submenu` int(11) NOT NULL DEFAULT '0',
  `wm-id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `main-menu-list`
--

INSERT INTO `main-menu-list` (`ut-id`, `mm-mainmenu`, `mm-submenu`, `wm-id`) VALUES
(1, 6, 0, 1),
(2, 4, 0, 1),
(3, 8, 0, 1),
(4, 8, 0, 1),
(1, 1, 0, 2),
(2, 1, 0, 2),
(3, 1, 0, 2),
(4, 1, 0, 2),
(1, 2, 0, 3),
(1, 2, 1, 4),
(1, 2, 2, 5),
(1, 3, 0, 6),
(1, 4, 0, 7),
(1, 5, 0, 8),
(1, 5, 1, 9),
(1, 5, 2, 10),
(1, 5, 3, 11),
(1, 5, 4, 12),
(2, 2, 0, 13),
(3, 2, 0, 13),
(4, 2, 0, 13),
(2, 3, 0, 14),
(3, 3, 0, 14),
(4, 3, 0, 14),
(3, 4, 0, 15),
(4, 4, 0, 15),
(3, 5, 0, 16),
(4, 5, 0, 16),
(3, 6, 0, 17),
(4, 6, 0, 17),
(3, 7, 0, 18),
(4, 7, 0, 18),
(3, 7, 1, 19),
(4, 7, 1, 19),
(3, 7, 2, 20),
(4, 7, 2, 20),
(3, 7, 3, 21),
(4, 7, 3, 21),
(3, 7, 4, 22),
(4, 7, 4, 22),
(3, 7, 5, 23),
(4, 7, 5, 23);

-- --------------------------------------------------------

--
-- Table structure for table `makepalm`
--

CREATE TABLE `makepalm` (
  `idMakePalm` int(11) NOT NULL,
  `Lat` varchar(45) DEFAULT NULL,
  `Long` varchar(45) DEFAULT NULL,
  `AddressPlam_idAddressPlam` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `palmplanting`
--

CREATE TABLE `palmplanting` (
  `id_planting` int(11) NOT NULL,
  `date_planting` date DEFAULT NULL,
  `num_planting` int(11) DEFAULT NULL,
  `total_planting` int(11) DEFAULT NULL,
  `type_planting` int(2) DEFAULT NULL,
  `idAddressPlam` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='NO use';

--
-- Dumping data for table `palmplanting`
--

INSERT INTO `palmplanting` (`id_planting`, `date_planting`, `num_planting`, `total_planting`, `type_planting`, `idAddressPlam`) VALUES
(1, '2019-06-01', 10, 10, 0, 1);

-- --------------------------------------------------------

--
-- Table structure for table `palmproduct`
--

CREATE TABLE `palmproduct` (
  `id_palmproduct` int(11) NOT NULL,
  `kg_palmproduct` int(11) DEFAULT NULL,
  `income_palmproduct` int(11) DEFAULT NULL,
  `idFarmer` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `palmtobugreport`
--

CREATE TABLE `palmtobugreport` (
  `idPalmToBug` int(11) NOT NULL,
  `Bug_idBug` int(11) NOT NULL,
  `AddressPlam_idAddressPlam` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `palmtocarwaterreport`
--

CREATE TABLE `palmtocarwaterreport` (
  `idPalmToCarWater` int(11) NOT NULL,
  `CarWaterReport_idCarWaterReport` int(11) NOT NULL,
  `AddressPlam_idAddressPlam` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `palmtocutleafreport`
--

CREATE TABLE `palmtocutleafreport` (
  `idPalmToCutLeaf` int(11) NOT NULL,
  `CutLeafReport_idCutLeafReport` int(11) NOT NULL,
  `AddressPlam_idAddressPlam` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `palmtofertilizerreport`
--

CREATE TABLE `palmtofertilizerreport` (
  `idPalmToFertilizer` int(11) NOT NULL,
  `FertilizerReport_idFertilizerReport` int(11) NOT NULL,
  `AddressPlam_idAddressPlam` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `palmtoharvestreport`
--

CREATE TABLE `palmtoharvestreport` (
  `idPalmToHarvest` int(11) NOT NULL,
  `AddressPlam_idAddressPlam` int(11) NOT NULL,
  `HarvestReport_idHarvestReport` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `palmtoplantdiseases`
--

CREATE TABLE `palmtoplantdiseases` (
  `idPalmToPlantDiseases` int(11) NOT NULL,
  `AddressPlam_idAddressPlam` int(11) NOT NULL,
  `PlantDiseases_idPlantDiseases` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `palmtowaterreport`
--

CREATE TABLE `palmtowaterreport` (
  `idPalmToWater` int(11) NOT NULL,
  `WaterReport_idWaterReport` int(11) NOT NULL,
  `AddressPlam_idAddressPlam` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `palmtoweedreport`
--

CREATE TABLE `palmtoweedreport` (
  `idPalmToWeedReport` int(11) NOT NULL,
  `WeedReport_idWeed` int(11) NOT NULL,
  `AddressPlam_idAddressPlam` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `pest_lists`
--

CREATE TABLE `pest_lists` (
  `PL_ID` int(11) NOT NULL,
  `PL_NAME` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `PL_NAME_OFFICE` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `PT_ID` int(11) DEFAULT NULL,
  `PL_CHAR` text COLLATE utf8_unicode_ci,
  `PL_DANGER` text COLLATE utf8_unicode_ci,
  `PL_IS_LOGO` int(4) DEFAULT NULL,
  `PL_PIC_CHAR` int(4) DEFAULT NULL,
  `PL_PIC_DANGER` int(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `pest_lists`
--

INSERT INTO `pest_lists` (`PL_ID`, `PL_NAME`, `PL_NAME_OFFICE`, `PT_ID`, `PL_CHAR`, `PL_DANGER`, `PL_IS_LOGO`, `PL_PIC_CHAR`, `PL_PIC_DANGER`) VALUES
(17, 'bug1', 'bug1', 1, 'bug1', 'bug1', 1, 2, 2),
(19, 'roi1', 'roi1', 2, 'roi1', 'roi1', 1, 1, 1),
(20, 'roi2', 'roi2', 2, 'roi2', 'roi2', 1, 1, 1),
(21, 'ด้วงแรด', 'Coconut Rhinoceros Beetle', 1, '', 'ตัวเต็มวัยบินขึ้นไปกัดเจาะโคนทางใบ ทำให้ทางใบหักง่าย และกัดเจาะทำลายยอดอ่อน ทำให้ทางใบที่เกิดใหม่ไม่สมบูรณ์มีรอยขาดแหว่งเป็นริ้ว ๆ คล้ายรูปสามเหลี่ยม ถ้าโดนทำลายมาก ๆ ทำให้ใบที่เกิดใหม่แคระแกรน รอยแผลที่ถูกด้วงแรดกัดเป็นเนื้อเยื่ออ่อน ทำให้ด้วงงวงมะพร้าวเข้ามาวางไข่ หรือเป็นทางให้เกิดโรคยอดเน่า จนถึงต้นตายได้ในที่สุด', 1, 1, 2),
(22, 'roi3', 'roi3', 2, 'roi3', 'roi3', 1, 2, 2),
(29, 'weed01', 'weed01', 3, 'weed01', 'weed01', 1, 2, 2),
(30, 'weed02', 'weed02', 3, 'weed02', 'weed02', 1, 2, 2),
(31, 'other01', 'other01', 4, 'other01', 'other01', 1, 2, 2),
(32, 'other02', 'other02', 4, 'other02', 'other02', 1, 2, 2);

-- --------------------------------------------------------

--
-- Table structure for table `pest_type`
--

CREATE TABLE `pest_type` (
  `PT_ID` int(11) NOT NULL,
  `PT_NAME` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `PT_NAME_ENG` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `PT_NOTE` text COLLATE utf8_unicode_ci
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `pest_type`
--

INSERT INTO `pest_type` (`PT_ID`, `PT_NAME`, `PT_NAME_ENG`, `PT_NOTE`) VALUES
(1, 'แมลงศัตรูพืช', 'insect pest', ''),
(2, 'โรคพืช', 'plant disease', ''),
(3, 'วัชพืช', 'weed', ''),
(4, 'ศัตรูพืชอื่นๆ', 'other pests', '');

-- --------------------------------------------------------

--
-- Table structure for table `plantdiseases`
--

CREATE TABLE `plantdiseases` (
  `idPlantDiseases` int(11) NOT NULL,
  `date` datetime DEFAULT NULL,
  `symptom` varchar(45) DEFAULT NULL,
  `Diseases` varchar(45) DEFAULT NULL,
  `datereport` datetime NOT NULL,
  `Farmer_idFarmer` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `provinces`
--

CREATE TABLE `provinces` (
  `province_id` int(10) UNSIGNED NOT NULL,
  `code` varchar(2) COLLATE utf8_unicode_ci NOT NULL,
  `name_th` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `name_en` varchar(150) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `provinces`
--

INSERT INTO `provinces` (`province_id`, `code`, `name_th`, `name_en`) VALUES
(1, '10', 'กรุงเทพมหานคร', 'Bangkok'),
(2, '11', 'สมุทรปราการ', 'Samut Prakan'),
(3, '12', 'นนทบุรี', 'Nonthaburi'),
(4, '13', 'ปทุมธานี', 'Pathum Thani'),
(5, '14', 'พระนครศรีอยุธยา', 'Phra Nakhon Si Ayutthaya'),
(6, '15', 'อ่างทอง', 'Ang Thong'),
(7, '16', 'ลพบุรี', 'Loburi'),
(8, '17', 'สิงห์บุรี', 'Sing Buri'),
(9, '18', 'ชัยนาท', 'Chai Nat'),
(10, '19', 'สระบุรี', 'Saraburi'),
(11, '20', 'ชลบุรี', 'Chon Buri'),
(12, '21', 'ระยอง', 'Rayong'),
(13, '22', 'จันทบุรี', 'Chanthaburi'),
(14, '23', 'ตราด', 'Trat'),
(15, '24', 'ฉะเชิงเทรา', 'Chachoengsao'),
(16, '25', 'ปราจีนบุรี', 'Prachin Buri'),
(17, '26', 'นครนายก', 'Nakhon Nayok'),
(18, '27', 'สระแก้ว', 'Sa Kaeo'),
(19, '30', 'นครราชสีมา', 'Nakhon Ratchasima'),
(20, '31', 'บุรีรัมย์', 'Buri Ram'),
(21, '32', 'สุรินทร์', 'Surin'),
(22, '33', 'ศรีสะเกษ', 'Si Sa Ket'),
(23, '34', 'อุบลราชธานี', 'Ubon Ratchathani'),
(24, '35', 'ยโสธร', 'Yasothon'),
(25, '36', 'ชัยภูมิ', 'Chaiyaphum'),
(26, '37', 'อำนาจเจริญ', 'Amnat Charoen'),
(27, '39', 'หนองบัวลำภู', 'Nong Bua Lam Phu'),
(28, '40', 'ขอนแก่น', 'Khon Kaen'),
(29, '41', 'อุดรธานี', 'Udon Thani'),
(30, '42', 'เลย', 'Loei'),
(31, '43', 'หนองคาย', 'Nong Khai'),
(32, '44', 'มหาสารคาม', 'Maha Sarakham'),
(33, '45', 'ร้อยเอ็ด', 'Roi Et'),
(34, '46', 'กาฬสินธุ์', 'Kalasin'),
(35, '47', 'สกลนคร', 'Sakon Nakhon'),
(36, '48', 'นครพนม', 'Nakhon Phanom'),
(37, '49', 'มุกดาหาร', 'Mukdahan'),
(38, '50', 'เชียงใหม่', 'Chiang Mai'),
(39, '51', 'ลำพูน', 'Lamphun'),
(40, '52', 'ลำปาง', 'Lampang'),
(41, '53', 'อุตรดิตถ์', 'Uttaradit'),
(42, '54', 'แพร่', 'Phrae'),
(43, '55', 'น่าน', 'Nan'),
(44, '56', 'พะเยา', 'Phayao'),
(45, '57', 'เชียงราย', 'Chiang Rai'),
(46, '58', 'แม่ฮ่องสอน', 'Mae Hong Son'),
(47, '60', 'นครสวรรค์', 'Nakhon Sawan'),
(48, '61', 'อุทัยธานี', 'Uthai Thani'),
(49, '62', 'กำแพงเพชร', 'Kamphaeng Phet'),
(50, '63', 'ตาก', 'Tak'),
(51, '64', 'สุโขทัย', 'Sukhothai'),
(52, '65', 'พิษณุโลก', 'Phitsanulok'),
(53, '66', 'พิจิตร', 'Phichit'),
(54, '67', 'เพชรบูรณ์', 'Phetchabun'),
(55, '70', 'ราชบุรี', 'Ratchaburi'),
(56, '71', 'กาญจนบุรี', 'Kanchanaburi'),
(57, '72', 'สุพรรณบุรี', 'Suphan Buri'),
(58, '73', 'นครปฐม', 'Nakhon Pathom'),
(59, '74', 'สมุทรสาคร', 'Samut Sakhon'),
(60, '75', 'สมุทรสงคราม', 'Samut Songkhram'),
(61, '76', 'เพชรบุรี', 'Phetchaburi'),
(62, '77', 'ประจวบคีรีขันธ์', 'Prachuap Khiri Khan'),
(63, '80', 'นครศรีธรรมราช', 'Nakhon Si Thammarat'),
(64, '81', 'กระบี่', 'Krabi'),
(65, '82', 'พังงา', 'Phangnga'),
(66, '83', 'ภูเก็ต', 'Phuket'),
(67, '84', 'สุราษฎร์ธานี', 'Surat Thani'),
(68, '85', 'ระนอง', 'Ranong'),
(69, '86', 'ชุมพร', 'Chumphon'),
(70, '90', 'สงขลา', 'Songkhla'),
(71, '91', 'สตูล', 'Satun'),
(72, '92', 'ตรัง', 'Trang'),
(73, '93', 'พัทลุง', 'Phatthalung'),
(74, '94', 'ปัตตานี', 'Pattani'),
(75, '95', 'ยะลา', 'Yala'),
(76, '96', 'นราธิวาส', 'Narathiwat'),
(77, '97', 'บึงกาฬ', 'buogkan');

-- --------------------------------------------------------

--
-- Table structure for table `rainreport`
--

CREATE TABLE `rainreport` (
  `idRain` int(11) NOT NULL,
  `date` datetime DEFAULT NULL,
  `time` datetime DEFAULT NULL,
  `hoursOrMinute` int(11) DEFAULT NULL,
  `volume` double DEFAULT NULL,
  `datereport` datetime NOT NULL,
  `Farmer_idFarmer` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `system-code`
--

CREATE TABLE `system-code` (
  `id` int(11) NOT NULL,
  `code` varchar(6) CHARACTER SET utf8 NOT NULL,
  `name` varchar(100) CHARACTER SET utf8 NOT NULL,
  `note2` varchar(200) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `system-code`
--

INSERT INTO `system-code` (`id`, `code`, `name`, `note2`) VALUES
(1, '01111', 'ลบผู้ใช้ออกจากระบบ', 'del'),
(2, '01112', 'กู้คืนผู้ใช้เข้าสู่ระบบ', 'notdel'),
(3, '01113', 'อนุญาตให้ผู้ใช้ใช้งานได้ปกติ', 'unlocked'),
(4, '01114', 'ยกเลิกการเข้าใช้งานของผู้ใช้', 'locked');

-- --------------------------------------------------------

--
-- Table structure for table `user-list`
--

CREATE TABLE `user-list` (
  `u-id` int(11) NOT NULL,
  `u-name` varchar(20) CHARACTER SET utf8 NOT NULL,
  `u-email` varchar(150) CHARACTER SET utf8 NOT NULL,
  `u-pwd` varchar(200) CHARACTER SET utf8 NOT NULL,
  `u-name-title` tinyint(4) NOT NULL,
  `u-name-first` varchar(50) CHARACTER SET utf8 NOT NULL,
  `u-name-last` varchar(100) CHARACTER SET utf8 NOT NULL,
  `d-id` int(11) NOT NULL,
  `u-gender` tinyint(1) NOT NULL,
  `u-is-admin` tinyint(1) NOT NULL,
  `u-is-researcher` tinyint(1) NOT NULL,
  `u-is-officer` tinyint(1) NOT NULL,
  `u-is-farmer` tinyint(1) NOT NULL,
  `u-is-locked` tinyint(1) NOT NULL,
  `u-is-deleted` tinyint(1) NOT NULL,
  `u-note` varchar(200) DEFAULT NULL,
  `u-remark-date` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `user-list`
--

INSERT INTO `user-list` (`u-id`, `u-name`, `u-email`, `u-pwd`, `u-name-title`, `u-name-first`, `u-name-last`, `d-id`, `u-gender`, `u-is-admin`, `u-is-researcher`, `u-is-officer`, `u-is-farmer`, `u-is-locked`, `u-is-deleted`, `u-note`, `u-remark-date`) VALUES
(1, 'root', 'fengvry@ku.ac.th', 'xxx', 3, 'วรัญญา', 'อรรถเสนา', 1, 1, 1, 1, 1, 1, 0, 0, 'don\'t delete', 1555835519),
(2, 'varunya3', 'ku@ac.th', '112fa4d3ce74374c71b97bf4f9aadc3a', 3, 'วรัญญา', 'อรรถเสนา', 3, 1, 1, 0, 0, 0, 0, 0, 'test', NULL),
(3, 'varunya', 'ku@ac.th', 'b0cc9c79efbec221810a6b19eccbbed0', 3, 'วรัญญา', 'อรรถเสนา', 2, 1, 1, 0, 1, 1, 0, 0, 'test', NULL),
(4, 'fengtps', 'fengtps@ku.ac.th', '657b2fe2b96ec97854730aa8390ed676', 1, 'ฐิติพงษ์', 'สถิรเมธีกุล', 1, 0, 1, 0, 0, 1, 0, 0, 'xxx', 1555830246),
(5, 'fengtps2', 'fengvry@ku.ac.th', '9957b230e867d5f204d9f1ac8cfdd299', 1, 'ฐิติพงษ์', 'สถิรเมธีกุล', 2, 0, 0, 0, 1, 0, 0, 0, '123', 1555834545),
(6, 'tharin', 'nut_514@g.com', '77f38bd9b3de95faded8037224184227', 1, 'nut', 'nut', 1, 0, 1, 1, 1, 1, 0, 0, NULL, NULL),
(10, 'nut', 'ku@ac.th', '4a1d86777e36143094657ecf70ff7f26', 1, 'tharin', 'tanta', 2, 1, 1, 0, 1, 1, 0, 0, 'test', NULL),
(12, 'officer', 'ku@ac.th', '5efeabeb4ebd6aeef21cd527645fa707', 1, 'f-officer', 'l-officer', 2, 1, 0, 0, 1, 1, 0, 0, 'test', NULL),
(13, 'farmer', 'ku@ac.th', '70f9b64ed9c0c4aa332afa44eb02a8f7', 1, 'f-farmer', 'l-farmer', 2, 1, 0, 0, 0, 1, 0, 0, 'test', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `user-type`
--

CREATE TABLE `user-type` (
  `ut-id` int(11) NOT NULL,
  `ut-name` varchar(50) CHARACTER SET utf8 NOT NULL,
  `ut-alias` varchar(20) CHARACTER SET utf8 NOT NULL,
  `ut-note` varchar(200) CHARACTER SET utf8 DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `user-type`
--

INSERT INTO `user-type` (`ut-id`, `ut-name`, `ut-alias`, `ut-note`) VALUES
(1, 'ผู้ดูแลระบบ', 'Administrator', 'web'),
(2, 'นักวิจัย', 'Researcher', 'web'),
(3, 'พนักงานทั่วไป', 'Officer', 'web'),
(4, 'เกษตรกร', 'Farmer', 'mobile'),
(5, 'ผู้ช่วยเกษตรกร', 'Labor', 'mobile');

-- --------------------------------------------------------

--
-- Table structure for table `waterreport`
--

CREATE TABLE `waterreport` (
  `idWaterReport` int(11) NOT NULL,
  `date` datetime DEFAULT NULL,
  `datereport` datetime NOT NULL,
  `Farmer_idFarmer` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `web-menu`
--

CREATE TABLE `web-menu` (
  `wm-name` varchar(100) CHARACTER SET utf8 NOT NULL,
  `wm-alias` varchar(20) CHARACTER SET utf8 NOT NULL,
  `wm-page` varchar(150) NOT NULL,
  `wm-icon` varchar(25) DEFAULT NULL,
  `wm-note` varchar(200) CHARACTER SET utf8 DEFAULT NULL,
  `wm-id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `web-menu`
--

INSERT INTO `web-menu` (`wm-name`, `wm-alias`, `wm-page`, `wm-icon`, `wm-note`, `wm-id`) VALUES
('ออกจากระบบ', 'Logout', 'Logout.php', NULL, NULL, 1),
('บัญชีผู้ใช้', 'UserProfile', 'UserProfile.php', 'person', NULL, 2),
('การจัดการผู้ใช้', 'UserList', 'UserList.php', 'people', NULL, 3),
('รายชื่อผู้ใช้', 'OtherUsersList', 'OtherUsersList.php', NULL, NULL, 4),
('รายชื่อหน่วยงาน', 'DepartmentList', 'DepartmentList.php', NULL, NULL, 5),
('รายชื่อเกษตรกร', 'FarmerListAdmin', 'FarmerListAdmin.php', 'people', NULL, 6),
('รายชื่อปุ๋ย', 'FertilizerList', 'FertilizerList.php', 'local_florist', NULL, 7),
('การจัดการศัตรูพืช', 'PestList', 'PestList.php', 'bug_report', NULL, 8),
('รายชื่อแมลง', 'InsectList', 'InsectList.php', 'bug_report', NULL, 9),
('รายชื่อโรคพืช', 'DiseasesList', 'DiseasesList.php', 'nature', NULL, 10),
('รายชื่อวัชพืช', 'WeedList', 'WeedList.php', 'nature', NULL, 11),
('รายชื่อศัตรูพืชอื่นๆ', 'OtherPestList', 'OtherPestList.php', 'nature', NULL, 12),
('แผนที่การเกษตร', 'AgriMap', 'AgriMap.php', 'map', NULL, 13),
('ปฎิทินกิจกรรม', 'Calendar', 'Calendar.php', 'event_note', NULL, 14),
('สนทนา', 'Chat', 'Chat.php', 'chat', NULL, 15),
('รายชื่อเกษตรกร', 'FarmerList', 'FarmerList.php', 'people', NULL, 16),
('รายชื่อสวนปาล์มน้ำมัน', 'OilPalmAreaList', 'OilPalmAreaList.php', 'place', NULL, 17),
('กิจกรรมต่างๆ', 'Activity', 'Activity.php', 'local_activity', NULL, 18),
('ผลผลิตปาล์มน้ำมัน', 'OilPalmAreaVol', 'OilPalmAreaVol.php', NULL, NULL, 19),
('ให้ปุ๋ย', 'FertilizerUsageList', 'FertilizerUsageList.php', NULL, NULL, 20),
('ให้น้ำ', 'Water', 'Water.php', NULL, NULL, 21),
('ล้างคอขวด', 'CutBranch', 'CutBranch.php', NULL, NULL, 22),
('ตรวจพบศัตรูพืช', 'Pest', 'Pest.php', NULL, NULL, 23);

-- --------------------------------------------------------

--
-- Table structure for table `weedreport`
--

CREATE TABLE `weedreport` (
  `idWeed` int(11) NOT NULL,
  `date` datetime DEFAULT NULL,
  `datereport` datetime NOT NULL,
  `Farmer_idFarmer` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `addressplam`
--
ALTER TABLE `addressplam`
  ADD PRIMARY KEY (`idAddressPlam`),
  ADD KEY `fk_AddressPlam_Farmer_idx` (`Farmer_idFarmer`);

--
-- Indexes for table `amphures`
--
ALTER TABLE `amphures`
  ADD PRIMARY KEY (`amphure_id`),
  ADD KEY `province_id` (`province_id`);

--
-- Indexes for table `areaaddressplam`
--
ALTER TABLE `areaaddressplam`
  ADD PRIMARY KEY (`id_areaaddressplam`),
  ADD UNIQUE KEY `id_areaaddressplam` (`id_areaaddressplam`,`lat`,`lon`),
  ADD KEY `idAddressPlam` (`idAddressPlam`);

--
-- Indexes for table `bugreport`
--
ALTER TABLE `bugreport`
  ADD PRIMARY KEY (`idBug`),
  ADD KEY `fk_Bug_Farmar1_idx` (`Farmer_idFarmer`);

--
-- Indexes for table `carwaterreport`
--
ALTER TABLE `carwaterreport`
  ADD PRIMARY KEY (`idCarWaterReport`),
  ADD KEY `fk_CarWaterReport_Farmer1_idx` (`Farmer_idFarmer`);

--
-- Indexes for table `cube_car_water`
--
ALTER TABLE `cube_car_water`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cube_give_water`
--
ALTER TABLE `cube_give_water`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cube_pest`
--
ALTER TABLE `cube_pest`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cube_plant`
--
ALTER TABLE `cube_plant`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cube_product`
--
ALTER TABLE `cube_product`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cube_pruning`
--
ALTER TABLE `cube_pruning`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cube_rainfall`
--
ALTER TABLE `cube_rainfall`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cube_use_fertilizer`
--
ALTER TABLE `cube_use_fertilizer`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cube_volume_fertilizer`
--
ALTER TABLE `cube_volume_fertilizer`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cutleafreport`
--
ALTER TABLE `cutleafreport`
  ADD PRIMARY KEY (`idCutLeafReport`),
  ADD KEY `fk_CutLeafReport_Farmer1_idx` (`Farmer_idFarmer`);

--
-- Indexes for table `db-department`
--
ALTER TABLE `db-department`
  ADD PRIMARY KEY (`DID`),
  ADD UNIQUE KEY `Department` (`Department`),
  ADD UNIQUE KEY `Alias` (`Alias`);

--
-- Indexes for table `db-distrinct`
--
ALTER TABLE `db-distrinct`
  ADD PRIMARY KEY (`AD2ID`),
  ADD KEY `AD1ID` (`AD1ID`);

--
-- Indexes for table `db-emailtype`
--
ALTER TABLE `db-emailtype`
  ADD PRIMARY KEY (`ETID`),
  ADD UNIQUE KEY `Type` (`Type`);

--
-- Indexes for table `db-farmer`
--
ALTER TABLE `db-farmer`
  ADD PRIMARY KEY (`UFID`),
  ADD UNIQUE KEY `Title` (`Title`,`FirstName`,`LastName`),
  ADD KEY `AD3ID` (`AD3ID`);

--
-- Indexes for table `db-fercondition`
--
ALTER TABLE `db-fercondition`
  ADD PRIMARY KEY (`FID`,`Order`),
  ADD UNIQUE KEY `FID` (`FID`,`Condition`);

--
-- Indexes for table `db-fertilizer`
--
ALTER TABLE `db-fertilizer`
  ADD PRIMARY KEY (`FID`),
  ADD UNIQUE KEY `Name` (`Name`);

--
-- Indexes for table `db-pestlist`
--
ALTER TABLE `db-pestlist`
  ADD PRIMARY KEY (`PID`),
  ADD UNIQUE KEY `Name` (`Name`),
  ADD UNIQUE KEY `Alias` (`Alias`),
  ADD KEY `PTID` (`PTID`);

--
-- Indexes for table `db-pesttype`
--
ALTER TABLE `db-pesttype`
  ADD PRIMARY KEY (`PTID`),
  ADD UNIQUE KEY `TypeTH` (`TypeTH`),
  ADD UNIQUE KEY `TypeEN` (`TypeEN`);

--
-- Indexes for table `db-province`
--
ALTER TABLE `db-province`
  ADD PRIMARY KEY (`AD1ID`),
  ADD UNIQUE KEY `ux_provinces_code` (`code`) USING BTREE,
  ADD UNIQUE KEY `Province` (`Province`);

--
-- Indexes for table `db-subdistrinct`
--
ALTER TABLE `db-subdistrinct`
  ADD PRIMARY KEY (`AD3ID`),
  ADD UNIQUE KEY `ux_subdistricts_code` (`code`) USING BTREE,
  ADD UNIQUE KEY `subDistrinct` (`subDistrinct`,`AD2ID`),
  ADD KEY `ix_subdistricts_zip_code` (`zip_code`) USING BTREE,
  ADD KEY `AD2ID` (`AD2ID`);

--
-- Indexes for table `db-user`
--
ALTER TABLE `db-user`
  ADD PRIMARY KEY (`UFID`),
  ADD UNIQUE KEY `Title` (`Title`,`FirstName`,`LastName`),
  ADD UNIQUE KEY `UserName` (`UserName`),
  ADD KEY `ETID` (`ETID`),
  ADD KEY `DID` (`DID`);

--
-- Indexes for table `department`
--
ALTER TABLE `department`
  ADD PRIMARY KEY (`d-id`),
  ADD UNIQUE KEY `d-id` (`d-id`,`d-name`);

--
-- Indexes for table `event`
--
ALTER TABLE `event`
  ADD PRIMARY KEY (`idEvent`),
  ADD KEY `fk_Event_Farmer1_idx` (`Farmer_idFarmer`);

--
-- Indexes for table `farmer`
--
ALTER TABLE `farmer`
  ADD PRIMARY KEY (`idFarmer`);

--
-- Indexes for table `fertilizer`
--
ALTER TABLE `fertilizer`
  ADD PRIMARY KEY (`F_ID`);

--
-- Indexes for table `fertilizerreport`
--
ALTER TABLE `fertilizerreport`
  ADD PRIMARY KEY (`idFertilizerReport`),
  ADD KEY `fk_FertilizerReport_Farmer1_idx` (`Farmer_idFarmer`);

--
-- Indexes for table `harvestreport`
--
ALTER TABLE `harvestreport`
  ADD PRIMARY KEY (`idHarvestReport`),
  ADD KEY `fk_HarvestReport_Farmer1_idx` (`Farmer_idFarmer`);

--
-- Indexes for table `imagebugreport`
--
ALTER TABLE `imagebugreport`
  ADD PRIMARY KEY (`idImageBug`),
  ADD KEY `fk_ImageBug_Bug1_idx` (`Bug_idBug`);

--
-- Indexes for table `imagefertilizerreport`
--
ALTER TABLE `imagefertilizerreport`
  ADD PRIMARY KEY (`idImageFertilizer`),
  ADD KEY `fk_ImageFertilizer_FertilizerReport1_idx` (`FertilizerReport_idFertilizerReport`);

--
-- Indexes for table `imageharvestreport`
--
ALTER TABLE `imageharvestreport`
  ADD PRIMARY KEY (`idImageHarvest`),
  ADD KEY `fk_ImageHarvest_HarvestReport1_idx` (`HarvestReport_idHarvestReport`);

--
-- Indexes for table `imageplantdiseases`
--
ALTER TABLE `imageplantdiseases`
  ADD PRIMARY KEY (`idImagePlantDiseases`),
  ADD KEY `fk_ImagePlantDiseases_PlantDiseases1_idx` (`PlantDiseases_idPlantDiseases`);

--
-- Indexes for table `main-menu-list`
--
ALTER TABLE `main-menu-list`
  ADD PRIMARY KEY (`ut-id`,`mm-mainmenu`,`mm-submenu`),
  ADD KEY `wm-id` (`wm-id`),
  ADD KEY `wm-id_2` (`wm-id`),
  ADD KEY `wm-id_3` (`wm-id`);

--
-- Indexes for table `makepalm`
--
ALTER TABLE `makepalm`
  ADD PRIMARY KEY (`idMakePalm`),
  ADD KEY `fk_MakePalm_AddressPlam1_idx` (`AddressPlam_idAddressPlam`);

--
-- Indexes for table `palmplanting`
--
ALTER TABLE `palmplanting`
  ADD PRIMARY KEY (`id_planting`),
  ADD KEY `idAddressPlam` (`idAddressPlam`);

--
-- Indexes for table `palmproduct`
--
ALTER TABLE `palmproduct`
  ADD PRIMARY KEY (`id_palmproduct`),
  ADD KEY `idFarmer` (`idFarmer`);

--
-- Indexes for table `palmtobugreport`
--
ALTER TABLE `palmtobugreport`
  ADD PRIMARY KEY (`idPalmToBug`),
  ADD KEY `fk_PalmToBug_Bug1_idx` (`Bug_idBug`),
  ADD KEY `fk_PalmToBug_AddressPlam1_idx` (`AddressPlam_idAddressPlam`);

--
-- Indexes for table `palmtocarwaterreport`
--
ALTER TABLE `palmtocarwaterreport`
  ADD PRIMARY KEY (`idPalmToCarWater`),
  ADD KEY `fk_PalmToCarWater_CarWaterReport1_idx` (`CarWaterReport_idCarWaterReport`),
  ADD KEY `fk_PalmToCarWater_AddressPlam1_idx` (`AddressPlam_idAddressPlam`);

--
-- Indexes for table `palmtocutleafreport`
--
ALTER TABLE `palmtocutleafreport`
  ADD PRIMARY KEY (`idPalmToCutLeaf`),
  ADD KEY `fk_PalmToCutLeaf_CutLeafReport1_idx` (`CutLeafReport_idCutLeafReport`),
  ADD KEY `fk_PalmToCutLeaf_AddressPlam1_idx` (`AddressPlam_idAddressPlam`);

--
-- Indexes for table `palmtofertilizerreport`
--
ALTER TABLE `palmtofertilizerreport`
  ADD PRIMARY KEY (`idPalmToFertilizer`),
  ADD KEY `fk_PalmToFertilizer_FertilizerReport1_idx` (`FertilizerReport_idFertilizerReport`),
  ADD KEY `fk_PalmToFertilizer_AddressPlam1_idx` (`AddressPlam_idAddressPlam`);

--
-- Indexes for table `palmtoharvestreport`
--
ALTER TABLE `palmtoharvestreport`
  ADD PRIMARY KEY (`idPalmToHarvest`),
  ADD KEY `fk_PalmToHarvest_AddressPlam1_idx` (`AddressPlam_idAddressPlam`),
  ADD KEY `fk_PalmToHarvest_HarvestReport1_idx` (`HarvestReport_idHarvestReport`);

--
-- Indexes for table `palmtoplantdiseases`
--
ALTER TABLE `palmtoplantdiseases`
  ADD PRIMARY KEY (`idPalmToPlantDiseases`),
  ADD KEY `fk_PalmToPlantDiseases_AddressPlam1_idx` (`AddressPlam_idAddressPlam`),
  ADD KEY `fk_PalmToPlantDiseases_PlantDiseases1_idx` (`PlantDiseases_idPlantDiseases`);

--
-- Indexes for table `palmtowaterreport`
--
ALTER TABLE `palmtowaterreport`
  ADD PRIMARY KEY (`idPalmToWater`),
  ADD KEY `fk_PalmToWater_WaterReport1_idx` (`WaterReport_idWaterReport`),
  ADD KEY `fk_PalmToWater_AddressPlam1_idx` (`AddressPlam_idAddressPlam`);

--
-- Indexes for table `palmtoweedreport`
--
ALTER TABLE `palmtoweedreport`
  ADD PRIMARY KEY (`idPalmToWeedReport`),
  ADD KEY `fk_PalmToWeedReport_WeedReport1_idx` (`WeedReport_idWeed`),
  ADD KEY `fk_PalmToWeedReport_AddressPlam1_idx` (`AddressPlam_idAddressPlam`);

--
-- Indexes for table `pest_lists`
--
ALTER TABLE `pest_lists`
  ADD PRIMARY KEY (`PL_ID`);

--
-- Indexes for table `pest_type`
--
ALTER TABLE `pest_type`
  ADD PRIMARY KEY (`PT_ID`);

--
-- Indexes for table `plantdiseases`
--
ALTER TABLE `plantdiseases`
  ADD PRIMARY KEY (`idPlantDiseases`),
  ADD KEY `fk_PlantDiseases_Farmer1_idx` (`Farmer_idFarmer`);

--
-- Indexes for table `provinces`
--
ALTER TABLE `provinces`
  ADD PRIMARY KEY (`province_id`);

--
-- Indexes for table `rainreport`
--
ALTER TABLE `rainreport`
  ADD PRIMARY KEY (`idRain`),
  ADD KEY `fk_Rain_Farmer1_idx` (`Farmer_idFarmer`);

--
-- Indexes for table `system-code`
--
ALTER TABLE `system-code`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user-list`
--
ALTER TABLE `user-list`
  ADD PRIMARY KEY (`u-id`),
  ADD KEY `d-id` (`d-id`);

--
-- Indexes for table `user-type`
--
ALTER TABLE `user-type`
  ADD PRIMARY KEY (`ut-id`),
  ADD UNIQUE KEY `u-name` (`ut-name`);

--
-- Indexes for table `waterreport`
--
ALTER TABLE `waterreport`
  ADD PRIMARY KEY (`idWaterReport`),
  ADD KEY `fk_WaterReport_Farmer1_idx` (`Farmer_idFarmer`);

--
-- Indexes for table `web-menu`
--
ALTER TABLE `web-menu`
  ADD PRIMARY KEY (`wm-id`);

--
-- Indexes for table `weedreport`
--
ALTER TABLE `weedreport`
  ADD PRIMARY KEY (`idWeed`),
  ADD KEY `fk_Weed_Farmer1_idx` (`Farmer_idFarmer`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `addressplam`
--
ALTER TABLE `addressplam`
  MODIFY `idAddressPlam` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `areaaddressplam`
--
ALTER TABLE `areaaddressplam`
  MODIFY `id_areaaddressplam` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `bugreport`
--
ALTER TABLE `bugreport`
  MODIFY `idBug` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `carwaterreport`
--
ALTER TABLE `carwaterreport`
  MODIFY `idCarWaterReport` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `cube_pest`
--
ALTER TABLE `cube_pest`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `cube_plant`
--
ALTER TABLE `cube_plant`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `cube_product`
--
ALTER TABLE `cube_product`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `cube_pruning`
--
ALTER TABLE `cube_pruning`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `cube_rainfall`
--
ALTER TABLE `cube_rainfall`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `cube_use_fertilizer`
--
ALTER TABLE `cube_use_fertilizer`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `cube_volume_fertilizer`
--
ALTER TABLE `cube_volume_fertilizer`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `cutleafreport`
--
ALTER TABLE `cutleafreport`
  MODIFY `idCutLeafReport` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `db-department`
--
ALTER TABLE `db-department`
  MODIFY `DID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;

--
-- AUTO_INCREMENT for table `db-distrinct`
--
ALTER TABLE `db-distrinct`
  MODIFY `AD2ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=929;

--
-- AUTO_INCREMENT for table `db-emailtype`
--
ALTER TABLE `db-emailtype`
  MODIFY `ETID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `db-farmer`
--
ALTER TABLE `db-farmer`
  MODIFY `UFID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `db-fertilizer`
--
ALTER TABLE `db-fertilizer`
  MODIFY `FID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `db-pestlist`
--
ALTER TABLE `db-pestlist`
  MODIFY `PID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `db-pesttype`
--
ALTER TABLE `db-pesttype`
  MODIFY `PTID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `db-province`
--
ALTER TABLE `db-province`
  MODIFY `AD1ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=78;

--
-- AUTO_INCREMENT for table `db-subdistrinct`
--
ALTER TABLE `db-subdistrinct`
  MODIFY `AD3ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2352;

--
-- AUTO_INCREMENT for table `db-user`
--
ALTER TABLE `db-user`
  MODIFY `UFID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `department`
--
ALTER TABLE `department`
  MODIFY `d-id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `event`
--
ALTER TABLE `event`
  MODIFY `idEvent` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `farmer`
--
ALTER TABLE `farmer`
  MODIFY `idFarmer` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `fertilizer`
--
ALTER TABLE `fertilizer`
  MODIFY `F_ID` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `fertilizerreport`
--
ALTER TABLE `fertilizerreport`
  MODIFY `idFertilizerReport` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `harvestreport`
--
ALTER TABLE `harvestreport`
  MODIFY `idHarvestReport` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `imagebugreport`
--
ALTER TABLE `imagebugreport`
  MODIFY `idImageBug` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `imagefertilizerreport`
--
ALTER TABLE `imagefertilizerreport`
  MODIFY `idImageFertilizer` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `imageharvestreport`
--
ALTER TABLE `imageharvestreport`
  MODIFY `idImageHarvest` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `imageplantdiseases`
--
ALTER TABLE `imageplantdiseases`
  MODIFY `idImagePlantDiseases` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `makepalm`
--
ALTER TABLE `makepalm`
  MODIFY `idMakePalm` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `palmplanting`
--
ALTER TABLE `palmplanting`
  MODIFY `id_planting` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `palmproduct`
--
ALTER TABLE `palmproduct`
  MODIFY `id_palmproduct` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `palmtobugreport`
--
ALTER TABLE `palmtobugreport`
  MODIFY `idPalmToBug` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `palmtocarwaterreport`
--
ALTER TABLE `palmtocarwaterreport`
  MODIFY `idPalmToCarWater` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `palmtocutleafreport`
--
ALTER TABLE `palmtocutleafreport`
  MODIFY `idPalmToCutLeaf` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `palmtofertilizerreport`
--
ALTER TABLE `palmtofertilizerreport`
  MODIFY `idPalmToFertilizer` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `palmtoharvestreport`
--
ALTER TABLE `palmtoharvestreport`
  MODIFY `idPalmToHarvest` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `palmtoplantdiseases`
--
ALTER TABLE `palmtoplantdiseases`
  MODIFY `idPalmToPlantDiseases` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `palmtoweedreport`
--
ALTER TABLE `palmtoweedreport`
  MODIFY `idPalmToWeedReport` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `pest_lists`
--
ALTER TABLE `pest_lists`
  MODIFY `PL_ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;

--
-- AUTO_INCREMENT for table `pest_type`
--
ALTER TABLE `pest_type`
  MODIFY `PT_ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `plantdiseases`
--
ALTER TABLE `plantdiseases`
  MODIFY `idPlantDiseases` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `rainreport`
--
ALTER TABLE `rainreport`
  MODIFY `idRain` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `system-code`
--
ALTER TABLE `system-code`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `user-list`
--
ALTER TABLE `user-list`
  MODIFY `u-id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `user-type`
--
ALTER TABLE `user-type`
  MODIFY `ut-id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `waterreport`
--
ALTER TABLE `waterreport`
  MODIFY `idWaterReport` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `web-menu`
--
ALTER TABLE `web-menu`
  MODIFY `wm-id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT for table `weedreport`
--
ALTER TABLE `weedreport`
  MODIFY `idWeed` int(11) NOT NULL AUTO_INCREMENT;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `addressplam`
--
ALTER TABLE `addressplam`
  ADD CONSTRAINT `fk_AddressPlam_Farmer` FOREIGN KEY (`Farmer_idFarmer`) REFERENCES `farmer` (`idFarmer`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `amphures`
--
ALTER TABLE `amphures`
  ADD CONSTRAINT `amphures_ibfk_1` FOREIGN KEY (`province_id`) REFERENCES `provinces` (`province_id`);

--
-- Constraints for table `areaaddressplam`
--
ALTER TABLE `areaaddressplam`
  ADD CONSTRAINT `areaaddressplam_ibfk_1` FOREIGN KEY (`idAddressPlam`) REFERENCES `addressplam` (`idAddressPlam`);

--
-- Constraints for table `bugreport`
--
ALTER TABLE `bugreport`
  ADD CONSTRAINT `fk_Bug_Farmer1` FOREIGN KEY (`Farmer_idFarmer`) REFERENCES `farmer` (`idFarmer`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `carwaterreport`
--
ALTER TABLE `carwaterreport`
  ADD CONSTRAINT `fk_CarWaterReport_Farmer1` FOREIGN KEY (`Farmer_idFarmer`) REFERENCES `farmer` (`idFarmer`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `cutleafreport`
--
ALTER TABLE `cutleafreport`
  ADD CONSTRAINT `fk_CutLeafReport_Farmer1` FOREIGN KEY (`Farmer_idFarmer`) REFERENCES `farmer` (`idFarmer`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `db-distrinct`
--
ALTER TABLE `db-distrinct`
  ADD CONSTRAINT `db-distrinct_ibfk_1` FOREIGN KEY (`AD1ID`) REFERENCES `db-province` (`AD1ID`);

--
-- Constraints for table `db-farmer`
--
ALTER TABLE `db-farmer`
  ADD CONSTRAINT `db-farmer_ibfk_1` FOREIGN KEY (`AD3ID`) REFERENCES `db-subdistrinct` (`AD3ID`);

--
-- Constraints for table `db-fercondition`
--
ALTER TABLE `db-fercondition`
  ADD CONSTRAINT `db-fercondition_ibfk_1` FOREIGN KEY (`FID`) REFERENCES `db-fertilizer` (`FID`),
  ADD CONSTRAINT `db-fercondition_ibfk_2` FOREIGN KEY (`FID`) REFERENCES `db-fertilizer` (`FID`);

--
-- Constraints for table `db-pestlist`
--
ALTER TABLE `db-pestlist`
  ADD CONSTRAINT `db-pestlist_ibfk_1` FOREIGN KEY (`PTID`) REFERENCES `db-pesttype` (`PTID`);

--
-- Constraints for table `db-subdistrinct`
--
ALTER TABLE `db-subdistrinct`
  ADD CONSTRAINT `db-subdistrinct_ibfk_1` FOREIGN KEY (`AD2ID`) REFERENCES `db-distrinct` (`AD2ID`);

--
-- Constraints for table `db-user`
--
ALTER TABLE `db-user`
  ADD CONSTRAINT `db-user_ibfk_1` FOREIGN KEY (`ETID`) REFERENCES `db-emailtype` (`ETID`),
  ADD CONSTRAINT `db-user_ibfk_2` FOREIGN KEY (`DID`) REFERENCES `db-department` (`DID`);

--
-- Constraints for table `event`
--
ALTER TABLE `event`
  ADD CONSTRAINT `fk_Event_Farmer1` FOREIGN KEY (`Farmer_idFarmer`) REFERENCES `farmer` (`idFarmer`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `fertilizerreport`
--
ALTER TABLE `fertilizerreport`
  ADD CONSTRAINT `fk_FertilizerReport_Farmer1` FOREIGN KEY (`Farmer_idFarmer`) REFERENCES `farmer` (`idFarmer`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `harvestreport`
--
ALTER TABLE `harvestreport`
  ADD CONSTRAINT `fk_HarvestReport_Farmer1` FOREIGN KEY (`Farmer_idFarmer`) REFERENCES `farmer` (`idFarmer`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `imagebugreport`
--
ALTER TABLE `imagebugreport`
  ADD CONSTRAINT `fk_ImageBug_Bug1` FOREIGN KEY (`Bug_idBug`) REFERENCES `bugreport` (`idBug`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `imagefertilizerreport`
--
ALTER TABLE `imagefertilizerreport`
  ADD CONSTRAINT `fk_ImageFertilizer_FertilizerReport1` FOREIGN KEY (`FertilizerReport_idFertilizerReport`) REFERENCES `fertilizerreport` (`idFertilizerReport`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `imageharvestreport`
--
ALTER TABLE `imageharvestreport`
  ADD CONSTRAINT `fk_ImageHarvest_HarvestReport1` FOREIGN KEY (`HarvestReport_idHarvestReport`) REFERENCES `harvestreport` (`idHarvestReport`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `imageplantdiseases`
--
ALTER TABLE `imageplantdiseases`
  ADD CONSTRAINT `fk_ImagePlantDiseases_PlantDiseases1` FOREIGN KEY (`PlantDiseases_idPlantDiseases`) REFERENCES `plantdiseases` (`idPlantDiseases`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `main-menu-list`
--
ALTER TABLE `main-menu-list`
  ADD CONSTRAINT `main-menu-list_ibfk_1` FOREIGN KEY (`ut-id`) REFERENCES `user-type` (`ut-id`),
  ADD CONSTRAINT `main-menu-list_ibfk_2` FOREIGN KEY (`wm-id`) REFERENCES `web-menu` (`wm-id`);

--
-- Constraints for table `makepalm`
--
ALTER TABLE `makepalm`
  ADD CONSTRAINT `fk_MakePalm_AddressPlam1` FOREIGN KEY (`AddressPlam_idAddressPlam`) REFERENCES `addressplam` (`idAddressPlam`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `palmplanting`
--
ALTER TABLE `palmplanting`
  ADD CONSTRAINT `palmplanting_ibfk_1` FOREIGN KEY (`idAddressPlam`) REFERENCES `addressplam` (`idAddressPlam`);

--
-- Constraints for table `palmproduct`
--
ALTER TABLE `palmproduct`
  ADD CONSTRAINT `palmproduct_ibfk_1` FOREIGN KEY (`idFarmer`) REFERENCES `farmer` (`idFarmer`);

--
-- Constraints for table `palmtobugreport`
--
ALTER TABLE `palmtobugreport`
  ADD CONSTRAINT `fk_PalmToBug_AddressPlam1` FOREIGN KEY (`AddressPlam_idAddressPlam`) REFERENCES `addressplam` (`idAddressPlam`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `fk_PalmToBug_Bug1` FOREIGN KEY (`Bug_idBug`) REFERENCES `bugreport` (`idBug`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `palmtocarwaterreport`
--
ALTER TABLE `palmtocarwaterreport`
  ADD CONSTRAINT `fk_PalmToCarWater_AddressPlam1` FOREIGN KEY (`AddressPlam_idAddressPlam`) REFERENCES `addressplam` (`idAddressPlam`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `fk_PalmToCarWater_CarWaterReport1` FOREIGN KEY (`CarWaterReport_idCarWaterReport`) REFERENCES `carwaterreport` (`idCarWaterReport`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `palmtocutleafreport`
--
ALTER TABLE `palmtocutleafreport`
  ADD CONSTRAINT `fk_PalmToCutLeaf_AddressPlam1` FOREIGN KEY (`AddressPlam_idAddressPlam`) REFERENCES `addressplam` (`idAddressPlam`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `fk_PalmToCutLeaf_CutLeafReport1` FOREIGN KEY (`CutLeafReport_idCutLeafReport`) REFERENCES `cutleafreport` (`idCutLeafReport`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `palmtofertilizerreport`
--
ALTER TABLE `palmtofertilizerreport`
  ADD CONSTRAINT `fk_PalmToFertilizer_AddressPlam1` FOREIGN KEY (`AddressPlam_idAddressPlam`) REFERENCES `addressplam` (`idAddressPlam`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `fk_PalmToFertilizer_FertilizerReport1` FOREIGN KEY (`FertilizerReport_idFertilizerReport`) REFERENCES `fertilizerreport` (`idFertilizerReport`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `palmtoharvestreport`
--
ALTER TABLE `palmtoharvestreport`
  ADD CONSTRAINT `fk_PalmToHarvest_AddressPlam1` FOREIGN KEY (`AddressPlam_idAddressPlam`) REFERENCES `addressplam` (`idAddressPlam`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `fk_PalmToHarvest_HarvestReport1` FOREIGN KEY (`HarvestReport_idHarvestReport`) REFERENCES `harvestreport` (`idHarvestReport`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `palmtoplantdiseases`
--
ALTER TABLE `palmtoplantdiseases`
  ADD CONSTRAINT `fk_PalmToPlantDiseases_AddressPlam1` FOREIGN KEY (`AddressPlam_idAddressPlam`) REFERENCES `addressplam` (`idAddressPlam`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `fk_PalmToPlantDiseases_PlantDiseases1` FOREIGN KEY (`PlantDiseases_idPlantDiseases`) REFERENCES `plantdiseases` (`idPlantDiseases`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `palmtowaterreport`
--
ALTER TABLE `palmtowaterreport`
  ADD CONSTRAINT `fk_PalmToWater_AddressPlam1` FOREIGN KEY (`AddressPlam_idAddressPlam`) REFERENCES `addressplam` (`idAddressPlam`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `fk_PalmToWater_WaterReport1` FOREIGN KEY (`WaterReport_idWaterReport`) REFERENCES `waterreport` (`idWaterReport`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `palmtoweedreport`
--
ALTER TABLE `palmtoweedreport`
  ADD CONSTRAINT `fk_PalmToWeedReport_AddressPlam1` FOREIGN KEY (`AddressPlam_idAddressPlam`) REFERENCES `addressplam` (`idAddressPlam`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `fk_PalmToWeedReport_WeedReport1` FOREIGN KEY (`WeedReport_idWeed`) REFERENCES `weedreport` (`idWeed`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `plantdiseases`
--
ALTER TABLE `plantdiseases`
  ADD CONSTRAINT `fk_PlantDiseases_Farmer1` FOREIGN KEY (`Farmer_idFarmer`) REFERENCES `farmer` (`idFarmer`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `rainreport`
--
ALTER TABLE `rainreport`
  ADD CONSTRAINT `fk_Rain_Farmer1` FOREIGN KEY (`Farmer_idFarmer`) REFERENCES `farmer` (`idFarmer`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `user-list`
--
ALTER TABLE `user-list`
  ADD CONSTRAINT `user-list_ibfk_1` FOREIGN KEY (`d-id`) REFERENCES `department` (`d-id`);

--
-- Constraints for table `waterreport`
--
ALTER TABLE `waterreport`
  ADD CONSTRAINT `fk_WaterReport_Farmer1` FOREIGN KEY (`Farmer_idFarmer`) REFERENCES `farmer` (`idFarmer`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `weedreport`
--
ALTER TABLE `weedreport`
  ADD CONSTRAINT `fk_WeedReport_Farmer1` FOREIGN KEY (`Farmer_idFarmer`) REFERENCES `farmer` (`idFarmer`) ON DELETE NO ACTION ON UPDATE NO ACTION;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
