-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 05, 2019 at 11:28 AM
-- Server version: 10.4.6-MariaDB
-- PHP Version: 7.3.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `palm5`
--

-- --------------------------------------------------------

--
-- Table structure for table `db-coorfarm`
--

CREATE TABLE `db-coorfarm` (
  `FCID` int(11) NOT NULL,
  `FSID` int(11) NOT NULL,
  `Corner` int(11) NOT NULL,
  `Latitude` float NOT NULL,
  `Longitude` float NOT NULL,
  `ModifyDT` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-coorfarm`
--

INSERT INTO `db-coorfarm` (`FCID`, `FSID`, `Corner`, `Latitude`, `Longitude`, `ModifyDT`) VALUES
(1, 1, 1, 12.8158, 101.49, '2019-10-19 11:59:39'),
(2, 1, 2, 12.8161, 101.491, '2019-10-19 12:00:45'),
(3, 1, 3, 12.8156, 101.492, '2019-10-19 12:01:22'),
(4, 1, 4, 12.8153, 101.491, '2019-10-19 12:02:30');

-- --------------------------------------------------------

--
-- Table structure for table `db-department`
--

CREATE TABLE `db-department` (
  `DID` int(11) NOT NULL,
  `Department` varchar(100) NOT NULL,
  `Alias` varchar(25) NOT NULL,
  `Note` text DEFAULT NULL,
  `ModifyDT` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-department`
--

INSERT INTO `db-department` (`DID`, `Department`, `Alias`, `Note`, `ModifyDT`) VALUES
(1, 'ภาควิชาวิศวกรรมคอมพิวเตอร์', 'CPE', 'หน่วยงานผู้พัฒนาระบบ', '2019-10-20 04:04:20'),
(2, 'ศูนย์เทคโนโลยีชีวภาพเกษตร', 'CAB', 'หน่วยงานผู้เชียวชาญ', '2019-10-20 04:04:20'),
(3, 'บริษัท ซีพีไอ อะโกรเทค จำกัด', 'CPI', 'หน่วยงานผู้ใช้บริการ', '2019-10-20 04:04:20'),
(7, 'e', 'e', 'e', '2019-11-04 17:19:41'),
(17, 'y', 'y', '', '2019-11-05 07:22:22'),
(18, 'eg', 'er', '', '2019-11-05 07:22:32');

-- --------------------------------------------------------

--
-- Table structure for table `db-distrinct`
--

CREATE TABLE `db-distrinct` (
  `AD2ID` int(11) NOT NULL,
  `Distrinct` varchar(30) NOT NULL,
  `AD1ID` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-distrinct`
--

INSERT INTO `db-distrinct` (`AD2ID`, `Distrinct`, `AD1ID`) VALUES
(886, 'กงหรา', 74),
(678, 'กงไกรลาศ', 52),
(179, 'กบินทร์บุรี', 16),
(467, 'กมลาไสย', 35),
(915, 'กรงปีนัง', 76),
(757, 'กระทุ่มแบน', 60),
(371, 'กระนวน', 29),
(842, 'กระบุรี', 69),
(232, 'กระสัง', 20),
(859, 'กระแสสินธุ์', 71),
(818, 'กะทู้', 67),
(811, 'กะปง', 66),
(906, 'กะพ้อ', 75),
(841, 'กะเปอร์', 69),
(876, 'กันตัง', 73),
(273, 'กันทรลักษ์', 22),
(435, 'กันทรวิชัย', 33),
(272, 'กันทรารมย์', 22),
(544, 'กัลยาณิวัฒนา', 39),
(821, 'กาญจนดิษฐ์', 68),
(914, 'กาบัง', 76),
(258, 'กาบเชิง', 21),
(750, 'กำแพงแสน', 59),
(469, 'กุฉินารายณ์', 35),
(302, 'กุดข้าวปุ้น', 23),
(390, 'กุดจับ', 30),
(319, 'กุดชุม', 24),
(485, 'กุดบาก', 36),
(443, 'กุดรัง', 33),
(392, 'กุมภวาปี', 30),
(771, 'กุยบุรี', 63),
(484, 'กุสุมาลย์', 36),
(407, 'กู่แก้ว', 30),
(792, 'ขนอม', 64),
(151, 'ขลุง', 13),
(658, 'ขาณุวรลักษบุรี', 50),
(216, 'ขามทะเลสอ', 19),
(208, 'ขามสะแกแสง', 19),
(274, 'ขุขันธ์', 22),
(620, 'ขุนตาล', 46),
(626, 'ขุนยวม', 47),
(277, 'ขุนหาญ', 22),
(201, 'คง', 19),
(199, 'ครบุรี', 19),
(659, 'คลองขลุง', 50),
(804, 'คลองท่อม', 65),
(657, 'คลองลาน', 50),
(64, 'คลองหลวง', 4),
(867, 'คลองหอยโข่ง', 71),
(190, 'คลองหาด', 18),
(177, 'คลองเขื่อน', 15),
(161, 'คลองใหญ่', 14),
(870, 'ควนกาหลง', 72),
(889, 'ควนขนุน', 74),
(864, 'ควนเนียง', 71),
(869, 'ควนโดน', 72),
(328, 'คอนสวรรค์', 25),
(338, 'คอนสาร', 25),
(517, 'คำชะอี', 38),
(491, 'คำตากล้า', 36),
(474, 'คำม่วง', 35),
(320, 'คำเขื่อนแก้ว', 24),
(677, 'คีรีมาศ', 52),
(827, 'คีรีรัฐนิคม', 68),
(814, 'คุระบุรี', 66),
(231, 'คูเมือง', 20),
(106, 'ค่ายบางระจัน', 8),
(323, 'ค้อวัง', 24),
(482, 'ฆ้องชัย', 35),
(557, 'งาว', 41),
(448, 'จตุรพักตรพิมาน', 34),
(521, 'จอมทอง', 39),
(717, 'จอมบึง', 56),
(256, 'จอมพระ', 21),
(854, 'จะนะ', 71),
(927, 'จะแนะ', 77),
(203, 'จักราช', 19),
(461, 'จังหาร', 34),
(331, 'จัตุรัส', 25),
(599, 'จุน', 45),
(796, 'จุฬาภรณ์', 64),
(781, 'ฉวาง', 64),
(380, 'ชนบท', 29),
(706, 'ชนแดน', 55),
(784, 'ชะอวด', 64),
(765, 'ชะอำ', 62),
(96, 'ชัยบาดาล', 7),
(837, 'ชัยบุรี', 68),
(686, 'ชาติตระการ', 53),
(343, 'ชานุมาน', 26),
(247, 'ชำนิ', 20),
(444, 'ชื่นชม', 33),
(646, 'ชุมตาบง', 48),
(254, 'ชุมพลบุรี', 21),
(214, 'ชุมพวง', 19),
(367, 'ชุมแพ', 29),
(634, 'ชุมแสง', 48),
(799, 'ช้างกลาง', 64),
(341, 'ซับใหญ่', 25),
(383, 'ซำสูง', 29),
(516, 'ดงหลวง', 38),
(703, 'ดงเจริญ', 54),
(602, 'ดอกคำใต้', 45),
(481, 'ดอนจาน', 35),
(515, 'ดอนตาล', 38),
(752, 'ดอนตูม', 59),
(124, 'ดอนพุด', 10),
(309, 'ดอนมดแดง', 23),
(822, 'ดอนสัก', 68),
(744, 'ดอนเจดีย์', 58),
(524, 'ดอยสะเก็ด', 39),
(624, 'ดอยหลวง', 46),
(543, 'ดอยหล่อ', 39),
(536, 'ดอยเต่า', 39),
(719, 'ดำเนินสะดวก', 56),
(205, 'ด่านขุนทด', 19),
(741, 'ด่านช้าง', 58),
(413, 'ด่านซ้าย', 31),
(736, 'ด่านมะขามเตี้ย', 57),
(567, 'ตรอน', 42),
(301, 'ตระการพืชผล', 23),
(812, 'ตะกั่วทุ่ง', 66),
(813, 'ตะกั่วป่า', 66),
(696, 'ตะพานหิน', 54),
(888, 'ตะโหมด', 74),
(643, 'ตากฟ้า', 48),
(917, 'ตากใบ', 77),
(638, 'ตาคลี', 48),
(191, 'ตาพระยา', 18),
(306, 'ตาลสุม', 23),
(819, 'ถลาง', 67),
(795, 'ถ้ำพรรณรา', 64),
(662, 'ทรายทองวัฒนา', 50),
(318, 'ทรายมูล', 24),
(732, 'ทองผาภูมิ', 57),
(574, 'ทองแสนขัน', 42),
(700, 'ทับคล้อ', 54),
(815, 'ทับปุด', 66),
(772, 'ทับสะแก', 63),
(648, 'ทัพทัน', 49),
(590, 'ทุ่งช้าง', 44),
(851, 'ทุ่งตะโก', 70),
(395, 'ทุ่งฝน', 30),
(901, 'ทุ่งยางแดง', 75),
(311, 'ทุ่งศรีอุดม', 23),
(786, 'ทุ่งสง', 64),
(873, 'ทุ่งหว้า', 72),
(549, 'ทุ่งหัวช้าง', 40),
(464, 'ทุ่งเขาหลวง', 34),
(683, 'ทุ่งเสลี่ยม', 52),
(788, 'ทุ่งใหญ่', 64),
(475, 'ท่าคันโท', 35),
(830, 'ท่าฉาง', 68),
(826, 'ท่าชนะ', 68),
(108, 'ท่าช้าง', 8),
(176, 'ท่าตะเกียบ', 15),
(639, 'ท่าตะโก', 48),
(255, 'ท่าตูม', 21),
(424, 'ท่าบ่อ', 32),
(568, 'ท่าปลา', 42),
(730, 'ท่ามะกา', 57),
(731, 'ท่าม่วง', 57),
(766, 'ท่ายาง', 62),
(416, 'ท่าลี่', 31),
(588, 'ท่าวังผา', 44),
(97, 'ท่าวุ้ง', 7),
(785, 'ท่าศาลา', 64),
(670, 'ท่าสองยาง', 51),
(99, 'ท่าหลวง', 7),
(503, 'ท่าอุเทน', 37),
(71, 'ท่าเรือ', 5),
(845, 'ท่าแซะ', 70),
(871, 'ท่าแพ', 72),
(152, 'ท่าใหม่', 13),
(816, 'ท้ายเหมือง', 66),
(449, 'ธวัชบุรี', 34),
(65, 'ธัญบุรี', 4),
(505, 'ธาตุพนม', 37),
(911, 'ธารโต', 76),
(751, 'นครชัยศรี', 59),
(72, 'นครหลวง', 5),
(685, 'นครไทย', 53),
(798, 'นบพิตำ', 64),
(358, 'นากลาง', 28),
(480, 'นาคู', 35),
(233, 'นางรอง', 20),
(298, 'นาจะหลวย', 23),
(180, 'นาดี', 16),
(441, 'นาดูน', 33),
(410, 'นาด้วง', 31),
(313, 'นาตาล', 23),
(511, 'นาทม', 37),
(855, 'นาทวี', 71),
(586, 'นาน้อย', 44),
(787, 'นาบอน', 64),
(466, 'นามน', 35),
(158, 'นายายอาม', 13),
(405, 'นายูง', 30),
(362, 'นาวัง', 28),
(592, 'นาหมื่น', 44),
(863, 'นาหม่อม', 71),
(509, 'นาหว้า', 37),
(438, 'นาเชือก', 33),
(312, 'นาเยีย', 23),
(507, 'นาแก', 37),
(414, 'นาแห้ว', 31),
(242, 'นาโพธิ์', 20),
(882, 'นาโยง', 73),
(514, 'นิคมคำสร้อย', 38),
(489, 'นิคมน้ำอูน', 36),
(149, 'นิคมพัฒนา', 12),
(316, 'น้ำขุ่น', 23),
(569, 'น้ำปาด', 42),
(369, 'น้ำพอง', 29),
(299, 'น้ำยืน', 23),
(713, 'น้ำหนาว', 55),
(284, 'น้ำเกลี้ยง', 22),
(401, 'น้ำโสม', 30),
(437, 'บรบือ', 33),
(636, 'บรรพตพิสัย', 48),
(910, 'บันนังสตา', 76),
(227, 'บัวลาย', 19),
(265, 'บัวเชด', 21),
(209, 'บัวใหญ่', 19),
(58, 'บางกรวย', 3),
(688, 'บางกระทุ่ม', 53),
(865, 'บางกล่ำ', 71),
(794, 'บางขัน', 64),
(760, 'บางคนที', 61),
(168, 'บางคล้า', 15),
(82, 'บางซ้าย', 5),
(169, 'บางน้ำเปรี้ยว', 15),
(60, 'บางบัวทอง', 3),
(74, 'บางบาล', 5),
(52, 'บางบ่อ', 2),
(742, 'บางปลาม้า', 58),
(170, 'บางปะกง', 15),
(76, 'บางปะหัน', 5),
(75, 'บางปะอิน', 5),
(53, 'บางพลี', 2),
(697, 'บางมูลนาก', 54),
(687, 'บางระกำ', 53),
(105, 'บางระจัน', 8),
(134, 'บางละมุง', 11),
(773, 'บางสะพาน', 63),
(774, 'บางสะพานน้อย', 63),
(753, 'บางเลน', 59),
(56, 'บางเสาธง', 2),
(893, 'บางแก้ว', 74),
(721, 'บางแพ', 56),
(59, 'บางใหญ่', 3),
(73, 'บางไทร', 5),
(918, 'บาเจาะ', 77),
(332, 'บำเหน็จณรงค์', 25),
(349, 'บึงกาฬ', 27),
(702, 'บึงนาราง', 54),
(280, 'บึงบูรพ์', 22),
(712, 'บึงสามพัน', 55),
(664, 'บึงสามัคคี', 50),
(354, 'บึงโขงหลง', 27),
(300, 'บุณฑริก', 23),
(356, 'บุ่งคล้า', 27),
(140, 'บ่อทอง', 11),
(728, 'บ่อพลอย', 57),
(594, 'บ่อเกลือ', 44),
(163, 'บ่อไร่', 14),
(237, 'บ้านกรวด', 20),
(725, 'บ้านคา', 56),
(146, 'บ้านค่าย', 12),
(143, 'บ้านฉาง', 12),
(399, 'บ้านดุง', 30),
(250, 'บ้านด่าน', 20),
(676, 'บ้านด่านลานหอย', 52),
(667, 'บ้านตาก', 51),
(828, 'บ้านตาขุน', 68),
(551, 'บ้านธิ', 40),
(187, 'บ้านนา', 17),
(831, 'บ้านนาสาร', 68),
(832, 'บ้านนาเดิม', 68),
(132, 'บ้านบึง', 11),
(400, 'บ้านผือ', 30),
(364, 'บ้านฝาง', 29),
(492, 'บ้านม่วง', 36),
(767, 'บ้านลาด', 62),
(181, 'บ้านสร้าง', 16),
(123, 'บ้านหมอ', 10),
(98, 'บ้านหมี่', 7),
(585, 'บ้านหลวง', 44),
(327, 'บ้านเขว้า', 25),
(202, 'บ้านเหลื่อม', 19),
(336, 'บ้านแท่น', 25),
(504, 'บ้านแพง', 37),
(85, 'บ้านแพรก', 5),
(758, 'บ้านแพ้ว', 60),
(768, 'บ้านแหลม', 62),
(386, 'บ้านแฮด', 29),
(571, 'บ้านโคก', 42),
(720, 'บ้านโป่ง', 56),
(171, 'บ้านโพธิ์', 15),
(547, 'บ้านโฮ่ง', 40),
(248, 'บ้านใหม่ไชยพจน์', 20),
(372, 'บ้านไผ่', 29),
(652, 'บ้านไร่', 49),
(603, 'ปง', 45),
(447, 'ปทุมรัตต์', 34),
(344, 'ปทุมราชวงศา', 26),
(408, 'ประจักษ์ศิลปาคม', 30),
(182, 'ประจันตคาม', 16),
(210, 'ประทาย', 19),
(236, 'ประโคนชัย', 20),
(276, 'ปรางค์กู่', 22),
(775, 'ปราณบุรี', 63),
(257, 'ปราสาท', 21),
(147, 'ปลวกแดง', 12),
(502, 'ปลาปาก', 37),
(806, 'ปลายพระยา', 65),
(241, 'ปะคำ', 20),
(846, 'ปะทิว', 70),
(899, 'ปะนาเระ', 75),
(878, 'ปะเหลียน', 73),
(211, 'ปักธงชัย', 19),
(587, 'ปัว', 44),
(353, 'ปากคาด', 27),
(412, 'ปากชม', 31),
(218, 'ปากช่อง', 19),
(723, 'ปากท่อ', 56),
(789, 'ปากพนัง', 64),
(186, 'ปากพลี', 17),
(890, 'ปากพะยูน', 74),
(62, 'ปากเกร็ด', 3),
(631, 'ปางมะผ้า', 47),
(663, 'ปางศิลาทอง', 50),
(627, 'ปาย', 47),
(550, 'ป่าซาง', 40),
(321, 'ป่าติ้ว', 24),
(892, 'ป่าบอน', 74),
(894, 'ป่าพยอม', 74),
(612, 'ป่าแดด', 46),
(88, 'ป่าโมก', 6),
(77, 'ผักไห่', 5),
(420, 'ผาขาว', 31),
(528, 'ฝาง', 39),
(618, 'พญาเม็งราย', 46),
(829, 'พนม', 68),
(266, 'พนมดงรัก', 21),
(734, 'พนมทวน', 57),
(172, 'พนมสารคาม', 15),
(450, 'พนมไพร', 34),
(136, 'พนัสนิคม', 11),
(345, 'พนา', 26),
(672, 'พบพระ', 51),
(439, 'พยัคฆภูมิพิสัย', 33),
(641, 'พยุหะคีรี', 48),
(289, 'พยุห์', 22),
(486, 'พรรณานิคม', 36),
(779, 'พรหมคีรี', 64),
(107, 'พรหมบุรี', 8),
(689, 'พรหมพิราม', 53),
(225, 'พระทองคำ', 19),
(70, 'พระนครศรีอยุธยา', 5),
(54, 'พระประแดง', 2),
(797, 'พระพรหม', 64),
(126, 'พระพุทธบาท', 10),
(365, 'พระยืน', 29),
(55, 'พระสมุทรเจดีย์', 2),
(835, 'พระแสง', 68),
(660, 'พรานกระต่าย', 50),
(350, 'พรเจริญ', 27),
(530, 'พร้าว', 39),
(374, 'พล', 29),
(244, 'พลับพลาชัย', 20),
(849, 'พะโต๊ะ', 70),
(487, 'พังโคน', 36),
(94, 'พัฒนานิคม', 7),
(611, 'พาน', 46),
(135, 'พานทอง', 11),
(572, 'พิชัย', 42),
(305, 'พิบูลมังสาหาร', 23),
(406, 'พิบูลย์รักษ์', 30),
(782, 'พิปูน', 64),
(212, 'พิมาย', 19),
(755, 'พุทธมณฑล', 59),
(238, 'พุทไธสง', 20),
(836, 'พุนพิน', 68),
(570, 'ฟากท่า', 42),
(339, 'ภักดีชุมพล', 25),
(78, 'ภาชี', 5),
(418, 'ภูกระดึง', 31),
(606, 'ภูกามยาว', 45),
(605, 'ภูซาง', 45),
(382, 'ภูผาม่าน', 29),
(500, 'ภูพาน', 36),
(286, 'ภูสิงห์', 22),
(419, 'ภูหลวง', 31),
(335, 'ภูเขียว', 25),
(596, 'ภูเพียง', 44),
(415, 'ภูเรือ', 31),
(378, 'ภูเวียง', 29),
(128, 'มวกเหล็ก', 10),
(322, 'มหาชนะชัย', 24),
(84, 'มหาราช', 5),
(154, 'มะขาม', 13),
(874, 'มะนัง', 72),
(379, 'มัญจาคีรี', 29),
(900, 'มายอ', 75),
(111, 'มโนรมย์', 9),
(303, 'ม่วงสามสิบ', 23),
(905, 'ยะรัง', 75),
(904, 'ยะหริ่ง', 75),
(912, 'ยะหา', 76),
(271, 'ยางชุมน้อย', 22),
(471, 'ยางตลาด', 35),
(442, 'ยางสีสุราช', 33),
(919, 'ยี่งอ', 77),
(877, 'ย่านตาขาว', 73),
(920, 'ระแงะ', 77),
(858, 'ระโนด', 71),
(259, 'รัตนบุรี', 21),
(430, 'รัตนวาปี', 32),
(860, 'รัตภูมิ', 71),
(883, 'รัษฎา', 73),
(173, 'ราชสาส์น', 15),
(913, 'รามัน', 76),
(278, 'ราษีไศล', 22),
(921, 'รือเสาะ', 77),
(468, 'ร่องคำ', 35),
(790, 'ร่อนพิบูลย์', 64),
(576, 'ร้องกวาง', 43),
(577, 'ลอง', 43),
(872, 'ละงู', 72),
(235, 'ละหานทราย', 20),
(840, 'ละอุ่น', 69),
(848, 'ละแม', 70),
(573, 'ลับแล', 42),
(79, 'ลาดบัวหลวง', 5),
(642, 'ลาดยาว', 48),
(67, 'ลาดหลุมแก้ว', 4),
(661, 'ลานกระบือ', 50),
(780, 'ลานสกา', 64),
(653, 'ลานสัก', 49),
(263, 'ลำดวน', 21),
(226, 'ลำทะเมนชัย', 19),
(807, 'ลำทับ', 65),
(239, 'ลำปลายมาศ', 20),
(68, 'ลำลูกกา', 4),
(102, 'ลำสนธิ', 7),
(548, 'ลี้', 40),
(348, 'ลืออำนาจ', 26),
(704, 'วชิรบารมี', 54),
(145, 'วังจันทร์', 12),
(581, 'วังชิ้น', 43),
(694, 'วังทรายพูน', 54),
(691, 'วังทอง', 53),
(80, 'วังน้อย', 5),
(222, 'วังน้ำเขียว', 19),
(192, 'วังน้ำเย็น', 18),
(129, 'วังม่วง', 10),
(512, 'วังยาง', 37),
(881, 'วังวิเศษ', 73),
(197, 'วังสมบูรณ์', 18),
(417, 'วังสะพุง', 31),
(398, 'วังสามหมอ', 30),
(285, 'วังหิน', 22),
(674, 'วังเจ้า', 51),
(559, 'วังเหนือ', 41),
(714, 'วังโป่ง', 55),
(193, 'วัฒนานคร', 18),
(112, 'วัดสิงห์', 9),
(724, 'วัดเพลง', 56),
(690, 'วัดโบสถ์', 53),
(490, 'วานรนิวาส', 36),
(440, 'วาปีปทุม', 33),
(488, 'วาริชภูมิ', 36),
(304, 'วารินชำราบ', 23),
(838, 'วิภาวดี', 68),
(121, 'วิหารแดง', 10),
(709, 'วิเชียรบุรี', 55),
(91, 'วิเศษชัยชาญ', 6),
(518, 'ว่านใหญ่', 38),
(267, 'ศรีณรงค์', 21),
(397, 'ศรีธาตุ', 30),
(682, 'ศรีนคร', 52),
(895, 'ศรีนครินทร์', 74),
(891, 'ศรีบรรพต', 74),
(360, 'ศรีบุญเรือง', 28),
(743, 'ศรีประจันต์', 58),
(183, 'ศรีมหาโพธิ', 16),
(184, 'ศรีมโหสถ', 16),
(283, 'ศรีรัตนะ', 22),
(137, 'ศรีราชา', 11),
(355, 'ศรีวิไล', 27),
(508, 'ศรีสงคราม', 37),
(460, 'ศรีสมเด็จ', 34),
(729, 'ศรีสวัสดิ์', 57),
(679, 'ศรีสัชนาลัย', 52),
(922, 'ศรีสาคร', 77),
(680, 'ศรีสำโรง', 52),
(426, 'ศรีเชียงใหม่', 32),
(710, 'ศรีเทพ', 55),
(293, 'ศรีเมืองใหม่', 23),
(291, 'ศิลาลาด', 22),
(261, 'ศีขรภูมิ', 21),
(240, 'สตึก', 20),
(853, 'สทิงพระ', 71),
(260, 'สนม', 21),
(174, 'สนามชัยเขต', 15),
(563, 'สบปราบ', 41),
(630, 'สบเมย', 47),
(477, 'สมเด็จ', 35),
(114, 'สรรคบุรี', 9),
(113, 'สรรพยา', 9),
(100, 'สระโบสถ์', 7),
(428, 'สระใคร', 32),
(403, 'สร้างคอม', 30),
(718, 'สวนผึ้ง', 56),
(681, 'สวรรคโลก', 52),
(850, 'สวี', 70),
(315, 'สว่างวีระวงศ์', 23),
(649, 'สว่างอารมณ์', 49),
(494, 'สว่างแดนดิน', 36),
(473, 'สหัสขันธ์', 35),
(580, 'สอง', 43),
(745, 'สองพี่น้อง', 58),
(595, 'สองแคว', 44),
(156, 'สอยดาว', 13),
(857, 'สะบ้าย้อย', 71),
(861, 'สะเดา', 71),
(527, 'สะเมิง', 39),
(733, 'สังขละบุรี', 57),
(262, 'สังขะ', 21),
(427, 'สังคม', 32),
(139, 'สัตหีบ', 11),
(532, 'สันกำแพง', 39),
(593, 'สันติสุข', 44),
(533, 'สันทราย', 39),
(531, 'สันป่าตอง', 39),
(701, 'สากเหล็ก', 54),
(699, 'สามง่าม', 54),
(479, 'สามชัย', 35),
(746, 'สามชุก', 58),
(754, 'สามพราน', 59),
(777, 'สามร้อยยอด', 63),
(668, 'สามเงา', 51),
(92, 'สามโก้', 6),
(69, 'สามโคก', 4),
(902, 'สายบุรี', 75),
(538, 'สารภี', 39),
(308, 'สำโรง', 23),
(264, 'สำโรงทาบ', 21),
(866, 'สิงหนคร', 71),
(791, 'สิชล', 64),
(310, 'สิรินธร', 23),
(879, 'สิเกา', 73),
(217, 'สีคิ้ว', 19),
(368, 'สีชมพู', 29),
(228, 'สีดา', 19),
(843, 'สุขสำราญ', 69),
(924, 'สุคิริน', 77),
(361, 'สุวรรณคูหา', 28),
(455, 'สุวรรณภูมิ', 34),
(926, 'สุไหงปาดี', 77),
(925, 'สุไหงโก-ลก', 77),
(215, 'สูงเนิน', 19),
(578, 'สูงเม่น', 43),
(495, 'ส่องดาว', 36),
(234, 'หนองกี่', 20),
(476, 'หนองกุงศรี', 35),
(651, 'หนองขาหย่าง', 49),
(898, 'หนองจิก', 75),
(650, 'หนองฉาง', 49),
(385, 'หนองนาคำ', 29),
(635, 'หนองบัว', 48),
(333, 'หนองบัวระเหว', 25),
(330, 'หนองบัวแดง', 25),
(219, 'หนองบุญมาก', 19),
(737, 'หนองปรือ', 57),
(453, 'หนองพอก', 34),
(116, 'หนองมะโมง', 9),
(103, 'หนองม่วง', 7),
(582, 'หนองม่วงไข่', 43),
(391, 'หนองวัวซอ', 30),
(377, 'หนองสองห้อง', 29),
(519, 'หนองสูง', 38),
(243, 'หนองหงส์', 20),
(764, 'หนองหญ้าปล้อง', 62),
(748, 'หนองหญ้าไซ', 58),
(394, 'หนองหาน', 30),
(422, 'หนองหิน', 31),
(463, 'หนองฮี', 34),
(366, 'หนองเรือ', 29),
(66, 'หนองเสือ', 4),
(120, 'หนองแค', 10),
(122, 'หนองแซง', 10),
(404, 'หนองแสง', 30),
(125, 'หนองโดน', 10),
(133, 'หนองใหญ่', 11),
(711, 'หนองไผ่', 55),
(847, 'หลังสวน', 70),
(707, 'หล่มสัก', 55),
(708, 'หล่มเก่า', 55),
(115, 'หันคา', 9),
(347, 'หัวตะพาน', 26),
(776, 'หัวหิน', 63),
(793, 'หัวไทร', 64),
(534, 'หางดง', 39),
(884, 'หาดสำราญ', 73),
(862, 'หาดใหญ่', 71),
(738, 'ห้วยกระเจา', 57),
(654, 'ห้วยคต', 49),
(281, 'ห้วยทับทัน', 22),
(478, 'ห้วยผึ้ง', 35),
(880, 'ห้วยยอด', 73),
(245, 'ห้วยราช', 20),
(472, 'ห้วยเม็ก', 35),
(213, 'ห้วยแถลง', 19),
(564, 'ห้างฉัตร', 41),
(188, 'องครักษ์', 17),
(537, 'อมก๋อย', 39),
(194, 'อรัญประเทศ', 18),
(761, 'อัมพวา', 61),
(493, 'อากาศอำนวย', 36),
(458, 'อาจสามารถ', 34),
(109, 'อินทร์บุรี', 8),
(83, 'อุทัย', 5),
(279, 'อุทุมพรพิสัย', 22),
(370, 'อุบลรัตน์', 29),
(673, 'อุ้มผาง', 51),
(747, 'อู่ทอง', 58),
(805, 'อ่าวลึก', 65),
(535, 'ฮอด', 39),
(446, 'เกษตรวิสัย', 34),
(329, 'เกษตรสมบูรณ์', 25),
(165, 'เกาะกูด', 14),
(555, 'เกาะคา', 41),
(141, 'เกาะจันทร์', 11),
(166, 'เกาะช้าง', 14),
(824, 'เกาะพะงัน', 68),
(810, 'เกาะยาว', 66),
(803, 'เกาะลันตา', 65),
(823, 'เกาะสมุย', 68),
(138, 'เกาะสีชัง', 11),
(637, 'เก้าเลี้ยว', 48),
(18, 'เขต คลองสาน', 1),
(46, 'เขต คลองสามวา', 1),
(33, 'เขต คลองเตย', 1),
(43, 'เขต คันนายาว', 1),
(30, 'เขต จตุจักร', 1),
(35, 'เขต จอมทอง', 1),
(36, 'เขต ดอนเมือง', 1),
(26, 'เขต ดินแดง', 1),
(2, 'เขต ดุสิต', 1),
(19, 'เขต ตลิ่งชัน', 1),
(48, 'เขต ทวีวัฒนา', 1),
(49, 'เขต ทุ่งครุ', 1),
(15, 'เขต ธนบุรี', 1),
(20, 'เขต บางกอกน้อย', 1),
(16, 'เขต บางกอกใหญ่', 1),
(6, 'เขต บางกะปิ', 1),
(21, 'เขต บางขุนเทียน', 1),
(31, 'เขต บางคอแหลม', 1),
(29, 'เขต บางซื่อ', 1),
(47, 'เขต บางนา', 1),
(50, 'เขต บางบอน', 1),
(25, 'เขต บางพลัด', 1),
(4, 'เขต บางรัก', 1),
(5, 'เขต บางเขน', 1),
(40, 'เขต บางแค', 1),
(27, 'เขต บึงกุ่ม', 1),
(7, 'เขต ปทุมวัน', 1),
(32, 'เขต ประเวศ', 1),
(8, 'เขต ป้อมปราบศัตรูพ่าย', 1),
(14, 'เขต พญาไท', 1),
(1, 'เขต พระนคร', 1),
(9, 'เขต พระโขนง', 1),
(22, 'เขต ภาษีเจริญ', 1),
(10, 'เขต มีนบุรี', 1),
(12, 'เขต ยานนาวา', 1),
(37, 'เขต ราชเทวี', 1),
(24, 'เขต ราษฎร์บูรณะ', 1),
(11, 'เขต ลาดกระบัง', 1),
(38, 'เขต ลาดพร้าว', 1),
(45, 'เขต วังทองหลาง', 1),
(39, 'เขต วัฒนา', 1),
(34, 'เขต สวนหลวง', 1),
(44, 'เขต สะพานสูง', 1),
(13, 'เขต สัมพันธวงศ์', 1),
(28, 'เขต สาทร', 1),
(42, 'เขต สายไหม', 1),
(3, 'เขต หนองจอก', 1),
(23, 'เขต หนองแขม', 1),
(41, 'เขต หลักสี่', 1),
(17, 'เขต ห้วยขวาง', 1),
(296, 'เขมราฐ', 23),
(268, 'เขวาสินรินทร์', 21),
(159, 'เขาคิชฌกูฏ', 13),
(715, 'เขาค้อ', 55),
(195, 'เขาฉกรรจ์', 18),
(148, 'เขาชะเมา', 12),
(887, 'เขาชัยสน', 74),
(802, 'เขาพนม', 65),
(763, 'เขาย้อย', 62),
(470, 'เขาวง', 35),
(162, 'เขาสมิง', 14),
(381, 'เขาสวนกวาง', 29),
(295, 'เขื่องใน', 23),
(833, 'เคียนซา', 68),
(498, 'เจริญศิลป์', 36),
(928, 'เจาะไอร้อง', 77),
(130, 'เฉลิมพระเกียรติ', 10),
(229, 'เฉลิมพระเกียรติ', 19),
(252, 'เฉลิมพระเกียรติ', 20),
(597, 'เฉลิมพระเกียรติ', 44),
(800, 'เฉลิมพระเกียรติ', 64),
(591, 'เชียงกลาง', 44),
(462, 'เชียงขวัญ', 34),
(609, 'เชียงของ', 46),
(411, 'เชียงคาน', 31),
(600, 'เชียงคำ', 45),
(523, 'เชียงดาว', 39),
(601, 'เชียงม่วน', 45),
(436, 'เชียงยืน', 33),
(614, 'เชียงแสน', 46),
(783, 'เชียรใหญ่', 64),
(352, 'เซกา', 27),
(297, 'เดชอุดม', 23),
(740, 'เดิมบางนางบวช', 58),
(579, 'เด่นชัย', 43),
(496, 'เต่างอย', 36),
(560, 'เถิน', 41),
(334, 'เทพสถิต', 25),
(856, 'เทพา', 71),
(223, 'เทพารักษ์', 19),
(610, 'เทิง', 46),
(117, 'เนินขาม', 9),
(692, 'เนินมะปราง', 53),
(340, 'เนินสง่า', 25),
(288, 'เบญจลักษ์', 22),
(909, 'เบตง', 76),
(373, 'เปือยน้อย', 29),
(429, 'เฝ้าไร่', 32),
(402, 'เพ็ญ', 30),
(459, 'เมยวดี', 34),
(801, 'เมืองกระบี่', 65),
(726, 'เมืองกาญจนบุรี', 57),
(465, 'เมืองกาฬสินธุ์', 35),
(655, 'เมืองกำแพงเพชร', 50),
(363, 'เมืองขอนแก่น', 29),
(150, 'เมืองจันทบุรี', 13),
(287, 'เมืองจันทร์', 22),
(167, 'เมืองฉะเชิงเทรา', 15),
(131, 'เมืองชลบุรี', 11),
(110, 'เมืองชัยนาท', 9),
(326, 'เมืองชัยภูมิ', 25),
(844, 'เมืองชุมพร', 70),
(875, 'เมืองตรัง', 73),
(160, 'เมืองตราด', 14),
(666, 'เมืองตาก', 51),
(185, 'เมืองนครนายก', 17),
(749, 'เมืองนครปฐม', 59),
(501, 'เมืองนครพนม', 37),
(198, 'เมืองนครราชสีมา', 19),
(778, 'เมืองนครศรีธรรมราช', 64),
(632, 'เมืองนครสวรรค์', 48),
(57, 'เมืองนนทบุรี', 3),
(916, 'เมืองนราธิวาส', 77),
(583, 'เมืองน่าน', 44),
(230, 'เมืองบุรีรัมย์', 20),
(63, 'เมืองปทุมธานี', 4),
(770, 'เมืองประจวบคีรีขันธ์', 63),
(178, 'เมืองปราจีนบุรี', 16),
(896, 'เมืองปัตตานี', 75),
(565, 'เมืองปาน', 41),
(598, 'เมืองพะเยา', 45),
(809, 'เมืองพังงา', 66),
(885, 'เมืองพัทลุง', 74),
(693, 'เมืองพิจิตร', 54),
(684, 'เมืองพิษณุโลก', 53),
(817, 'เมืองภูเก็ต', 67),
(432, 'เมืองมหาสารคาม', 33),
(513, 'เมืองมุกดาหาร', 38),
(908, 'เมืองยะลา', 76),
(224, 'เมืองยาง', 19),
(317, 'เมืองยโสธร', 24),
(839, 'เมืองระนอง', 69),
(142, 'เมืองระยอง', 12),
(716, 'เมืองราชบุรี', 56),
(445, 'เมืองร้อยเอ็ด', 34),
(93, 'เมืองลพบุรี', 7),
(553, 'เมืองลำปาง', 41),
(545, 'เมืองลำพูน', 40),
(270, 'เมืองศรีสะเกษ', 22),
(483, 'เมืองสกลนคร', 36),
(852, 'เมืองสงขลา', 71),
(868, 'เมืองสตูล', 72),
(51, 'เมืองสมุทรปราการ', 2),
(759, 'เมืองสมุทรสงคราม', 61),
(756, 'เมืองสมุทรสาคร', 60),
(456, 'เมืองสรวง', 34),
(118, 'เมืองสระบุรี', 10),
(189, 'เมืองสระแก้ว', 18),
(104, 'เมืองสิงห์บุรี', 8),
(739, 'เมืองสุพรรณบุรี', 58),
(820, 'เมืองสุราษฎร์ธานี', 68),
(253, 'เมืองสุรินทร์', 21),
(675, 'เมืองสุโขทัย', 52),
(423, 'เมืองหนองคาย', 32),
(357, 'เมืองหนองบัวลำภู', 28),
(342, 'เมืองอำนาจเจริญ', 26),
(389, 'เมืองอุดรธานี', 30),
(566, 'เมืองอุตรดิตถ์', 42),
(647, 'เมืองอุทัยธานี', 49),
(292, 'เมืองอุบลราชธานี', 23),
(86, 'เมืองอ่างทอง', 6),
(607, 'เมืองเชียงราย', 46),
(520, 'เมืองเชียงใหม่', 39),
(762, 'เมืองเพชรบุรี', 62),
(705, 'เมืองเพชรบูรณ์', 55),
(409, 'เมืองเลย', 31),
(575, 'เมืองแพร่', 43),
(625, 'เมืองแม่ฮ่องสอน', 47),
(506, 'เรณูนคร', 37),
(735, 'เลาขวัญ', 57),
(324, 'เลิงนกทา', 24),
(608, 'เวียงชัย', 46),
(617, 'เวียงป่าเป้า', 46),
(834, 'เวียงสระ', 68),
(589, 'เวียงสา', 44),
(552, 'เวียงหนองล่อง', 40),
(388, 'เวียงเก่า', 29),
(623, 'เวียงเชียงรุ้ง', 46),
(619, 'เวียงแก่น', 46),
(539, 'เวียงแหง', 39),
(81, 'เสนา', 5),
(346, 'เสนางคนิคม', 26),
(556, 'เสริมงาม', 41),
(454, 'เสลภูมิ', 34),
(127, 'เสาไห้', 10),
(200, 'เสิงสาง', 19),
(808, 'เหนือคลอง', 65),
(314, 'เหล่าเสือโก้ก', 23),
(421, 'เอราวัณ', 31),
(433, 'แกดำ', 33),
(144, 'แกลง', 12),
(769, 'แก่งกระจาน', 62),
(119, 'แก่งคอย', 10),
(157, 'แก่งหางแมว', 13),
(337, 'แก้งคร้อ', 25),
(220, 'แก้งสนามนาง', 19),
(251, 'แคนดง', 20),
(558, 'แจ้ห่ม', 41),
(175, 'แปลงยาว', 15),
(584, 'แม่จริม', 44),
(613, 'แม่จัน', 46),
(562, 'แม่ทะ', 41),
(546, 'แม่ทา', 40),
(561, 'แม่พริก', 41),
(621, 'แม่ฟ้าหลวง', 46),
(669, 'แม่ระมาด', 51),
(526, 'แม่ริม', 39),
(907, 'แม่ลาน', 75),
(629, 'แม่ลาน้อย', 47),
(622, 'แม่ลาว', 46),
(644, 'แม่วงก์', 48),
(541, 'แม่วาง', 39),
(616, 'แม่สรวย', 46),
(671, 'แม่สอด', 51),
(628, 'แม่สะเรียง', 47),
(615, 'แม่สาย', 46),
(542, 'แม่ออน', 39),
(529, 'แม่อาย', 39),
(645, 'แม่เปิน', 48),
(554, 'แม่เมาะ', 41),
(522, 'แม่แจ่ม', 39),
(525, 'แม่แตง', 39),
(604, 'แม่ใจ', 45),
(376, 'แวงน้อย', 29),
(375, 'แวงใหญ่', 29),
(923, 'แว้ง', 77),
(90, 'แสวงหา', 6),
(164, 'แหลมงอบ', 14),
(155, 'แหลมสิงห์', 13),
(633, 'โกรกพระ', 48),
(665, 'โกสัมพีนคร', 50),
(434, 'โกสุมพิสัย', 33),
(294, 'โขงเจียม', 23),
(497, 'โคกศรีสุพรรณ', 36),
(95, 'โคกสำโรง', 7),
(196, 'โคกสูง', 18),
(101, 'โคกเจริญ', 7),
(897, 'โคกโพธิ์', 75),
(384, 'โคกโพธิ์ไชย', 29),
(204, 'โชคชัย', 19),
(351, 'โซ่พิสัย', 27),
(282, 'โนนคูณ', 22),
(249, 'โนนดินแดง', 20),
(269, 'โนนนารายณ์', 21),
(387, 'โนนศิลา', 29),
(393, 'โนนสะอาด', 30),
(359, 'โนนสัง', 28),
(246, 'โนนสุวรรณ', 20),
(207, 'โนนสูง', 19),
(221, 'โนนแดง', 19),
(206, 'โนนไทย', 19),
(153, 'โป่งน้ำร้อน', 13),
(698, 'โพทะเล', 54),
(722, 'โพธาราม', 56),
(452, 'โพธิ์ชัย', 34),
(431, 'โพธิ์ตาก', 32),
(89, 'โพธิ์ทอง', 6),
(695, 'โพธิ์ประทับช้าง', 54),
(290, 'โพธิ์ศรีสุวรรณ', 22),
(307, 'โพธิ์ไทร', 23),
(457, 'โพนทราย', 34),
(451, 'โพนทอง', 34),
(499, 'โพนนาแก้ว', 36),
(425, 'โพนพิสัย', 32),
(510, 'โพนสวรรค์', 37),
(540, 'ไชยปราการ', 39),
(396, 'ไชยวาน', 30),
(825, 'ไชยา', 68),
(87, 'ไชโย', 6),
(325, 'ไทยเจริญ', 24),
(656, 'ไทรงาม', 50),
(61, 'ไทรน้อย', 3),
(727, 'ไทรโยค', 57),
(275, 'ไพรบึง', 22),
(640, 'ไพศาลี', 48),
(903, 'ไม้แก่น', 75);

-- --------------------------------------------------------

--
-- Table structure for table `db-emailtype`
--

CREATE TABLE `db-emailtype` (
  `ETID` int(11) NOT NULL,
  `Type` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-emailtype`
--

INSERT INTO `db-emailtype` (`ETID`, `Type`) VALUES
(1, 'gmail.com'),
(2, 'ku.ac.th'),
(3, 'ku.th');

-- --------------------------------------------------------

--
-- Table structure for table `db-farm`
--

CREATE TABLE `db-farm` (
  `FMID` int(11) NOT NULL,
  `Name` varchar(50) NOT NULL,
  `Alias` varchar(15) NOT NULL,
  `Icon` varchar(20) NOT NULL,
  `Address` text NOT NULL,
  `AD3ID` int(11) NOT NULL,
  `UFID` int(11) NOT NULL,
  `IsCoordinate` tinyint(1) NOT NULL DEFAULT 0,
  `Latitude` float NOT NULL,
  `Longitude` float NOT NULL,
  `ModifyDT` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-farm`
--

INSERT INTO `db-farm` (`FMID`, `Name`, `Alias`, `Icon`, `Address`, `AD3ID`, `UFID`, `IsCoordinate`, `Latitude`, `Longitude`, `ModifyDT`) VALUES
(1, 'รุ่งอรุณ เจริญทิพย์ สวนปาล์ม', 'รุ่งอรุณ', '1910621840.png', '57/58 หมู่ 8 ', 1023, 1, 1, 12.8153, 101.491, '2019-10-19 11:44:58');

-- --------------------------------------------------------

--
-- Table structure for table `db-farmer`
--

CREATE TABLE `db-farmer` (
  `UFID` int(11) NOT NULL,
  `Title` enum('1','2','3') NOT NULL,
  `FirstName` varchar(25) NOT NULL,
  `LastName` varchar(30) NOT NULL,
  `FormalID` varchar(20) NOT NULL,
  `Icon` varchar(20) NOT NULL,
  `Address` text NOT NULL,
  `AD3ID` int(11) NOT NULL,
  `IsBlock` tinyint(1) DEFAULT NULL,
  `ModifyDT` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-farmer`
--

INSERT INTO `db-farmer` (`UFID`, `Title`, `FirstName`, `LastName`, `FormalID`, `Icon`, `Address`, `AD3ID`, `IsBlock`, `ModifyDT`) VALUES
(1, '1', 'โสภณ', 'โตใหญ่', '1129900513221', '1810621819.png', '67 หมู่ 7', 306, 0, '2019-10-18 11:19:32');

-- --------------------------------------------------------

--
-- Table structure for table `db-fercondition`
--

CREATE TABLE `db-fercondition` (
  `FID` int(11) NOT NULL,
  `Order` int(11) NOT NULL,
  `Condition` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-fercondition`
--

INSERT INTO `db-fercondition` (`FID`, `Order`, `Condition`) VALUES
(4, 4, 'asd'),
(4, 3, 'awd'),
(4, 1, 'fef'),
(4, 2, 'sd'),
(7, 1, '5'),
(8, 2, '254'),
(8, 1, '43'),
(10, 1, '45');

-- --------------------------------------------------------

--
-- Table structure for table `db-fertilizer`
--

CREATE TABLE `db-fertilizer` (
  `FID` int(11) NOT NULL,
  `Name` varchar(25) NOT NULL,
  `Alias` varchar(25) NOT NULL,
  `Icon` varchar(20) NOT NULL,
  `Start` varchar(4) NOT NULL DEFAULT '0101',
  `End` varchar(4) NOT NULL DEFAULT '3112',
  `Modify` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `Usage` enum('1','2','3') NOT NULL,
  `Unit` enum('1','2') NOT NULL,
  `EQ1` float NOT NULL,
  `EQ2` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-fertilizer`
--

INSERT INTO `db-fertilizer` (`FID`, `Name`, `Alias`, `Icon`, `Start`, `End`, `Modify`, `Usage`, `Unit`, `EQ1`, `EQ2`) VALUES
(4, 'sdsds', 'dss', '1572935671.jpg', '1401', '3112', '2019-11-05 07:41:09', '1', '1', 0, 0),
(5, 'mabin2sddddddddddd', 'sdddsdddddeeeeeeeeeeeeee', '1572935680.jpg', '0101', '3112', '2019-11-05 06:34:40', '1', '1', 0, 0),
(6, 'rr', 'rrrr', '1572937676.jpg', '0101', '3112', '2019-11-05 07:07:56', '1', '1', 0, 0),
(7, 'ed2', 'ed2', '1572939927.jpg', '0101', '3112', '2019-11-05 07:47:56', '1', '1', 555, 2),
(8, 'pinto', '2584', '1572940130.jpg', '0101', '3112', '2019-11-05 07:48:50', '1', '1', 0, 0),
(9, ' sdsds', 'sdsd', '1572942015.jpg', '0101', '3112', '2019-11-05 08:20:15', '1', '1', 0, 0),
(10, 'กระต่าย', 'กต', '1572942275.jpg', '0101', '3112', '2019-11-05 08:30:01', '1', '2', 5, 0);

-- --------------------------------------------------------

--
-- Table structure for table `db-pestlist`
--

CREATE TABLE `db-pestlist` (
  `PID` int(11) NOT NULL,
  `Name` varchar(50) NOT NULL,
  `Alias` varchar(50) NOT NULL,
  `PTID` int(11) NOT NULL,
  `Charactor` text NOT NULL,
  `Danger` text NOT NULL,
  `lcon` varchar(20) NOT NULL,
  `NumPicChar` int(11) NOT NULL DEFAULT 0,
  `NumPicDanger` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-pestlist`
--

INSERT INTO `db-pestlist` (`PID`, `Name`, `Alias`, `PTID`, `Charactor`, `Danger`, `lcon`, `NumPicChar`, `NumPicDanger`) VALUES
(1, 'Acanthocoris scabrator (Fabricius)', 'squash bug', 1, 'ทั้งตัวอ่อนและตัวเต็มวัยดูดกินอยู่บนพืชต้นเดียวกัน โดยมากจะอาศัยอยู่ใต้ใบและดอก', ' ตัวอ่อนและตัวเต็มวัยดูดกินน้ำเลี้ยงจากต้น ใบและเมล็ดอ่อน ส่วนของพืชที่ถูกทำลาย: ผล,ใบ,ยอด,ลำต้น', '1810621829.png', 3, 1),
(2, 'Trialeurodes vaporariorum  Westwood, 1856', 'greenhouse whitefly', 1, 'ทั้งตัวอ่อนและตัวเต็มวัยเข้าทำลายพืชได้ทุกระยะ ', ' ดูดกินน้ำเลี้ยงบริเวณใต้ใบพืชทำให้พืชอ่อนแอเจริญเติบโตผิดปรกติส่วนของพืชที่ถูกทำลาย: ใบ,ผล,ช่อดอก,ลำต้น', '1810621832.png', 3, 2);

-- --------------------------------------------------------

--
-- Table structure for table `db-pesttype`
--

CREATE TABLE `db-pesttype` (
  `PTID` int(11) NOT NULL,
  `TypeTH` varchar(50) NOT NULL,
  `TypeEN` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-pesttype`
--

INSERT INTO `db-pesttype` (`PTID`, `TypeTH`, `TypeEN`) VALUES
(1, 'แมลงศัตรูพืช', 'insect pest '),
(2, 'โรคพืช ', 'plant disease '),
(3, 'วัชพืช ', 'weed '),
(4, 'ศัตรูพืชอื่นๆ ', 'other pests ');

-- --------------------------------------------------------

--
-- Table structure for table `db-province`
--

CREATE TABLE `db-province` (
  `AD1ID` int(11) NOT NULL,
  `Province` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-province`
--

INSERT INTO `db-province` (`AD1ID`, `Province`) VALUES
(65, 'กระบี่'),
(1, 'กรุงเทพมหานคร'),
(57, 'กาญจนบุรี'),
(35, 'กาฬสินธุ์'),
(50, 'กำแพงเพชร'),
(29, 'ขอนแก่น'),
(13, 'จันทบุรี'),
(15, 'ฉะเชิงเทรา'),
(11, 'ชลบุรี'),
(9, 'ชัยนาท'),
(25, 'ชัยภูมิ'),
(70, 'ชุมพร'),
(73, 'ตรัง'),
(14, 'ตราด'),
(51, 'ตาก'),
(17, 'นครนายก'),
(59, 'นครปฐม'),
(37, 'นครพนม'),
(19, 'นครราชสีมา'),
(64, 'นครศรีธรรมราช'),
(48, 'นครสวรรค์'),
(3, 'นนทบุรี'),
(77, 'นราธิวาส'),
(44, 'น่าน'),
(27, 'บึงกาฬ'),
(20, 'บุรีรัมย์'),
(4, 'ปทุมธานี'),
(63, 'ประจวบคีรีขันธ์'),
(16, 'ปราจีนบุรี'),
(75, 'ปัตตานี'),
(5, 'พระนครศรีอยุธยา'),
(45, 'พะเยา'),
(66, 'พังงา'),
(74, 'พัทลุง'),
(54, 'พิจิตร'),
(53, 'พิษณุโลก'),
(67, 'ภูเก็ต'),
(33, 'มหาสารคาม'),
(38, 'มุกดาหาร'),
(76, 'ยะลา'),
(24, 'ยโสธร'),
(69, 'ระนอง'),
(12, 'ระยอง'),
(56, 'ราชบุรี'),
(34, 'ร้อยเอ็ด'),
(7, 'ลพบุรี'),
(41, 'ลำปาง'),
(40, 'ลำพูน'),
(22, 'ศรีสะเกษ'),
(36, 'สกลนคร'),
(71, 'สงขลา'),
(72, 'สตูล'),
(2, 'สมุทรปราการ'),
(61, 'สมุทรสงคราม'),
(60, 'สมุทรสาคร'),
(10, 'สระบุรี'),
(18, 'สระแก้ว'),
(8, 'สิงห์บุรี'),
(58, 'สุพรรณบุรี'),
(68, 'สุราษฎร์ธานี'),
(21, 'สุรินทร์'),
(52, 'สุโขทัย'),
(32, 'หนองคาย'),
(28, 'หนองบัวลำภู'),
(26, 'อำนาจเจริญ'),
(30, 'อุดรธานี'),
(42, 'อุตรดิตถ์'),
(49, 'อุทัยธานี'),
(23, 'อุบลราชธานี'),
(6, 'อ่างทอง'),
(46, 'เชียงราย'),
(39, 'เชียงใหม่'),
(62, 'เพชรบุรี'),
(55, 'เพชรบูรณ์'),
(31, 'เลย'),
(43, 'แพร่'),
(47, 'แม่ฮ่องสอน');

-- --------------------------------------------------------

--
-- Table structure for table `db-subdistrinct`
--

CREATE TABLE `db-subdistrinct` (
  `AD3ID` int(11) NOT NULL,
  `subDistrinct` varchar(30) NOT NULL,
  `AD2ID` int(11) NOT NULL,
  `Latitude` float NOT NULL,
  `Longitude` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-subdistrinct`
--

INSERT INTO `db-subdistrinct` (`AD3ID`, `subDistrinct`, `AD2ID`, `Latitude`, `Longitude`) VALUES
(1, 'พระบรมมหาราชวัง', 1, 13.751, 100.492),
(2, 'วังบูรพาภิรมย์', 1, 13.744, 100.499),
(3, 'วัดราชบพิธ', 1, 13.75, 100.499),
(4, 'สำราญราษฎร์', 1, 13.751, 100.503),
(5, 'ศาลเจ้าพ่อเสือ', 1, 13.754, 100.497),
(6, 'เสาชิงช้า', 1, 13.753, 100.5),
(7, 'บวรนิเวศ', 1, 13.757, 100.501),
(8, 'ตลาดยอด', 1, 13.76, 100.498),
(9, 'ชนะสงคราม', 1, 13.762, 100.495),
(10, 'บ้านพานถม', 1, 13.762, 100.503),
(11, 'บางขุนพรหม', 1, 13.765, 100.505),
(12, 'วัดสามพระยา', 1, 13.768, 100.499),
(13, 'ดุสิต', 2, 13.772, 100.513),
(14, 'วชิรพยาบาล', 2, 13.778, 100.505),
(15, 'สวนจิตรลดา', 2, 13.767, 100.52),
(16, 'สี่แยกมหานาค', 2, 13.758, 100.517),
(17, 'ถนนนครไชยศรี', 2, 13.789, 100.522),
(18, 'กระทุ่มราย', 3, 13.823, 100.897),
(19, 'หนองจอก', 3, 13.869, 100.885),
(20, 'คลองสิบ', 3, 13.914, 100.82),
(21, 'คลองสิบสอง', 3, 13.914, 100.88),
(22, 'โคกแฝด', 3, 13.84, 100.836),
(23, 'คู้ฝั่งเหนือ', 3, 13.872, 100.81),
(24, 'ลำผักชี', 3, 13.797, 100.844),
(25, 'ลำต้อยติ่ง', 3, 13.781, 100.877),
(26, 'มหาพฤฒาราม', 4, 13.734, 100.52),
(27, 'สีลม', 4, 13.73, 100.525),
(28, 'สุริยวงศ์', 4, 13.724, 100.53),
(29, 'บางรัก', 4, 13.727, 100.527),
(30, 'สี่พระยา', 4, 13.725, 100.514),
(31, 'อนุสาวรีย์', 5, 13.868, 100.606),
(32, 'ท่าแร้ง', 5, 13.866, 100.65),
(33, 'คลองจั่น', 6, 13.786, 100.635),
(34, 'หัวหมาก', 6, 13.756, 100.66),
(35, 'รองเมือง', 7, 13.744, 100.52),
(36, 'วังใหม่', 7, 13.742, 100.526),
(37, 'ปทุมวัน', 7, 13.74, 100.535),
(38, 'ลุมพินี', 7, 13.736, 100.546),
(39, 'ป้อมปราบ', 8, 13.743, 100.514),
(40, 'วัดเทพศิรินทร์', 8, 13.749, 100.512),
(41, 'คลองมหานาค', 8, 13.753, 100.513),
(42, 'บ้านบาตร', 8, 13.752, 100.507),
(43, 'วัดโสมนัส', 8, 13.759, 100.511),
(44, 'บางจาก', 9, 13.692, 100.626),
(45, 'มีนบุรี', 10, 13.804, 100.723),
(46, 'แสนแสบ', 10, 13.812, 100.774),
(47, 'ลาดกระบัง', 11, 13.723, 100.771),
(48, 'คลองสองต้นนุ่น', 11, 13.753, 100.723),
(49, 'คลองสามประเวศ', 11, 13.753, 100.754),
(50, 'ลำปลาทิว', 11, 13.765, 100.817),
(51, 'ทับยาว', 11, 13.728, 100.815),
(52, 'ขุมทอง', 11, 13.736, 100.855),
(53, 'ช่องนนทรี', 12, 13.682, 100.533),
(54, 'บางโพงพาง', 12, 13.697, 100.544),
(55, 'จักรวรรดิ', 13, 13.741, 100.504),
(56, 'สัมพันธวงศ์', 13, 13.739, 100.511),
(57, 'ตลาดน้อย', 13, 13.734, 100.513),
(58, 'สามเสนใน', 14, 13.782, 100.545),
(59, 'วัดกัลยาณ์', 15, 13.737, 100.493),
(60, 'หิรัญรูจี', 15, 13.731, 100.49),
(61, 'บางยี่เรือ', 15, 13.72, 100.482),
(62, 'บุคคโล', 15, 13.707, 100.486),
(63, 'ตลาดพลู', 15, 13.715, 100.473),
(64, 'วัดอรุณ', 16, 13.743, 100.486),
(65, 'วัดท่าพระ', 16, 13.733, 100.475),
(66, 'ห้วยขวาง', 17, 13.769, 100.577),
(67, 'บางกะปิ', 17, 13.752, 100.586),
(68, 'สามเสนนอก', 17, 13.796, 100.579),
(69, 'สมเด็จเจ้าพระยา', 18, 13.731, 100.497),
(70, 'คลองสาน', 18, 13.735, 100.504),
(71, 'บางลำภูล่าง', 18, 13.715, 100.501),
(72, 'คลองต้นไทร', 18, 13.725, 100.508),
(73, 'คลองชักพระ', 19, 13.76, 100.456),
(74, 'ตลิ่งชัน', 19, 13.789, 100.459),
(75, 'ฉิมพลี', 19, 13.786, 100.432),
(76, 'บางพรม', 19, 13.752, 100.442),
(77, 'บางระมาด', 19, 13.767, 100.431),
(78, 'บางเชือกหนัง', 19, 13.751, 100.419),
(79, 'ศิริราช', 20, 13.759, 100.481),
(80, 'บ้านช่างหล่อ', 20, 13.752, 100.477),
(81, 'บางขุนนนท์', 20, 13.774, 100.466),
(82, 'บางขุนศรี', 20, 13.76, 100.463),
(83, 'อรุณอมรินทร์', 20, 13.772, 100.477),
(84, 'ท่าข้าม', 21, 13.555, 100.434),
(85, 'แสมดำ', 21, 13.605, 100.395),
(86, 'บางหว้า', 22, 13.714, 100.443),
(87, 'บางด้วน', 22, 13.723, 100.437),
(88, 'บางจาก', 22, 13.727, 100.45),
(89, 'บางแวก', 22, 13.736, 100.445),
(90, 'คลองขวาง', 22, 13.738, 100.423),
(91, 'ปากคลองภาษีเจริญ', 22, 13.722, 100.464),
(92, 'คูหาสวรรค์', 22, 13.727, 100.457),
(93, 'หนองแขม', 23, 13.68, 100.358),
(94, 'หนองค้างพลู', 23, 13.714, 100.351),
(95, 'ราษฎร์บูรณะ', 24, 13.67, 100.51),
(96, 'บางปะกอก', 24, 13.675, 100.491),
(97, 'บางพลัด', 25, 13.791, 100.487),
(98, 'บางอ้อ', 25, 13.802, 100.512),
(99, 'บางบำหรุ', 25, 13.781, 100.482),
(100, 'บางยี่ขัน', 25, 13.774, 100.492),
(101, 'ดินแดง', 26, 13.778, 100.567),
(102, 'คลองกุ่ม', 27, 13.808, 100.65),
(103, 'ทุ่งวัดดอน', 28, 13.71, 100.532),
(104, 'ยานนาวา', 28, 13.714, 100.514),
(105, 'ทุ่งมหาเมฆ', 28, 13.718, 100.541),
(106, 'บางซื่อ', 29, 13.82, 100.529),
(107, 'ลาดยาว', 30, 13.826, 100.565),
(108, 'บางคอแหลม', 31, 13.696, 100.494),
(109, 'วัดพระยาไกร', 31, 13.706, 100.508),
(110, 'บางโคล่', 31, 13.694, 100.516),
(111, 'ประเวศ', 32, 13.719, 100.664),
(112, 'หนองบอน', 32, 13.687, 100.656),
(113, 'ดอกไม้', 32, 13.68, 100.689),
(114, 'คลองเตย', 33, 13.71, 100.57),
(115, 'คลองตัน', 33, 13.723, 100.571),
(116, 'พระโขนง', 33, 13.707, 100.595),
(117, 'สวนหลวง', 34, 13.726, 100.628),
(118, 'บางขุนเทียน', 35, 13.694, 100.45),
(119, 'บางค้อ', 35, 13.702, 100.476),
(120, 'บางมด', 35, 13.672, 100.468),
(121, 'จอมทอง', 35, 13.693, 100.468),
(122, 'สีกัน', 36, 13.925, 100.593),
(123, 'ทุ่งพญาไท', 37, 13.763, 100.53),
(124, 'ถนนพญาไท', 37, 13.757, 100.538),
(125, 'ถนนเพชรบุรี', 37, 13.752, 100.559),
(126, 'มักกะสัน', 37, 13.752, 100.528),
(127, 'ลาดพร้าว', 38, 13.811, 100.612),
(128, 'จรเข้บัว', 38, 13.84, 100.6),
(129, 'คลองเตยเหนือ', 39, 13.743, 100.56),
(130, 'คลองตันเหนือ', 39, 13.736, 100.576),
(131, 'พระโขนงเหนือ', 39, 13.719, 100.596),
(132, 'บางแค', 40, 13.698, 100.409),
(133, 'บางแคเหนือ', 40, 13.72, 100.4),
(134, 'บางไผ่', 40, 13.741, 100.385),
(135, 'หลักสอง', 40, 13.683, 100.396),
(136, 'ทุ่งสองห้อง', 41, 13.883, 100.564),
(137, 'ตลาดบางเขน', 41, 13.871, 100.58),
(138, 'สายไหม', 42, 13.921, 100.654),
(139, 'ออเงิน', 42, 13.896, 100.672),
(140, 'คลองถนน', 42, 13.898, 100.63),
(141, 'คันนายาว', 43, 13.821, 100.677),
(142, 'สะพานสูง', 44, 13.761, 100.688),
(143, 'วังทองหลาง', 45, 13.779, 100.609),
(144, 'สามวาตะวันตก', 46, 13.889, 100.708),
(145, 'สามวาตะวันออก', 46, 13.896, 100.76),
(146, 'บางชัน', 46, 13.839, 100.7),
(147, 'ทรายกองดิน', 46, 13.854, 100.745),
(148, 'ทรายกองดินใต้', 46, 13.861, 100.786),
(149, 'บางนา', 47, 13.672, 100.616),
(150, 'ทวีวัฒนา', 48, 13.758, 100.348),
(151, 'ศาลาธรรมสพน์', 48, 13.783, 100.39),
(152, 'บางมด', 49, 13.651, 100.51),
(153, 'ทุ่งครุ', 49, 13.614, 100.497),
(154, 'บางบอน', 50, 13.646, 100.37),
(155, 'เทศบาลนครสมุทรปราการ', 51, 13.593, 100.597),
(156, 'สำโรงเหนือ', 51, 13.649, 100.617),
(157, 'บางเมือง', 51, 13.601, 100.622),
(158, 'ท้ายบ้าน', 51, 13.556, 100.599),
(159, 'ท้ายบ้านใหม่', 51, 13.572, 100.621),
(160, 'บางปูใหม่', 51, 13.526, 100.67),
(161, 'แพรกษา', 51, 13.564, 100.653),
(162, 'บางโปรง', 51, 13.623, 100.565),
(163, 'เทศบาลบางปู', 51, 13.51, 100.751),
(164, 'บางด้วน', 51, 13.622, 100.581),
(165, 'เทศบาลบางเมือง', 51, 13.622, 100.605),
(166, 'เทพารักษ์', 51, 13.634, 100.61),
(167, 'แพรกษาใหม่', 51, 13.559, 100.691),
(168, 'บางบ่อ', 52, 13.611, 100.862),
(169, 'บ้านระกาศ', 52, 13.639, 100.904),
(170, 'บางพลีน้อย', 52, 13.574, 100.9),
(171, 'บางเพรียง', 52, 13.545, 100.805),
(172, 'คลองด่าน', 52, 13.511, 100.835),
(173, 'คลองสวน', 52, 13.659, 100.925),
(174, 'เปร็ง', 52, 13.672, 100.881),
(175, 'คลองนิยมยาตรา', 52, 13.624, 100.935),
(176, 'บางพลีใหญ่', 53, 13.618, 100.694),
(177, 'บางแก้ว', 53, 13.642, 100.662),
(178, 'บางปลา', 53, 13.561, 100.739),
(179, 'บางโฉลง', 53, 13.623, 100.755),
(180, 'ราชาเทวะ', 53, 13.681, 100.733),
(181, 'หนองปรือ', 53, 13.678, 100.75),
(182, 'เทศบาลเมืองพระประแดง', 54, 13.656, 100.533),
(183, 'ตลาด', 54, 13.671, 100.52),
(184, 'บางจาก', 54, 13.616, 100.536),
(185, 'บางครุ', 54, 13.631, 100.526),
(186, 'บางหญ้าแพรก', 54, 13.645, 100.546),
(187, 'บางหัวเสือ', 54, 13.625, 100.549),
(188, 'เทศบาลสำโรงใต้', 54, 13.641, 100.573),
(189, 'บางยอ', 54, 13.679, 100.558),
(190, 'บางกะเจ้า', 54, 13.697, 100.561),
(191, 'บางน้ำผึ้ง', 54, 13.679, 100.578),
(192, 'บางกระสอบ', 54, 13.666, 100.566),
(193, 'บางกอบัว', 54, 13.693, 100.577),
(194, 'ทรงคนอง', 54, 13.665, 100.545),
(195, 'สำโรง', 54, 13.659, 100.584),
(196, 'สำโรงกลาง', 54, 13.653, 100.564),
(197, 'นาเกลือ', 55, 13.53, 100.494),
(198, 'บ้านคลองสวน', 55, 13.571, 100.476),
(199, 'แหลมฟ้าผ่า', 55, 13.539, 100.559),
(200, 'ปากคลองบางปลากด', 55, 13.606, 100.567),
(201, 'ในคลองบางปลากด', 55, 13.588, 100.541),
(202, 'บางเสาธง', 56, 13.6, 100.815),
(203, 'ศรีษะจรเข้น้อย', 56, 13.689, 100.799),
(204, 'ศรีษะจรเข้ใหญ่', 56, 13.641, 100.803),
(205, 'สวนใหญ่', 57, 13.842, 100.494),
(206, 'ตลาดขวัญ', 57, 13.85, 100.509),
(207, 'บางเขน', 57, 13.835, 100.516),
(208, 'บางกระสอ', 57, 13.869, 100.491),
(209, 'ท่าทราย', 57, 13.884, 100.501),
(210, 'บางไผ่', 57, 13.823, 100.492),
(211, 'บางศรีเมือง', 57, 13.841, 100.475),
(212, 'บางกร่าง', 57, 13.835, 100.438),
(213, 'ไทรม้า', 57, 13.87, 100.472),
(214, 'บางรักน้อย', 57, 13.859, 100.464),
(215, 'วัดชลอ', 58, 13.802, 100.476),
(216, 'บางกรวย', 58, 13.809, 100.499),
(217, 'บางสีทอง', 58, 13.818, 100.479),
(218, 'บางขนุน', 58, 13.811, 100.453),
(219, 'บางขุนกอง', 58, 13.821, 100.444),
(220, 'บางคูเวียง', 58, 13.822, 100.417),
(221, 'มหาสวัสดิ์', 58, 13.806, 100.434),
(222, 'ปลายบาง', 58, 13.814, 100.402),
(223, 'ศาลากลาง', 58, 13.81, 100.358),
(224, 'บางม่วง', 59, 13.838, 100.406),
(225, 'บางแม่นาง', 59, 13.868, 100.381),
(226, 'บางเลน', 59, 13.854, 100.434),
(227, 'เสาธงหิน', 59, 13.875, 100.404),
(228, 'บางใหญ่', 59, 13.837, 100.375),
(229, 'บ้านใหม่', 59, 13.861, 100.333),
(230, 'โสนลอย', 60, 13.914, 100.422),
(231, 'บางบัวทอง', 60, 13.944, 100.39),
(232, 'บางรักใหญ่', 60, 13.878, 100.438),
(233, 'บางคูรัด', 60, 13.907, 100.351),
(234, 'ละหาร', 60, 13.964, 100.401),
(235, 'ลำโพ', 60, 13.97, 100.416),
(236, 'พิมลราช', 60, 13.934, 100.366),
(237, 'บางรักพัฒนา', 60, 13.894, 100.41),
(238, 'ไทรน้อย', 61, 13.976, 100.344),
(239, 'ราษฎร์นิยม', 61, 14.088, 100.329),
(240, 'หนองเพรางาย', 61, 13.906, 100.322),
(241, 'ไทรใหญ่', 61, 14.085, 100.292),
(242, 'ขุนศรี', 61, 14.005, 100.287),
(243, 'คลองขวาง', 61, 14.004, 100.306),
(244, 'ทวีวัฒนา', 61, 13.942, 100.312),
(245, 'ปากเกร็ด', 62, 13.912, 100.506),
(246, 'บางตลาด', 62, 13.896, 100.521),
(247, 'บ้านใหม่', 62, 13.93, 100.546),
(248, 'บางพูด', 62, 13.927, 100.516),
(249, 'บางตะไนย์', 62, 13.931, 100.492),
(250, 'คลองพระอุดม', 62, 13.93, 100.479),
(251, 'ท่าอิฐ', 62, 13.894, 100.48),
(252, 'เกาะเกร็ด', 62, 13.91, 100.472),
(253, 'อ้อมเกร็ด', 62, 13.909, 100.453),
(254, 'คลองข่อย', 62, 13.959, 100.45),
(255, 'บางพลับ', 62, 13.929, 100.458),
(256, 'คลองเกลือ', 62, 13.902, 100.55),
(257, 'บางปรอก', 63, 14.012, 100.528),
(258, 'บ้านใหม่', 63, 13.963, 100.553),
(259, 'บ้านกลาง', 63, 14.001, 100.558),
(260, 'บ้านฉาง', 63, 14.029, 100.507),
(261, 'บ้านกระแชง', 63, 14.031, 100.552),
(262, 'บางขะแยง', 63, 13.967, 100.523),
(263, 'บางคูวัด', 63, 13.963, 100.495),
(264, 'บางหลวง', 63, 14.007, 100.509),
(265, 'บางเดื่อ', 63, 13.99, 100.487),
(266, 'บางพูด', 63, 14.035, 100.572),
(267, 'บางพูน', 63, 13.988, 100.594),
(268, 'บางกะดี', 63, 13.983, 100.537),
(269, 'สวนพริกไทย', 63, 14.018, 100.568),
(270, 'หลักหก', 63, 13.963, 100.59),
(271, 'คลองหนึ่ง', 64, 14.066, 100.607),
(272, 'คลองสอง', 64, 14.079, 100.642),
(273, 'คลองสาม', 64, 14.087, 100.664),
(274, 'คลองสี่', 64, 14.097, 100.687),
(275, 'คลองห้า', 64, 14.106, 100.71),
(276, 'คลองหก', 64, 14.117, 100.733),
(277, 'คลองเจ็ด', 64, 14.125, 100.75),
(278, 'ประชาธิปัตย์', 65, 13.987, 100.632),
(279, 'บึงยี่โถ', 65, 13.999, 100.687),
(280, 'รังสิต', 65, 14.018, 100.731),
(281, 'ลำผักกูด', 65, 14.036, 100.779),
(282, 'บึงสนั่น', 65, 14.052, 100.824),
(283, 'บึงน้ำรักษ์', 65, 14.071, 100.88),
(284, 'บึงบา', 66, 14.112, 100.824),
(285, 'บึงบอน', 66, 14.087, 100.778),
(286, 'บึงกาสาม', 66, 14.2, 100.824),
(287, 'บึงชำอ้อ', 66, 14.172, 100.778),
(288, 'หนองสามวัง', 66, 14.13, 100.881),
(289, 'ศาลาครุ', 66, 14.244, 100.928),
(290, 'นพรัตน์', 66, 14.223, 100.866),
(291, 'ระแหง', 67, 14.059, 100.396),
(292, 'ลาดหลุมแก้ว', 67, 14.006, 100.41),
(293, 'คูบางหลวง', 67, 14.047, 100.467),
(294, 'คูขวาง', 67, 14.068, 100.437),
(295, 'คลองพระอุดม', 67, 13.99, 100.449),
(296, 'บ่อเงิน', 67, 14.102, 100.383),
(297, 'หน้าไม้', 67, 14.034, 100.359),
(298, 'คูคต', 68, 13.955, 100.641),
(299, 'ลาดสวาย', 68, 13.958, 100.685),
(300, 'บึงคำพร้อย', 68, 13.961, 100.731),
(301, 'ลำลูกกา', 68, 13.972, 100.774),
(302, 'บึงทองหลาง', 68, 13.984, 100.82),
(303, 'ลำไทร', 68, 13.973, 100.861),
(304, 'บึงคอไห', 68, 14.029, 100.862),
(305, 'พืชอุดม', 68, 13.975, 100.896),
(306, 'บางเตย', 69, 14.062, 100.504),
(307, 'คลองควาย', 69, 14.097, 100.478),
(308, 'สามโคก', 69, 14.052, 100.529),
(309, 'กระแชง', 69, 14.043, 100.544),
(310, 'บางโพธิ์เหนือ', 69, 14.042, 100.515),
(311, 'เชียงรากใหญ่', 69, 14.057, 100.574),
(312, 'บ้านปทุม', 69, 14.067, 100.546),
(313, 'บ้านงิ้ว', 69, 14.084, 100.539),
(314, 'เชียงรากน้อย', 69, 14.105, 100.567),
(315, 'บางกระบือ', 69, 14.103, 100.538),
(316, 'ท้ายเกาะ', 69, 14.105, 100.496),
(317, 'ประตูชัย', 70, 14.349, 100.551),
(318, 'กะมัง', 70, 14.341, 100.581),
(319, 'หอรัตนไชย', 70, 14.354, 100.578),
(320, 'หัวรอ', 70, 14.368, 100.578),
(321, 'ท่าวาสุกรี', 70, 14.361, 100.552),
(322, 'ไผ่ลิง', 70, 14.356, 100.589),
(323, 'ปากกราน', 70, 14.31, 100.532),
(324, 'ภูเขาทอง', 70, 14.365, 100.542),
(325, 'สำเภาล่ม', 70, 14.34, 100.57),
(326, 'สวนพริก', 70, 14.391, 100.558),
(327, 'คลองตะเคียน', 70, 14.331, 100.554),
(328, 'วัดตูม', 70, 14.39, 100.539),
(329, 'หันตรา', 70, 14.371, 100.6),
(330, 'ลุมพลี', 70, 14.376, 100.548),
(331, 'บ้านใหม่', 70, 14.39, 100.521),
(332, 'บ้านเกาะ', 70, 14.389, 100.582),
(333, 'คลองสวนพลู', 70, 14.334, 100.595),
(334, 'คลองสระบัว', 70, 14.371, 100.563),
(335, 'เกาะเรียน', 70, 14.318, 100.579),
(336, 'บ้านป้อม', 70, 14.347, 100.529),
(337, 'บ้านรุม', 70, 14.312, 100.559),
(338, 'ท่าเรือ', 71, 14.566, 100.719),
(339, 'จำปา', 71, 14.55, 100.741),
(340, 'ท่าหลวง', 71, 14.548, 100.764),
(341, 'บ้านร่อม', 71, 14.567, 100.698),
(342, 'ศาลาลอย', 71, 14.532, 100.7),
(343, 'วังแดง', 71, 14.541, 100.67),
(344, 'โพธิ์เอน', 71, 14.519, 100.676),
(345, 'ปากท่า', 71, 14.504, 100.692),
(346, 'หนองขนาก', 71, 14.512, 100.732),
(347, 'ท่าเจ้าสนุก', 71, 14.543, 100.717),
(348, 'นครหลวง', 72, 14.469, 100.622),
(349, 'ท่าช้าง', 72, 14.511, 100.652),
(350, 'บ่อโพง', 72, 14.406, 100.603),
(351, 'บ้านชุ้ง', 72, 14.458, 100.655),
(352, 'ปากจั่น', 72, 14.44, 100.62),
(353, 'บางระกำ', 72, 14.466, 100.589),
(354, 'บางพระครู', 72, 14.483, 100.613),
(355, 'แม่ลา', 72, 14.503, 100.619),
(356, 'หนองปลิง', 72, 14.423, 100.64),
(357, 'คลองสะแก', 72, 14.424, 100.604),
(358, 'สามไถ', 72, 14.489, 100.675),
(359, 'พระนอน', 72, 14.485, 100.65),
(360, 'บางไทร', 73, 14.191, 100.48),
(361, 'บางพลี', 73, 14.212, 100.465),
(362, 'สนามชัย', 73, 14.213, 100.522),
(363, 'บ้านแป้ง', 73, 14.232, 100.507),
(364, 'หน้าไม้', 73, 14.315, 100.462),
(365, 'บางยี่โท', 73, 14.299, 100.445),
(366, 'แคออก', 73, 14.305, 100.472),
(367, 'แคตก', 73, 14.287, 100.48),
(368, 'ช่างเหล็ก', 73, 14.278, 100.453),
(369, 'กระแชง', 73, 14.279, 100.505),
(370, 'บ้างกลึง', 73, 14.309, 100.499),
(371, 'ช้างน้อย', 73, 14.252, 100.505),
(372, 'ห่อหมก', 73, 14.259, 100.474),
(373, 'ไผ่พระ', 73, 14.222, 100.432),
(374, 'กกแก้วบูรพา', 73, 14.188, 100.435),
(375, 'ไม้ตรา', 73, 14.164, 100.473),
(376, 'บ้านม้า', 73, 14.141, 100.49),
(377, 'บ้านเกาะ', 73, 14.236, 100.46),
(378, 'ราชคราม', 73, 14.186, 100.519),
(379, 'ช้างใหญ่', 73, 14.161, 100.522),
(380, 'เชียงรากน้อย', 73, 14.134, 100.561),
(381, 'โคกช้าง', 73, 14.123, 100.492),
(382, 'บางบาล', 74, 14.41, 100.464),
(383, 'วัดยม', 74, 14.39, 100.497),
(384, 'ไทรน้อย', 74, 14.407, 100.486),
(385, 'สะพานไทย', 74, 14.363, 100.486),
(386, 'มหาพราหมณ์', 74, 14.364, 100.505),
(387, 'กบเจา', 74, 14.347, 100.485),
(388, 'บ้านคลัง', 74, 14.347, 100.457),
(389, 'พระขาว', 74, 14.328, 100.482),
(390, 'น้ำเต้า', 74, 14.339, 100.438),
(391, 'ทางช้าง', 74, 14.375, 100.432),
(392, 'วัดตะกู', 74, 14.388, 100.424),
(393, 'บางหลวง', 74, 14.403, 100.433),
(394, 'บางหลวงโดด', 74, 14.419, 100.43),
(395, 'บางหัก', 74, 14.436, 100.439),
(396, 'บางชะนี', 74, 14.429, 100.461),
(397, 'บ้านกุ่ม', 74, 14.436, 100.492),
(398, 'บ้านเลน', 75, 14.241, 100.598),
(399, 'เชียงรากน้อย', 75, 14.16, 100.594),
(400, 'บ้านโพ', 75, 14.272, 100.588),
(401, 'บ้านกรด', 75, 14.307, 100.604),
(402, 'บางกระสั้น', 75, 14.189, 100.565),
(403, 'คลองจิก', 75, 14.214, 100.597),
(404, 'บ้านหว้า', 75, 14.258, 100.616),
(405, 'วัดยม', 75, 14.26, 100.568),
(406, 'บางประแดง', 75, 14.288, 100.544),
(407, 'สามเรือน', 75, 14.292, 100.647),
(408, 'เกาะเกิด', 75, 14.206, 100.539),
(409, 'บ้านพลับ', 75, 14.223, 100.552),
(410, 'บ้านแป้ง', 75, 14.239, 100.557),
(411, 'คุ้งลาน', 75, 14.295, 100.621),
(412, 'ตลิ่งชัน', 75, 14.25, 100.642),
(413, 'บ้านสร้าง', 75, 14.289, 100.668),
(414, 'ขนอนหลวง', 75, 14.266, 100.542),
(415, 'บางปะหัน', 76, 14.458, 100.558),
(416, 'ขยาย', 76, 14.414, 100.564),
(417, 'บางเดื่อ', 76, 14.436, 100.576),
(418, 'เสาธง', 76, 14.496, 100.549),
(419, 'ทางกลาง', 76, 14.513, 100.544),
(420, 'บางเพลิง', 76, 14.5, 100.577),
(421, 'หันสัง', 76, 14.512, 100.517),
(422, 'บางนางร้า', 76, 14.474, 100.531),
(423, 'ตานิม', 76, 14.491, 100.532),
(424, 'ทับน้ำ', 76, 14.464, 100.508),
(425, 'บ้านม้า', 76, 14.492, 100.51),
(426, 'ขวัญเมือง', 76, 14.444, 100.536),
(427, 'บ้านลี่', 76, 14.449, 100.521),
(428, 'โพธิ์สามต้น', 76, 14.421, 100.547),
(429, 'พุทเลา', 76, 14.419, 100.525),
(430, 'ตาลเอน', 76, 14.524, 100.563),
(431, 'บ้านขล้อ', 76, 14.532, 100.586),
(432, 'ผักไห่', 77, 14.462, 100.379),
(433, 'อมฤต', 77, 14.472, 100.361),
(434, 'บ้านแค', 77, 14.495, 100.405),
(435, 'ลาดน้ำเค็ม', 77, 14.482, 100.393),
(436, 'ตาลาน', 77, 14.446, 100.387),
(437, 'ท่าดินแดง', 77, 14.416, 100.388),
(438, 'ดอนลาน', 77, 14.433, 100.286),
(439, 'นาคู', 77, 14.468, 100.272),
(440, 'กุฎี', 77, 14.439, 100.407),
(441, 'ลำตะเคียน', 77, 14.419, 100.318),
(442, 'โคกช้าง', 77, 14.5, 100.388),
(443, 'จักราช', 77, 14.447, 100.34),
(444, 'หนองน้ำใหญ่', 77, 14.474, 100.311),
(445, 'ลาดชิด', 77, 14.422, 100.358),
(446, 'หน้าโคก', 77, 14.49, 100.351),
(447, 'บ้านใหญ่', 77, 14.435, 100.384),
(448, 'ภาชี', 78, 14.442, 100.725),
(449, 'โคกม่วง', 78, 14.428, 100.75),
(450, 'ระโสม', 78, 14.39, 100.77),
(451, 'หนองน้ำใส', 78, 14.457, 100.751),
(452, 'ดอนหญ้านาง', 78, 14.478, 100.739),
(453, 'ไผ่ล้อม', 78, 14.474, 100.693),
(454, 'กระจิว', 78, 14.42, 100.69),
(455, 'พระแก้ว', 78, 14.44, 100.675),
(456, 'ลาดบัวหลวง', 79, 14.193, 100.319),
(457, 'หลักชัย', 79, 14.195, 100.277),
(458, 'สามเมือง', 79, 14.153, 100.297),
(459, 'พระยาบันลือ', 79, 14.161, 100.395),
(460, 'สิงหนาท', 79, 14.132, 100.423),
(461, 'คู้สลอด', 79, 14.196, 100.369),
(462, 'คลองพระยาบันลือ', 79, 14.134, 100.368),
(463, 'ลำตาเสา', 80, 14.275, 100.708),
(464, 'บ่อตาโล่', 80, 14.241, 100.674),
(465, 'วังน้อย', 80, 14.201, 100.699),
(466, 'ลำไทร', 80, 14.2, 100.641),
(467, 'สนับทึบ', 80, 14.298, 100.813),
(468, 'พยอม', 80, 14.166, 100.632),
(469, 'หันตะเภา', 80, 14.304, 100.78),
(470, 'ข้าวงาม', 80, 14.229, 100.758),
(471, 'วังจุฬา', 80, 14.249, 100.8),
(472, 'ชะแมบ', 80, 14.257, 100.748),
(473, 'เสนา', 81, 14.328, 100.404),
(474, 'บ้านแพน', 81, 14.342, 100.417),
(475, 'เจ้าเจ็ด', 81, 14.303, 100.378),
(476, 'สามกอ', 81, 14.306, 100.399),
(477, 'บางนมโค', 81, 14.292, 100.424),
(478, 'หัวเวียง', 81, 14.376, 100.402),
(479, 'มารวิชัย', 81, 14.24, 100.371),
(480, 'บ้านโพธิ์', 81, 14.351, 100.394),
(481, 'รางจรเข้', 81, 14.351, 100.366),
(482, 'บ้านกระทุ่ม', 81, 14.39, 100.383),
(483, 'บ้านแถว', 81, 14.301, 100.348),
(484, 'ชายนา', 81, 14.258, 100.348),
(485, 'สามตุ่ม', 81, 14.24, 100.406),
(486, 'ลาดงา', 81, 14.372, 100.358),
(487, 'ดอนทอง', 81, 14.24, 100.306),
(488, 'บ้านหลวง', 81, 14.278, 100.401),
(489, 'เจ้าเสด็จ', 81, 14.331, 100.363),
(490, 'บางซ้าย', 82, 14.314, 100.286),
(491, 'แก้วฟ้า', 82, 14.313, 100.326),
(492, 'เต่าเล่า', 82, 14.34, 100.319),
(493, 'ปลายกลัด', 82, 14.382, 100.315),
(494, 'เทพมงคล', 82, 14.236, 100.258),
(495, 'วังพัฒนา', 82, 14.272, 100.296),
(496, 'คานหาม', 83, 14.335, 100.641),
(497, 'บ้านช้าง', 83, 14.322, 100.68),
(498, 'สามบัณฑิต', 83, 14.349, 100.742),
(499, 'บ้านหีบ', 83, 14.372, 100.712),
(500, 'หนองไม้ซุง', 83, 14.376, 100.751),
(501, 'อุทัย', 83, 14.373, 100.655),
(502, 'เสนา', 83, 14.392, 100.689),
(503, 'หนองน้ำส้ม', 83, 14.32, 100.714),
(504, 'โพสาวหาญ', 83, 14.332, 100.759),
(505, 'ธนู', 83, 14.355, 100.622),
(506, 'ข้าวเม่า', 83, 14.379, 100.624),
(507, 'หัวไผ่', 84, 14.532, 100.525),
(508, 'กะทุ่ม', 84, 14.546, 100.556),
(509, 'มหาราช', 84, 14.552, 100.528),
(510, 'น้ำเต้า', 84, 14.566, 100.542),
(511, 'บางนา', 84, 14.576, 100.581),
(512, 'โรงช้าง', 84, 14.602, 100.563),
(513, 'เจ้าปลุก', 84, 14.584, 100.538),
(514, 'พิตเพียน', 84, 14.608, 100.544),
(515, 'บ้านนา', 84, 14.606, 100.51),
(516, 'บ้านขวาง', 84, 14.576, 100.518),
(517, 'ท่าตอ', 84, 14.556, 100.511),
(518, 'บ้านใหม่', 84, 14.531, 100.5),
(519, 'บ้านแพรก', 85, 14.64, 100.585),
(520, 'บ้านใหม่', 85, 14.655, 100.586),
(521, 'สำพะเนียง', 85, 14.638, 100.567),
(522, 'คลองน้อย', 85, 14.627, 100.553),
(523, 'สองห้อง', 85, 14.646, 100.519),
(524, 'ตลาดหลวง', 86, 14.592, 100.453),
(525, 'บางแก้ว', 86, 14.588, 100.459),
(526, 'ศาลาแดง', 86, 14.599, 100.445),
(527, 'ป่างิ้ว', 86, 14.612, 100.413),
(528, 'บ้านแห', 86, 14.565, 100.434),
(529, 'ตลาดกรวด', 86, 14.619, 100.478),
(530, 'มหาดไทย', 86, 14.568, 100.4),
(531, 'บ้านอิฐ', 86, 14.583, 100.476),
(532, 'หัวไผ่', 86, 14.553, 100.474),
(533, 'จำปาหล่อ', 86, 14.539, 100.433),
(534, 'โพสะ', 86, 14.542, 100.457),
(535, 'บ้านรี', 86, 14.605, 100.485),
(536, 'คลองวัว', 86, 14.578, 100.432),
(537, 'ย่านซื่อ', 86, 14.619, 100.447),
(538, 'จรเข้ร้อง', 87, 14.658, 100.482),
(539, 'ไชยภูมิ', 87, 14.705, 100.465),
(540, 'ชัยฤทธิ์', 87, 14.637, 100.472),
(541, 'เทวราช', 87, 14.646, 100.449),
(542, 'ราชสถิตย์', 87, 14.672, 100.456),
(543, 'ไชโย', 87, 14.707, 100.436),
(544, 'หลักฟ้า', 87, 14.684, 100.462),
(545, 'ชะไว', 87, 14.687, 100.494),
(546, 'ตรีณรงค์', 87, 14.676, 100.498),
(547, 'บางปลากด', 88, 14.509, 100.461),
(548, 'ป่าโมก', 88, 14.501, 100.437),
(549, 'สายทอง', 88, 14.513, 100.484),
(550, 'โรงช้าง', 88, 14.488, 100.472),
(551, 'บางเสด็จ', 88, 14.461, 100.473),
(552, 'นรสิงห์', 88, 14.518, 100.431),
(553, 'เอกราช', 88, 14.477, 100.426),
(554, 'โผงเผง', 88, 14.455, 100.442),
(555, 'อ่างแก้ว', 89, 14.666, 100.393),
(556, 'อินทประมูล', 89, 14.651, 100.425),
(557, 'บางพลับ', 89, 14.641, 100.406),
(558, 'หนองแม่ไก่', 89, 14.708, 100.351),
(559, 'รำมะสัก', 89, 14.679, 100.242),
(560, 'บางระกำ', 89, 14.691, 100.428),
(561, 'โพธิ์รังนก', 89, 14.614, 100.378),
(562, 'องครักษ์', 89, 14.731, 100.398),
(563, 'โคกพุทรา', 89, 14.689, 100.375),
(564, 'ยางซ้าย', 89, 14.658, 100.297),
(565, 'บ่อแร่', 89, 14.637, 100.372),
(566, 'ทางพระ', 89, 14.677, 100.36),
(567, 'สามง่าม', 89, 14.638, 100.389),
(568, 'บางเจ้าฉ่า', 89, 14.695, 100.398),
(569, 'คำหยาด', 89, 14.676, 100.323),
(570, 'แสวงหา', 90, 14.763, 100.31),
(571, 'ศรีพราน', 90, 14.725, 100.328),
(572, 'บ้านพราน', 90, 14.709, 100.306),
(573, 'วังน้ำเย็น', 90, 14.738, 100.221),
(574, 'สีบัวทอง', 90, 14.769, 100.248),
(575, 'ห้วยไผ่', 90, 14.789, 100.324),
(576, 'จำลอง', 90, 14.741, 100.364),
(577, 'ไผ่จำศีล', 91, 14.59, 100.366),
(578, 'ศาลเจ้าโรงทอง', 91, 14.597, 100.34),
(579, 'ไผ่ดำพัฒนา', 91, 14.529, 100.392),
(580, 'สาวร้องไห้', 91, 14.546, 100.223),
(581, 'ท่าช้าง', 91, 14.562, 100.333),
(582, 'ยี่ล้น', 91, 14.579, 100.301),
(583, 'บางจัก', 91, 14.502, 100.33),
(584, 'ห้วยคันแหลน', 91, 14.555, 100.294),
(585, 'คลองขนาก', 91, 14.53, 100.337),
(586, 'ไผ่วง', 91, 14.505, 100.251),
(587, 'สี่ร้อย', 91, 14.55, 100.37),
(588, 'ม่วงเตี้ย', 91, 14.636, 100.323),
(589, 'หัวตะพาน', 91, 14.583, 100.387),
(590, 'หลักแก้ว', 91, 14.517, 100.289),
(591, 'ตลาดใหม่', 91, 14.542, 100.315),
(592, 'สามโก้', 92, 14.606, 100.252),
(593, 'ราษฎรพัฒนา', 92, 14.605, 100.293),
(594, 'อบทม', 92, 14.581, 100.246),
(595, 'โพธิ์ม่วงพันธ์', 92, 14.561, 100.254),
(596, 'มงคลธรรมนิมิต', 92, 14.64, 100.26),
(597, 'ทะเลชุบศร', 93, 14.804, 100.634),
(598, 'ท่าหิน', 93, 14.802, 100.611),
(599, 'กกโก', 93, 14.767, 100.684),
(600, 'โก่งธนู', 93, 14.674, 100.597),
(601, 'เขาพระงาม', 93, 14.901, 100.67),
(602, 'เขาสามยอด', 93, 14.83, 100.671),
(603, 'โคกกระเทียม', 93, 14.89, 100.58),
(604, 'โคกลำพาน', 93, 14.74, 100.64),
(605, 'โคกตูม', 93, 14.866, 100.817),
(606, 'งิ้วราย', 93, 14.704, 100.592),
(607, 'ดอนโพธิ์', 93, 14.691, 100.627),
(608, 'ตะลุง', 93, 14.737, 100.601),
(609, 'ท่าแค', 93, 14.865, 100.619),
(610, 'ท่าศาลา', 93, 14.792, 100.671),
(611, 'นิคมสร้างตนเอง', 93, 14.824, 100.732),
(612, 'บางขันหมาก', 93, 14.82, 100.583),
(613, 'บ้านข่อย', 93, 14.683, 100.529),
(614, 'ท้ายตลาด', 93, 14.725, 100.563),
(615, 'ป่าตาล', 93, 14.778, 100.64),
(616, 'พรหมมาสตร์', 93, 14.82, 100.603),
(617, 'โพธิ์เก้าต้น', 93, 14.775, 100.599),
(618, 'โพธิ์ตรุ', 93, 14.725, 100.532),
(619, 'สี่คลอง', 93, 14.681, 100.563),
(620, 'ถนนใหญ่', 93, 14.831, 100.629),
(621, 'พัฒนานิคม', 94, 14.896, 100.966),
(622, 'ช่องสาริกา', 94, 14.802, 100.909),
(623, 'มะนาวหวาน', 94, 14.934, 101.093),
(624, 'ดีลัง', 94, 14.94, 100.852),
(625, 'โคกสลุง', 94, 15.01, 100.969),
(626, 'ชอนน้อย', 94, 14.795, 100.985),
(627, 'หนองบัว', 94, 14.851, 101.054),
(628, 'ห้วยขุนราม', 94, 14.951, 101.205),
(629, 'น้ำสุด', 94, 14.952, 101.146),
(630, 'โคกสำโรง', 95, 15.071, 100.713),
(631, 'เกาะแก้ว', 95, 15.136, 100.736),
(632, 'ถลุงเหล็ก', 95, 15.064, 100.68),
(633, 'หลุมข้าว', 95, 15.024, 100.642),
(634, 'ห้วยโป่ง', 95, 14.981, 100.677),
(635, 'คลองเกตุ', 95, 14.967, 100.802),
(636, 'สะแกราบ', 95, 15.12, 100.797),
(637, 'เพนียด', 95, 15.036, 100.812),
(638, 'วังเพลิง', 95, 15.062, 100.841),
(639, 'ดงมะรุม', 95, 15.127, 100.877),
(640, 'วังขอนขว้าง', 95, 15.023, 100.697),
(641, 'วังจั่น', 95, 15.102, 100.673),
(642, 'หนองแขม', 95, 15.143, 100.685),
(643, 'ลำนารายณ์', 96, 15.214, 101.146),
(644, 'ชัยนารายณ์', 96, 15.195, 101.037),
(645, 'ศิลาทิพย์', 96, 15.314, 101.087),
(646, 'ห้วยหิน', 96, 15.154, 101.044),
(647, 'ม่วงค่อม', 96, 15.078, 101.024),
(648, 'บัวชุม', 96, 15.176, 101.238),
(649, 'ท่าดินดำ', 96, 15.15, 101.134),
(650, 'มะกอกหวาน', 96, 15.059, 101.077),
(651, 'ซับตะเคียน', 96, 15.112, 101.327),
(652, 'นาโสม', 96, 15.245, 101.282),
(653, 'หนองยายโต๊ะ', 96, 15.22, 101.264),
(654, 'เกาะรัง', 96, 15.318, 101.251),
(655, 'ท่ามะนาว', 96, 15.187, 101.162),
(656, 'นิคมลำนารายณ์', 96, 15.264, 101.15),
(657, 'ชัยบาดาล', 96, 15.095, 101.058),
(658, 'บ้านใหม่สามัคคี', 96, 15.258, 101.022),
(659, 'เขาแหลม', 96, 15.126, 100.964),
(660, 'ท่าวุ้ง', 97, 14.82, 100.496),
(661, 'บางคู้', 97, 14.804, 100.529),
(662, 'โพตลาดแก้ว', 97, 14.795, 100.558),
(663, 'บางลี่', 97, 14.849, 100.526),
(664, 'บางงา', 97, 14.85, 100.492),
(665, 'โคกสลุด', 97, 14.881, 100.482),
(666, 'เขาสมอคอน', 97, 14.906, 100.447),
(667, 'หัวสำโรง', 97, 14.776, 100.494),
(668, 'ลาดสาลี', 97, 14.723, 100.487),
(669, 'มุจลินท์', 97, 14.876, 100.509),
(670, 'ไผ่ใหญ่', 98, 15.089, 100.459),
(671, 'บ้านทราย', 98, 15.034, 100.582),
(672, 'บ้านกล้วย', 98, 15.016, 100.578),
(673, 'ดงพลับ', 98, 15.059, 100.63),
(674, 'บ้านชี', 98, 14.947, 100.5),
(675, 'พุคา', 98, 14.953, 100.598),
(676, 'หินปัก', 98, 15.048, 100.592),
(677, 'บางพึ่ง', 98, 14.994, 100.496),
(678, 'หนองทรายขาว', 98, 14.996, 100.597),
(679, 'บางกะพี้', 98, 15.073, 100.613),
(680, 'หนองเต่า', 98, 14.963, 100.555),
(681, 'โพนทอง', 98, 15.04, 100.559),
(682, 'บางขาม', 98, 14.953, 100.457),
(683, 'ดอนดึง', 98, 15.146, 100.612),
(684, 'ชอนม่วง', 98, 15.21, 100.61),
(685, 'หนองกระเบียน', 98, 15.148, 100.534),
(686, 'สายห้วยแก้ว', 98, 15.095, 100.509),
(687, 'มหาสอน', 98, 15.021, 100.484),
(688, 'หนองเมือง', 98, 15.124, 100.569),
(689, 'สนามแจง', 98, 15.008, 100.538),
(690, 'ท่าหลวง', 99, 15.071, 101.117),
(691, 'แก่งผักกูด', 99, 15.014, 101.085),
(692, 'ซับจำปา', 99, 15.026, 101.228),
(693, 'หนองผักแว่น', 99, 15.119, 101.216),
(694, 'ทะเลวังวัด', 99, 15.023, 101.184),
(695, 'หัวลำ', 99, 15.029, 101.292),
(696, 'สระโบสถ์', 100, 15.224, 100.846),
(697, 'มหาโพธิ', 100, 15.289, 100.861),
(698, 'ทุ่งท่าช้าง', 100, 15.169, 100.817),
(699, 'ห้วยใหญ่', 100, 15.169, 100.793),
(700, 'นิยมชัย', 100, 15.183, 100.904),
(701, 'โคกเจริญ', 101, 15.408, 100.777),
(702, 'ยางราก', 101, 15.366, 100.935),
(703, 'หนองมะค่า', 101, 15.515, 100.839),
(704, 'วังทอง', 101, 15.469, 100.811),
(705, 'โคกแสมสาร', 101, 15.344, 100.85),
(706, 'ลำสนธิ', 102, 15.341, 101.362),
(707, 'ซับสมบูรณ์', 102, 15.193, 101.354),
(708, 'หนองรี', 102, 15.282, 101.319),
(709, 'กุดตาเพชร', 102, 15.523, 101.346),
(710, 'เขารวก', 102, 15.374, 101.33),
(711, 'เขาน้อย', 102, 15.112, 101.387),
(712, 'หนองม่วง', 103, 15.23, 100.664),
(713, 'บ่อทอง', 103, 15.293, 100.652),
(714, 'ดงดินแดง', 103, 15.385, 100.679),
(715, 'ชอนสมบูรณ์', 103, 15.288, 100.763),
(716, 'ยางโทน', 103, 15.248, 100.702),
(717, 'ชอนสารเดช', 103, 15.195, 100.709),
(718, 'บางพุทรา', 104, 14.89, 100.404),
(719, 'บางมัญ', 104, 14.916, 100.4),
(720, 'โพกรวม', 104, 14.944, 100.394),
(721, 'ม่วงหมู่', 104, 14.869, 100.432),
(722, 'หัวไผ่', 104, 14.965, 100.429),
(723, 'ต้นโพธิ์', 104, 14.869, 100.398),
(724, 'จักรสีห์', 104, 14.836, 100.398),
(725, 'บางกระบือ', 104, 14.907, 100.363),
(726, 'สิงห์', 105, 14.89, 100.338),
(727, 'ไม้ดัด', 105, 14.858, 100.345),
(728, 'เชิงกลัด', 105, 14.91, 100.269),
(729, 'โพชนไก่', 105, 14.929, 100.292),
(730, 'แม่ลา', 105, 14.941, 100.319),
(731, 'บ้านจ่า', 105, 14.852, 100.284),
(732, 'พักทัน', 105, 14.924, 100.22),
(733, 'สระแจง', 105, 14.873, 100.235),
(734, 'โพทะเล', 106, 14.829, 100.257),
(735, 'บางระจัน', 106, 14.799, 100.296),
(736, 'โพสังโฆ', 106, 14.833, 100.349),
(737, 'ท่าข้าม', 106, 14.827, 100.368),
(738, 'คอทราย', 106, 14.817, 100.281),
(739, 'หนองกระทุ่ม', 106, 14.82, 100.225),
(740, 'พระงาม', 107, 14.748, 100.422),
(741, 'พรหมบุรี', 107, 14.837, 100.451),
(742, 'บางน้ำเชี่ยว', 107, 14.783, 100.458),
(743, 'บ้านหม้อ', 107, 14.746, 100.461),
(744, 'บ้านแป้ง', 107, 14.811, 100.458),
(745, 'หัวป่า', 107, 14.831, 100.425),
(746, 'โรงช้าง', 107, 14.801, 100.425),
(747, 'ถอนสมอ', 108, 14.765, 100.384),
(748, 'โพประจักษ์', 108, 14.774, 100.36),
(749, 'วิหารขาว', 108, 14.801, 100.409),
(750, 'พิกุลทอง', 108, 14.772, 100.41),
(751, 'อินทร์บุรี', 109, 15.009, 100.329),
(752, 'ประศุก', 109, 15.042, 100.291),
(753, 'ทับยา', 109, 14.96, 100.334),
(754, 'งิ้วราย', 109, 14.988, 100.389),
(755, 'ชีน้ำร้าย', 109, 15.081, 100.331),
(756, 'ท่างาม', 109, 15.041, 100.343),
(757, 'น้ำตาล', 109, 14.976, 100.361),
(758, 'ทองเอน', 109, 15.046, 100.385),
(759, 'ห้วยชัน', 109, 15.019, 100.269),
(760, 'โพธิ์ชัย', 109, 15.027, 100.439),
(761, 'ในเมือง', 110, 15.181, 100.127),
(762, 'บ้านกล้วย', 110, 15.182, 100.153),
(763, 'ท่าชัย', 110, 15.163, 100.113),
(764, 'ชัยนาท', 110, 15.129, 100.151),
(765, 'เขาท่าพระ', 110, 15.218, 100.134),
(766, 'หาดท่าเสา', 110, 15.2, 100.079),
(767, 'ธรรมามูล', 110, 15.264, 100.133),
(768, 'เสือโฮก', 110, 15.238, 100.224),
(769, 'นางลือ', 110, 15.122, 100.082),
(770, 'คุ้งสำเภา', 111, 15.291, 100.091),
(771, 'วัดโคก', 111, 15.326, 100.107),
(772, 'ศิลาดาน', 111, 15.354, 100.122),
(773, 'ท่าฉนวน', 111, 15.379, 100.138),
(774, 'หางน้ำสาคร', 111, 15.292, 100.146),
(775, 'ไร่พัฒนา', 111, 15.333, 100.225),
(776, 'อู่ตะเภา', 111, 15.274, 100.219),
(777, 'วัดสิงห์', 112, 15.263, 100.041),
(778, 'มะขามเฒ่า', 112, 15.227, 100.04),
(779, 'หนองน้อย', 112, 15.177, 100.015),
(780, 'หนองบัว', 112, 15.283, 100.013),
(781, 'หนองขุ่น', 112, 15.235, 99.97),
(782, 'บ่อแร่', 112, 15.283, 99.958),
(783, 'วังหมัน', 112, 15.171, 99.916),
(784, 'สรรพยา', 113, 15.128, 100.233),
(785, 'ตลุก', 113, 15.195, 100.198),
(786, 'เขาแก้ว', 113, 15.142, 100.316),
(787, 'โพนางดำตก', 113, 15.084, 100.272),
(788, 'โพนางดำออก', 113, 15.12, 100.283),
(789, 'บางหลวง', 113, 15.143, 100.197),
(790, 'หาดอาษา', 113, 15.165, 100.262),
(791, 'แพรกศรีราชา', 114, 15.062, 100.107),
(792, 'เที่ยงแท้', 114, 15.089, 100.161),
(793, 'ห้วยกรด', 114, 15.096, 100.203),
(794, 'โพงาม', 114, 14.995, 100.249),
(795, 'บางขุด', 114, 14.991, 100.194),
(796, 'ดงคอน', 114, 14.976, 100.135),
(797, 'ดอนกำ', 114, 14.966, 100.236),
(798, 'ห้วยกรดพัฒนา', 114, 15.074, 100.228),
(799, 'หันคา', 115, 15.016, 99.998),
(800, 'บ้านเชี่ยน', 115, 14.942, 99.997),
(801, 'ไพรนกยูง', 115, 15.081, 99.856),
(802, 'หนองแซง', 115, 15.107, 99.973),
(803, 'ห้วยงู', 115, 15.072, 100.067),
(804, 'วังไก่เถื่อน', 115, 15.004, 100.056),
(805, 'เด่นใหญ่', 115, 15.017, 99.93),
(806, 'สามง่ามท่าโบสถ์', 115, 15.065, 100.026),
(807, 'หนองมะโมง', 116, 15.216, 99.772),
(808, 'วังตะเคียน', 116, 15.278, 99.802),
(809, 'สะพานหิน', 116, 15.197, 99.827),
(810, 'กุดจอก', 116, 15.241, 99.894),
(811, 'เนินขาม', 117, 14.957, 99.901),
(812, 'กะบกเตี้ย', 117, 15.036, 99.816),
(813, 'สุขเดือนห้า', 117, 14.968, 99.828),
(814, 'ปากเพรียว', 118, 14.527, 100.915),
(815, 'ดาวเรือง', 118, 14.563, 100.901),
(816, 'นาโฉง', 118, 14.529, 100.886),
(817, 'โคกสว่าง', 118, 14.51, 100.886),
(818, 'หนองโน', 118, 14.489, 100.861),
(819, 'หนองยาว', 118, 14.472, 100.89),
(820, 'ปากข้าวสาร', 118, 14.49, 100.913),
(821, 'หนองปลาไหล', 118, 14.456, 100.962),
(822, 'กุดนกเปล้า', 118, 14.502, 100.976),
(823, 'ตลิ่งชัน', 118, 14.544, 100.956),
(824, 'ตะกุด', 118, 14.553, 100.933),
(825, 'แก่งคอย', 119, 14.586, 101.002),
(826, 'ทับกวาง', 119, 14.605, 101.095),
(827, 'ตาลเดี่ยว', 119, 14.552, 101.015),
(828, 'ห้วยแห้ง', 119, 14.477, 101.004),
(829, 'ท่าคล้อ', 119, 14.712, 100.993),
(830, 'หินซ้อน', 119, 14.753, 101.033),
(831, 'บ้านธาตุ', 119, 14.626, 100.997),
(832, 'บ้านป่า', 119, 14.622, 101.029),
(833, 'ท่าตูม', 119, 14.662, 100.993),
(834, 'ชะอม', 119, 14.418, 101.134),
(835, 'สองคอน', 119, 14.636, 100.968),
(836, 'เตาปูน', 119, 14.603, 100.956),
(837, 'ชำผักแพว', 119, 14.529, 101.09),
(838, 'ท่ามะปราง', 119, 14.483, 101.103),
(839, 'หนองแค', 120, 14.337, 100.869),
(840, 'กุ่มหัก', 120, 14.312, 100.863),
(841, 'คชสิทธิ์', 120, 14.391, 100.807),
(842, 'โคกตูม', 120, 14.421, 100.784),
(843, 'โคกแย้', 120, 14.387, 100.928),
(844, 'บัวลอย', 120, 14.404, 100.851),
(845, 'ไผ่ต่ำ', 120, 14.326, 100.834),
(846, 'โพนทอง', 120, 14.425, 100.813),
(847, 'ห้วยขมิ้น', 120, 14.381, 100.871),
(848, 'ห้วยทราย', 120, 14.42, 100.933),
(849, 'หนองไข่น้ำ', 120, 14.36, 100.878),
(850, 'หนองแขม', 120, 14.339, 100.797),
(851, 'หนองจิก', 120, 14.441, 100.866),
(852, 'หนองจรเข้', 120, 14.334, 100.907),
(853, 'หนองนาก', 120, 14.444, 100.891),
(854, 'หนองปลาหมอ', 120, 14.369, 100.845),
(855, 'หนองปลิง', 120, 14.37, 100.829),
(856, 'หนองโรง', 120, 14.279, 100.865),
(857, 'หนองหมู', 121, 14.288, 100.932),
(858, 'บ้านลำ', 121, 14.391, 100.979),
(859, 'คลองเรือ', 121, 14.366, 101.032),
(860, 'วิหารแดง', 121, 14.313, 100.99),
(861, 'หนองสรวง', 121, 14.34, 100.983),
(862, 'เจริญธรรม', 121, 14.387, 101.006),
(863, 'หนองแซง', 122, 14.51, 100.759),
(864, 'หนองควายโซ', 122, 14.487, 100.795),
(865, 'หนองหัวโพ', 122, 14.483, 100.817),
(866, 'หนองสีดา', 122, 14.515, 100.841),
(867, 'หนองกบ', 122, 14.456, 100.776),
(868, 'ไก่เส่า', 122, 14.516, 100.793),
(869, 'โคกสะอาด', 122, 14.456, 100.802),
(870, 'ม่วงหวาน', 122, 14.476, 100.836),
(871, 'บ้านหมอ', 123, 14.616, 100.724),
(872, 'บางโขมด', 123, 14.591, 100.742),
(873, 'สร้างโศก', 123, 14.622, 100.754),
(874, 'ตลาดน้อย', 123, 14.643, 100.716),
(875, 'หรเทพ', 123, 14.628, 100.67),
(876, 'โคกใหญ่', 123, 14.606, 100.677),
(877, 'ไผ่ขวาง', 123, 14.579, 100.648),
(878, 'บ้านครัว', 123, 14.584, 100.767),
(879, 'หนองบัว', 123, 14.618, 100.774),
(880, 'ดอนพุด', 124, 14.596, 100.621),
(881, 'ไผ่หลิ่ว', 124, 14.625, 100.632),
(882, 'บ้านหลวง', 124, 14.571, 100.62),
(883, 'ดงตะงาว', 124, 14.624, 100.599),
(884, 'หนองโดน', 125, 14.688, 100.693),
(885, 'บ้านกลับ', 125, 14.73, 100.684),
(886, 'ดอนทอง', 125, 14.664, 100.654),
(887, 'บ้านโปร่ง', 125, 14.716, 100.734),
(888, 'พระพุทธบาท', 126, 14.732, 100.782),
(889, 'ขุนโขลน', 126, 14.713, 100.831),
(890, 'ธารเกษม', 126, 14.763, 100.812),
(891, 'นายาว', 126, 14.768, 100.763),
(892, 'พุคำจาน', 126, 14.744, 100.847),
(893, 'เขาวง', 126, 14.679, 100.83),
(894, 'ห้วยป่าหวาย', 126, 14.638, 100.83),
(895, 'พุกร่าง', 126, 14.682, 100.784),
(896, 'เสาไห้', 127, 14.538, 100.85),
(897, 'บ้านยาง', 127, 14.582, 100.816),
(898, 'หัวปลวก', 127, 14.615, 100.844),
(899, 'งิ้วงาม', 127, 14.59, 100.851),
(900, 'ศาลารีไทย', 127, 14.565, 100.848),
(901, 'ต้นตาล', 127, 14.574, 100.885),
(902, 'ท่าช้าง', 127, 14.586, 100.863),
(903, 'พระยาทด', 127, 14.572, 100.871),
(904, 'ม่วงงาม', 127, 14.544, 100.807),
(905, 'เริงราง', 127, 14.558, 100.786),
(906, 'เมืองเก่า', 127, 14.54, 100.825),
(907, 'สวนดอกไม้', 127, 14.54, 100.868),
(908, 'มวกเหล็ก', 128, 14.705, 101.151),
(909, 'มิตรภาพ', 128, 14.474, 101.213),
(910, 'หนองย่างเสือ', 128, 14.789, 101.27),
(911, 'ลำสมพุง', 128, 15.007, 101.381),
(912, 'ลำพญากลาง', 128, 14.871, 101.367),
(913, 'ซับสนุ่น', 128, 14.932, 101.309),
(914, 'แสลงพัน', 129, 14.745, 101.116),
(915, 'คำพราน', 129, 14.818, 101.132),
(916, 'วังม่วง', 129, 14.861, 101.151),
(917, 'เขาดินพัฒนา', 130, 14.612, 100.906),
(918, 'บ้านแก้ง', 130, 14.582, 100.936),
(919, 'ผึ้งรวง', 130, 14.607, 100.931),
(920, 'พุแค', 130, 14.656, 100.905),
(921, 'ห้วยบง', 130, 14.626, 100.877),
(922, 'หน้าพระลาน', 130, 14.713, 100.904),
(923, 'บางปลาสร้อย', 131, 13.364, 100.987),
(924, 'มะขามหย่ง', 131, 13.372, 100.985),
(925, 'บ้านโขด', 131, 13.376, 100.99),
(926, 'แสนสุข', 131, 13.274, 100.928),
(927, 'บ้านสวน', 131, 13.347, 100.977),
(928, 'หนองรี', 131, 13.307, 101.057),
(929, 'นาป่า', 131, 13.385, 101.03),
(930, 'หนองข้างคอก', 131, 13.305, 101.006),
(931, 'ดอนหัวฬอ', 131, 13.421, 101.044),
(932, 'หนองไม้แดง', 131, 13.406, 101.003),
(933, 'บางทราย', 131, 13.393, 100.996),
(934, 'คลองตำหรุ', 131, 13.441, 100.982),
(935, 'เหมือง', 131, 13.263, 100.959),
(936, 'บ้านปึก', 131, 13.302, 100.928),
(937, 'ห้วยกะปิ', 131, 13.304, 100.968),
(938, 'เสม็ด', 131, 13.326, 100.951),
(939, 'อ่างศิลา', 131, 13.325, 100.929),
(940, 'สำนักบก', 131, 13.368, 101.061),
(941, 'บ้านบึง', 132, 13.297, 101.107),
(942, 'คลองกิ่ว', 132, 13.225, 101.107),
(943, 'มาบไผ่', 132, 13.359, 101.093),
(944, 'หนองซ้ำซาก', 132, 13.33, 101.072),
(945, 'หนองบอนแดง', 132, 13.353, 101.159),
(946, 'หนองชาก', 132, 13.298, 101.172),
(947, 'หนองอิรุณ', 132, 13.28, 101.247),
(948, 'หนองไผ่แก้ว', 132, 13.213, 101.246),
(949, 'หนองใหญ่', 133, 13.153, 101.375),
(950, 'คลองพลู', 133, 13.115, 101.476),
(951, 'หนองเสือช้าง', 133, 13.117, 101.283),
(952, 'ห้างสูง', 133, 13.243, 101.347),
(953, 'เขาซก', 133, 13.07, 101.42),
(954, 'บางละมุง', 134, 13.052, 100.922),
(955, 'หนองปรือ', 134, 12.92, 100.935),
(956, 'หนองปลาไหล', 134, 12.982, 100.945),
(957, 'โป่ง', 134, 12.933, 100.987),
(958, 'เขาไม้แก้ว', 134, 12.951, 101.057),
(959, 'ห้วยใหญ่', 134, 12.835, 100.985),
(960, 'ตะเคียนเตี้ย', 134, 13.002, 101.015),
(961, 'นาเกลือ', 134, 12.955, 100.909),
(962, 'เขตการปกคองพิเศษพัทยา', 134, 12.91, 100.884),
(963, 'พานทอง', 135, 13.461, 101.084),
(964, 'หนองตำลึง', 135, 13.408, 101.078),
(965, 'มาบโป่ง', 135, 13.431, 101.121),
(966, 'หนองกะขะ', 135, 13.431, 101.095),
(967, 'หนองหงษ์', 135, 13.389, 101.113),
(968, 'โคกขี้หนอน', 135, 13.552, 101.114),
(969, 'บ้านเก่า', 135, 13.454, 101.059),
(970, 'หน้าประดู่', 135, 13.497, 101.099),
(971, 'บางนาง', 135, 13.487, 101.067),
(972, 'เกาะลอย', 135, 13.519, 101.074),
(973, 'บางหัก', 135, 13.544, 101.075),
(974, 'พนัสนิคม', 136, 13.45, 101.18),
(975, 'หน้าพระธาตุ', 136, 13.468, 101.147),
(976, 'วัดหลวง', 136, 13.518, 101.161),
(977, 'บ้านเชิด', 136, 13.444, 101.144),
(978, 'นาเริก', 136, 13.405, 101.248),
(979, 'หมอนนาง', 136, 13.346, 101.257),
(980, 'สระสี่เหลี่ยม', 136, 13.554, 101.239),
(981, 'วัดโบสถ์', 136, 13.498, 101.139),
(982, 'กุฎโง้ง', 136, 13.444, 101.165),
(983, 'หัวถนน', 136, 13.531, 101.265),
(984, 'ท่าข้าม', 136, 13.559, 101.177),
(985, 'หนองปรือ', 136, 13.511, 101.254),
(986, 'หนองขยาด', 136, 13.402, 101.151),
(987, 'ทุ่งขวาง', 136, 13.4, 101.188),
(988, 'หนองเหียง', 136, 13.464, 101.33),
(989, 'นาวังหิน', 136, 13.442, 101.251),
(990, 'บ้านช้าง', 136, 13.435, 101.213),
(991, 'โคกเพลาะ', 136, 13.52, 101.121),
(992, 'ไร่หลักทอง', 136, 13.484, 101.184),
(993, 'ศรีราชา', 137, 13.174, 100.92),
(994, 'สุรศักดิ์', 137, 13.16, 100.983),
(995, 'ทุ่งสุขลา', 137, 13.097, 100.912),
(996, 'บึง', 137, 13.073, 101.006),
(997, 'หนองขาม', 137, 13.134, 101.038),
(998, 'เขาคันทรง', 137, 13.129, 101.123),
(999, 'บางพระ', 137, 13.223, 101.007),
(1000, 'บ่อวิน', 137, 13.052, 101.093),
(1001, 'ท่าเทววงษ์', 138, 13.151, 100.809),
(1002, 'สัตหีบ', 139, 12.638, 100.871),
(1003, 'นาจอมเทียน', 139, 12.775, 100.94),
(1004, 'พลูตาหลวง', 139, 12.701, 100.967),
(1005, 'บางเสร่', 139, 12.744, 100.908),
(1006, 'แสมสาร', 139, 12.572, 100.932),
(1007, 'บ่อทอง', 140, 13.193, 101.504),
(1008, 'วัดสุวรรณ', 140, 13.332, 101.419),
(1009, 'บ่อกวางทอง', 140, 13.318, 101.308),
(1010, 'ธาตุทอง', 140, 13.259, 101.389),
(1011, 'เกษตรสุวรรณ', 140, 13.326, 101.526),
(1012, 'พลวงทอง', 140, 13.217, 101.626),
(1013, 'เกาะจันทร์', 141, 13.403, 101.421),
(1014, 'ท่าบุญมี', 141, 13.389, 101.288),
(1015, 'ท่าประดู่', 142, 12.672, 101.266),
(1016, 'เชิงเนิน', 142, 12.677, 101.318),
(1017, 'ตะพง', 142, 12.653, 101.364),
(1018, 'เพ', 142, 12.568, 101.455),
(1019, 'แกลง', 142, 12.663, 101.467),
(1020, 'บ้านแลง', 142, 12.707, 101.377),
(1021, 'นาตาขวัญ', 142, 12.741, 101.369),
(1022, 'เนินพระ', 142, 12.681, 101.223),
(1023, 'กระเฉด', 142, 12.843, 101.456),
(1024, 'ทับมา', 142, 12.708, 101.247),
(1025, 'น้ำคอก', 142, 12.716, 101.269),
(1026, 'มาบตาพุด', 142, 12.701, 101.188),
(1027, 'สำนักทอง', 142, 12.721, 101.472),
(1028, 'สำนักท้อน', 143, 12.804, 101.066),
(1029, 'พลา', 143, 12.688, 101.025),
(1030, 'บ้านฉาง', 143, 12.732, 101.076),
(1031, 'ทางเกวียน', 144, 12.807, 101.625),
(1032, 'วังหว้า', 144, 12.763, 101.624),
(1033, 'ชากโดน', 144, 12.7, 101.604),
(1034, 'เนินฆ้อ', 144, 12.704, 101.678),
(1035, 'กร่ำ', 144, 12.668, 101.631),
(1036, 'ชากพง', 144, 12.668, 101.549),
(1037, 'กระแสบน', 144, 12.871, 101.611),
(1038, 'บ้านนา', 144, 12.846, 101.674),
(1039, 'ทุ่งควายกิน', 144, 12.808, 101.733),
(1040, 'กองดิน', 144, 12.815, 101.792),
(1041, 'คลองปูน', 144, 12.765, 101.75),
(1042, 'พังราด', 144, 12.729, 101.772),
(1043, 'ปากน้ำกระแส', 144, 12.717, 101.709),
(1044, 'ห้วยยาง', 144, 12.812, 101.533),
(1045, 'สองสลึง', 144, 12.743, 101.548),
(1046, 'วังจันทร์', 145, 12.858, 101.528),
(1047, 'ชุมแสง', 145, 12.956, 101.526),
(1048, 'ป่ายุบใน', 145, 13.005, 101.479),
(1049, 'พลงตาเอี่ยม', 145, 12.912, 101.541),
(1050, 'บ้านค่าย', 146, 12.775, 101.304),
(1051, 'หนองละลอก', 146, 12.821, 101.256),
(1052, 'หนองตะพาน', 146, 12.752, 101.258),
(1053, 'ตาขัน', 146, 12.735, 101.321),
(1054, 'บางบุตร', 146, 12.848, 101.391),
(1055, 'หนองบัว', 146, 12.906, 101.373),
(1056, 'ชากบก', 146, 12.783, 101.364),
(1057, 'ปลวกแดง', 147, 12.978, 101.226),
(1058, 'ตาสิทธิ์', 147, 13.038, 101.225),
(1059, 'ละหาร', 147, 12.973, 101.311),
(1060, 'แม่น้ำคู้', 147, 12.908, 101.23),
(1061, 'มาบยางพร', 147, 12.97, 101.136),
(1062, 'หนองไร่', 147, 13.039, 101.338),
(1063, 'น้ำเป็น', 148, 12.901, 101.749),
(1064, 'ห้วยทับมอญ', 148, 13.027, 101.686),
(1065, 'ชำฆ้อ', 148, 12.933, 101.641),
(1066, 'เขาน้อย', 148, 13.062, 101.617),
(1067, 'นิคมพัฒนา', 149, 12.856, 101.177),
(1068, 'มาบข่า', 149, 12.782, 101.193),
(1069, 'พนานิคม', 149, 12.902, 101.135),
(1070, 'มะขามคู่', 149, 12.847, 101.101),
(1071, 'ตลาด', 150, 12.591, 102.087),
(1072, 'วัดใหม่', 150, 12.611, 102.105),
(1073, 'คลองนารายณ์', 150, 12.574, 102.166),
(1074, 'เกาะขวาง', 150, 12.562, 102.09),
(1075, 'คมบาง', 150, 12.542, 102.169),
(1076, 'ท่าช้าง', 150, 12.644, 102.098),
(1077, 'จันทนิมิต', 150, 12.61, 102.123),
(1078, 'บางกะจะ', 150, 12.563, 102.056),
(1079, 'แสลง', 150, 12.694, 102.107),
(1080, 'หนองบัว', 150, 12.534, 102.101),
(1081, 'พลับพลา', 150, 12.605, 102.172),
(1082, 'ขลุง', 151, 12.452, 102.218),
(1083, 'บ่อ', 151, 12.412, 102.279),
(1084, 'เกวียนหัก', 151, 12.468, 102.2),
(1085, 'ตะปอน', 151, 12.493, 102.175),
(1086, 'บางชัน', 151, 12.288, 102.251),
(1087, 'วันยาว', 151, 12.439, 102.234),
(1088, 'ซึ้ง', 151, 12.487, 102.288),
(1089, 'มาบไพ', 151, 12.598, 102.258),
(1090, 'วังสรรพรส', 151, 12.56, 102.29),
(1091, 'ตรอกนอง', 151, 12.533, 102.275),
(1092, 'ตกพรม', 151, 12.625, 102.339),
(1093, 'บ่อเวฬุ', 151, 12.723, 102.367),
(1094, 'ท่าใหม่', 152, 12.628, 101.985),
(1095, 'ยายร้า', 152, 12.612, 102.027),
(1096, 'สีพยา', 152, 12.578, 102.029),
(1097, 'บ่อพุ', 152, 12.595, 102.028),
(1098, 'พลอยแหวน', 152, 12.617, 102.053),
(1099, 'เขาวัว', 152, 12.637, 102.035),
(1100, 'เขาบายศรี', 152, 12.74, 102.061),
(1101, 'สองพี่น้อง', 152, 12.672, 101.973),
(1102, 'ทุ่งเบญจา', 152, 12.814, 102.014),
(1103, 'รำพัน', 152, 12.669, 101.914),
(1104, 'โขมง', 152, 12.62, 101.94),
(1105, 'ตะกาดเง้า', 152, 12.581, 101.989),
(1106, 'คลองขุด', 152, 12.563, 101.935),
(1107, 'เขาแก้ว', 152, 12.867, 101.939),
(1108, 'ทับไทร', 153, 12.95, 102.247),
(1109, 'โป่งน้ำร้อน', 153, 12.89, 102.382),
(1110, 'หนองตาคง', 153, 13.067, 102.381),
(1111, 'เทพนิมิต', 153, 13.044, 102.453),
(1112, 'คลองใหญ่', 153, 12.873, 102.476),
(1113, 'มะขาม', 154, 12.677, 102.187),
(1114, 'ท่าหลวง', 154, 12.7, 102.147),
(1115, 'ปัถวี', 154, 12.743, 102.272),
(1116, 'วังแซ้ม', 154, 12.756, 102.156),
(1117, 'ฉมัน', 154, 12.817, 102.224),
(1118, 'อ่างคีรี', 154, 12.644, 102.226),
(1119, 'ปากน้ำแหลมสิงห์', 155, 12.452, 102.122),
(1120, 'เกาะเปริด', 155, 12.409, 102.122),
(1121, 'หนองชิ่ม', 155, 12.417, 102.178),
(1122, 'พลิ้ว', 155, 12.516, 102.161),
(1123, 'คลองน้ำเค็ม', 155, 12.498, 102.123),
(1124, 'บางสระเก้า', 155, 12.511, 102.109),
(1125, 'บางกะไชย', 155, 12.465, 102.066),
(1126, 'ปะตง', 156, 13.17, 102.194),
(1127, 'ทุ่งขนาน', 156, 13.232, 102.319),
(1128, 'ทับช้าง', 156, 13.265, 102.161),
(1129, 'ทรายขาว', 156, 13.086, 102.197),
(1130, 'สะตอน', 156, 13.174, 102.371),
(1131, 'แก่งหางแมว', 157, 12.982, 101.929),
(1132, 'ขุนซ่อง', 157, 13.169, 101.961),
(1133, 'สามพี่น้อง', 157, 12.977, 101.817),
(1134, 'พวา', 157, 13.105, 101.791),
(1135, 'เขาวงกต', 157, 12.881, 101.848),
(1136, 'นายายอาม', 158, 12.782, 101.847),
(1137, 'วังโตนด', 158, 12.701, 101.933),
(1138, 'กระแจะ', 158, 12.689, 101.861),
(1139, 'สนามไชย', 158, 12.625, 101.874),
(1140, 'ช้างข้าม', 158, 12.707, 101.819),
(1141, 'วังใหม่', 158, 12.764, 101.904),
(1142, 'ซากไทย', 159, 12.765, 102.101),
(1143, 'พลวง', 159, 12.822, 102.106),
(1144, 'ตะเคียนทอง', 159, 12.903, 102.132),
(1145, 'คลองพลู', 159, 12.931, 102.014),
(1146, 'จันทเขลม', 159, 13.071, 102.09),
(1147, 'หนองเสม็ด', 160, 12.216, 102.504),
(1148, 'หนองโสน', 160, 12.184, 102.488),
(1149, 'หนองคันทรง', 160, 12.194, 102.542),
(1150, 'ห้วงน้ำขาว', 160, 12.143, 102.518),
(1151, 'อ่าวใหญ่', 160, 12.078, 102.562),
(1152, 'วังกระแจะ', 160, 12.272, 102.479),
(1153, 'ห้วยแร้ง', 160, 12.387, 102.56),
(1154, 'เนินทราย', 160, 12.283, 102.547),
(1155, 'ท่าพริก', 160, 12.243, 102.589),
(1156, 'ท่ากุ่ม', 160, 12.345, 102.675),
(1157, 'ตะกาง', 160, 12.25, 102.659),
(1158, 'ชำราก', 160, 12.194, 102.677),
(1159, 'แหลมกลัด', 160, 12.117, 102.704),
(1160, 'คลองใหญ่', 161, 11.774, 102.889),
(1161, 'ไม้รูด', 161, 11.91, 102.805),
(1162, 'หาดเล็ก', 161, 11.699, 102.909),
(1163, 'เขาสมิง', 162, 12.34, 102.437),
(1164, 'แสนตุ้ง', 162, 12.398, 102.382),
(1165, 'วังตะเคียน', 162, 12.478, 102.531),
(1166, 'ท่าโสม', 162, 12.296, 102.346),
(1167, 'สะตอ', 162, 12.553, 102.434),
(1168, 'ประณีต', 162, 12.525, 102.359),
(1169, 'เทพนิมิต', 162, 12.469, 102.435),
(1170, 'ทุ่งนนทรี', 162, 12.405, 102.501),
(1171, 'บ่อพลอย', 163, 12.604, 102.559),
(1172, 'ช้างทูน', 163, 12.585, 102.469),
(1173, 'ด่านชุมพล', 163, 12.461, 102.664),
(1174, 'หนองบอน', 163, 12.683, 102.447),
(1175, 'นนทรีย์', 163, 12.544, 102.6),
(1176, 'แหลมงอบ', 164, 12.186, 102.419),
(1177, 'น้ำเชี่ยว', 164, 12.209, 102.436),
(1178, 'บางปิด', 164, 12.241, 102.301),
(1179, 'คลองใหญ่', 164, 12.226, 102.362),
(1180, 'เกาะหมาก', 165, 11.804, 102.383),
(1181, 'เกาะกูด', 165, 11.719, 102.519),
(1182, 'เกาะช้าง', 166, 12.07, 102.321),
(1183, 'เกาะช้างใต้', 166, 11.996, 102.331),
(1184, 'หน้าเมือง', 167, 13.686, 101.066),
(1185, 'ท่าไข่', 167, 13.736, 101.06),
(1186, 'บ้านใหม่', 167, 13.707, 101.1),
(1187, 'คลองนา', 167, 13.648, 101.102),
(1188, 'บางตีนเป็ด', 167, 13.661, 101.075),
(1189, 'บางไผ่', 167, 13.692, 101.102),
(1190, 'คลองจุกกระเฌอ', 167, 13.686, 101.125),
(1191, 'บางแก้ว', 167, 13.765, 101.094),
(1192, 'บางขวัญ', 167, 13.78, 101.054),
(1193, 'คลองนครเนื่องเขต', 167, 13.766, 101.008),
(1194, 'วังตะเคียน', 167, 13.719, 101.034),
(1195, 'โสธร', 167, 13.68, 101.053),
(1196, 'บางพระ', 167, 13.653, 101.02),
(1197, 'บางกระไห', 167, 13.67, 101.002),
(1198, 'หนามแดง', 167, 13.736, 100.989),
(1199, 'คลองเปรง', 167, 13.707, 100.933),
(1200, 'คลองอุดมชลจร', 167, 13.736, 100.92),
(1201, 'คลองหลวงแพ่ง', 167, 13.78, 100.927),
(1202, 'บางเตย', 167, 13.706, 100.993),
(1203, 'บางคล้า', 168, 13.722, 101.21),
(1204, 'บางสวน', 168, 13.696, 101.177),
(1205, 'บางกระเจ็ด', 168, 13.852, 101.208),
(1206, 'ปากน้ำ', 168, 13.753, 101.212),
(1207, 'ท่าทองหลาง', 168, 13.694, 101.229),
(1208, 'สาวชะโงก', 168, 13.683, 101.152),
(1209, 'เสม็ดเหนือ', 168, 13.673, 101.201),
(1210, 'เสม็ดใต้', 168, 13.653, 101.162),
(1211, 'หัวไทร', 168, 13.799, 101.221),
(1212, 'บางน้ำเปรี้ยว', 169, 13.829, 101.002),
(1213, 'บางขนาก', 169, 13.858, 101.115),
(1214, 'สิงโตทอง', 169, 13.911, 101.073),
(1215, 'หมอนทอง', 169, 13.874, 101.043),
(1216, 'บึงน้ำรักษ์', 169, 13.908, 100.926),
(1217, 'ดอนเกาะกา', 169, 13.944, 101.016),
(1218, 'โยธะกา', 169, 13.925, 101.128),
(1219, 'ดอนฉิมพลี', 169, 13.908, 100.964),
(1220, 'ศาลาแดง', 169, 13.838, 100.928),
(1221, 'โพรงอากาศ', 169, 13.827, 101.062),
(1222, 'บางปะกง', 170, 13.496, 100.966),
(1223, 'ท่าสะอ้าน', 170, 13.553, 100.995),
(1224, 'บางวัว', 170, 13.569, 100.964),
(1225, 'บางสมัคร', 170, 13.575, 100.936),
(1226, 'บางผึ้ง', 170, 13.527, 101.054),
(1227, 'บางเกลือ', 170, 13.526, 100.919),
(1228, 'สองคลอง', 170, 13.484, 100.91),
(1229, 'หนองจอก', 170, 13.603, 100.989),
(1230, 'พิมพา', 170, 13.599, 100.937),
(1231, 'ท่าข้าม', 170, 13.479, 100.994),
(1232, 'หอมศีล', 170, 13.543, 100.892),
(1233, 'เขาดิน', 170, 13.528, 101.026),
(1234, 'บ้านโพธิ์', 171, 13.588, 101.086),
(1235, 'เกาะไร่', 171, 13.678, 100.958),
(1236, 'คลองขุด', 171, 13.611, 101.194),
(1237, 'คลองบ้านโพธิ์', 171, 13.572, 101.057),
(1238, 'คลองประเวศ', 171, 13.63, 101.024),
(1239, 'ดอนทราย', 171, 13.631, 101.125),
(1240, 'เทพราช', 171, 13.641, 100.982),
(1241, 'ท่าพลับ', 171, 13.616, 101.075),
(1242, 'หนองตีนนก', 171, 13.585, 101.107),
(1243, 'หนองบัว', 171, 13.617, 101.101),
(1244, 'บางซ่อน', 171, 13.558, 101.058),
(1245, 'บางกรูด', 171, 13.633, 101.078),
(1246, 'แหลมประดู่', 171, 13.597, 101.209),
(1247, 'ลาดขวาง', 171, 13.605, 101.023),
(1248, 'สนามจันทร์', 171, 13.594, 101.066),
(1249, 'แสนภูดาษ', 171, 13.582, 101.015),
(1250, 'สิบเอ็ดศอก', 171, 13.605, 101.148),
(1251, 'เกาะขนุน', 172, 13.695, 101.399),
(1252, 'บ้านซ่อง', 172, 13.803, 101.403),
(1253, 'พนมสารคาม', 172, 13.771, 101.324),
(1254, 'เมืองเก่า', 172, 13.728, 101.319),
(1255, 'หนองยาว', 172, 13.816, 101.351),
(1256, 'ท่าถ่าน', 172, 13.76, 101.383),
(1257, 'หนองแหน', 172, 13.661, 101.335),
(1258, 'เขาหินซ้อน', 172, 13.75, 101.494),
(1259, 'บางคา', 173, 13.788, 101.278),
(1260, 'เมืองใหม่', 173, 13.715, 101.278),
(1261, 'ดงน้อย', 173, 13.836, 101.291),
(1262, 'คู้ยายหมี', 174, 13.644, 101.461),
(1263, 'ท่ากระดาน', 174, 13.606, 101.71),
(1264, 'ทุ่งพระยา', 174, 13.687, 101.745),
(1265, 'ลาดกระทิง', 174, 13.548, 101.475),
(1266, 'แปลงยาว', 175, 13.599, 101.293),
(1267, 'วังเย็น', 175, 13.536, 101.334),
(1268, 'หัวสำโรง', 175, 13.624, 101.315),
(1269, 'หนองไม้แก่น', 175, 13.504, 101.404),
(1270, 'ท่าตะเกียบ', 176, 13.508, 101.639),
(1271, 'คลองตะเกรา', 176, 13.299, 101.739),
(1272, 'ก้อนแก้ว', 177, 13.765, 101.136),
(1273, 'คลองเขื่อน', 177, 13.772, 101.185),
(1274, 'บางเล่า', 177, 13.721, 101.15),
(1275, 'บางโรง', 177, 13.824, 101.137),
(1276, 'บางตลาด', 177, 13.736, 101.165),
(1277, 'หน้าเมือง', 178, 14.057, 101.374),
(1278, 'รอบเมือง', 178, 14.066, 101.327),
(1279, 'วัดโบสถ์', 178, 14.034, 101.31),
(1280, 'บางเดชะ', 178, 13.991, 101.33),
(1281, 'ท่างาม', 178, 14.017, 101.413),
(1282, 'บางบริบูรณ์', 178, 14.039, 101.429),
(1283, 'ดงพระราม', 178, 14.072, 101.394),
(1284, 'บ้านพระ', 178, 14.116, 101.361),
(1285, 'โคกไม้ลาย', 178, 14.14, 101.298),
(1286, 'ดงขี้เหล็ก', 178, 14.132, 101.439),
(1287, 'เนินหอม', 178, 14.181, 101.378),
(1288, 'โนนห้อม', 178, 14.094, 101.463),
(1289, 'กบินทร์', 179, 13.939, 101.711),
(1290, 'เมืองเก่า', 179, 13.999, 101.77),
(1291, 'วังดาล', 179, 14.006, 101.645),
(1292, 'นนทรี', 179, 14.056, 101.668),
(1293, 'ย่านรี', 179, 13.897, 101.785),
(1294, 'วังตะเคียน', 179, 13.849, 101.87),
(1295, 'หาดนางแก้ว', 179, 13.963, 101.642),
(1296, 'ลาดตะเคียน', 179, 13.873, 101.658),
(1297, 'บ้านนา', 179, 13.99, 101.88),
(1298, 'บ่อทอง', 179, 13.935, 101.881),
(1299, 'หนองกี่', 179, 14.068, 101.841),
(1300, 'นาแขม', 179, 14.052, 101.723),
(1301, 'เขาไม้แก้ว', 179, 13.801, 101.775),
(1302, 'วังท่าช้าง', 179, 13.694, 101.885),
(1303, 'นาดี', 180, 14.189, 101.792),
(1304, 'สำพันตา', 180, 14.081, 101.766),
(1305, 'สะพานหิน', 180, 14.152, 101.665),
(1306, 'ทุ่งโพธิ์', 180, 14.141, 101.889),
(1307, 'แก่งดินสอ', 180, 14.095, 101.984),
(1308, 'บุพราหมณ์', 180, 14.268, 101.872);
INSERT INTO `db-subdistrinct` (`AD3ID`, `subDistrinct`, `AD2ID`, `Latitude`, `Longitude`) VALUES
(1309, 'บ้านสร้าง', 181, 14.026, 101.21),
(1310, 'บางกระเบา', 181, 13.984, 101.202),
(1311, 'บางเตย', 181, 13.946, 101.223),
(1312, 'บางยาง', 181, 13.94, 101.175),
(1313, 'บางแตน', 181, 13.89, 101.177),
(1314, 'บางพลวง', 181, 13.986, 101.282),
(1315, 'บางปลาร้า', 181, 13.926, 101.313),
(1316, 'บางขาม', 181, 13.893, 101.274),
(1317, 'กระทุ่มแพ้ว', 181, 13.891, 101.346),
(1318, 'ประจันตคาม', 182, 14.055, 101.497),
(1319, 'เกาะลอย', 182, 14.021, 101.515),
(1320, 'บ้านหอย', 182, 13.996, 101.567),
(1321, 'หนองแสง', 182, 14.052, 101.563),
(1322, 'ดงบัง', 182, 14.02, 101.579),
(1323, 'คำโตนด', 182, 14.112, 101.597),
(1324, 'บุฝ้าย', 182, 14.298, 101.601),
(1325, 'หนองแก้ว', 182, 14.111, 101.548),
(1326, 'โพธิ์งาม', 182, 14.214, 101.466),
(1327, 'ศรีมหาโพธิ', 183, 13.849, 101.567),
(1328, 'สัมพันธ์', 183, 13.997, 101.48),
(1329, 'บ้านทาม', 183, 13.976, 101.552),
(1330, 'ท่าตูม', 183, 13.932, 101.571),
(1331, 'บางกุ้ง', 183, 13.964, 101.483),
(1332, 'ดงกระทงยาม', 183, 13.958, 101.426),
(1333, 'หนองโพรง', 183, 13.787, 101.581),
(1334, 'หัวหว้า', 183, 13.908, 101.461),
(1335, 'หาดยาง', 183, 13.988, 101.432),
(1336, 'กรอกสมบูรณ์', 183, 13.767, 101.66),
(1337, 'โคกปีบ', 184, 13.88, 101.412),
(1338, 'โคกไทย', 184, 13.845, 101.448),
(1339, 'คู้ลำพัน', 184, 13.926, 101.41),
(1340, 'ไผ่ชะเลือด', 184, 13.919, 101.372),
(1341, 'นครนายก', 185, 14.198, 101.233),
(1342, 'ท่าช้าง', 185, 14.192, 101.176),
(1343, 'บ้านใหญ่', 185, 14.221, 101.225),
(1344, 'วังกระโจม', 185, 14.176, 101.212),
(1345, 'ท่าทราย', 185, 14.174, 101.111),
(1346, 'ดอนยอ', 185, 14.128, 101.109),
(1347, 'ศรีจุฬา', 185, 14.072, 101.132),
(1348, 'ดงละคร', 185, 14.136, 101.167),
(1349, 'ศรีนาวา', 185, 14.209, 101.267),
(1350, 'สาริกา', 185, 14.359, 101.261),
(1351, 'หินตั้ง', 185, 14.408, 101.352),
(1352, 'เขาพระ', 185, 14.301, 101.212),
(1353, 'พรหมณี', 185, 14.264, 101.164),
(1354, 'เกาะหวาย', 186, 14.175, 101.271),
(1355, 'เกาะโพธิ์', 186, 14.156, 101.231),
(1356, 'ปากพลี', 186, 14.132, 101.263),
(1357, 'โคกกรวด', 186, 14.18, 101.306),
(1358, 'ท่าเรือ', 186, 14.085, 101.235),
(1359, 'หนองแสง', 186, 14.211, 101.307),
(1360, 'นาหินลาด', 186, 14.317, 101.457),
(1361, 'บ้านนา', 187, 14.262, 101.059),
(1362, 'บ้านพร้าว', 187, 14.222, 101.101),
(1363, 'บ้านพริก', 187, 14.252, 100.976),
(1364, 'อาษา', 187, 14.226, 101.009),
(1365, 'ทองหลาง', 187, 14.207, 101.037),
(1366, 'บางอ้อ', 187, 14.176, 101.069),
(1367, 'พิกุลออก', 187, 14.244, 101.027),
(1368, 'ป่าขะ', 187, 14.297, 101.065),
(1369, 'เขาเพิ่ม', 187, 14.362, 101.096),
(1370, 'ศรีกะอาง', 187, 14.308, 101.117),
(1371, 'พระอาจารย์', 188, 13.986, 101.02),
(1372, 'บึงศาล', 188, 14.052, 100.938),
(1373, 'ศรีษะกระบือ', 188, 14.043, 100.986),
(1374, 'โพธิ์แทน', 188, 14.208, 100.949),
(1375, 'บางสมบูรณ์', 188, 14.021, 101.112),
(1376, 'ทรายมูล', 188, 14.123, 101.069),
(1377, 'บางปลากด', 188, 14.166, 100.971),
(1378, 'บางลูกเสือ', 188, 14.054, 101.066),
(1379, 'องครักษ์', 188, 14.107, 101.005),
(1380, 'ชุมพล', 188, 13.99, 100.937),
(1381, 'คลองใหญ่', 188, 14.127, 100.98),
(1382, 'สระแก้ว', 189, 13.803, 102.077),
(1383, 'บ้านแก้ง', 189, 13.984, 101.99),
(1384, 'ศาลาลำดวน', 189, 13.838, 101.964),
(1385, 'โคกปี่ฆ้อง', 189, 13.925, 102.028),
(1386, 'ท่าแยก', 189, 14.064, 102.266),
(1387, 'ท่าเกษม', 189, 13.766, 102.164),
(1388, 'สระขวัญ', 189, 13.763, 102.008),
(1389, 'หนองบอน', 189, 13.85, 102.087),
(1390, 'คลองหาด', 190, 13.429, 102.329),
(1391, 'ไทยอุดม', 190, 13.407, 102.26),
(1392, 'ซับมะกรูด', 190, 13.519, 102.228),
(1393, 'ไทรเดี่ยว', 190, 13.593, 102.212),
(1394, 'คลองไก่เถื่อน', 190, 13.346, 102.301),
(1395, 'เบญจขร', 190, 13.542, 102.307),
(1396, 'ไทรทอง', 190, 13.614, 102.309),
(1397, 'ตาพระยา', 191, 13.956, 102.764),
(1398, 'ทัพเสด็จ', 191, 14.047, 102.813),
(1399, 'ทัพราช', 191, 14.079, 102.639),
(1400, 'ทัพไทย', 191, 14.123, 102.845),
(1401, 'โคคลาน', 191, 13.968, 102.65),
(1402, 'วังน้ำเย็น', 192, 13.517, 102.166),
(1403, 'ตาหลังใน', 192, 13.471, 102.13),
(1404, 'คลองหินปูน', 192, 13.606, 102.104),
(1405, 'ทุ่งมหาเจริญ', 192, 13.482, 102.009),
(1406, 'วัฒนานคร', 193, 13.741, 102.325),
(1407, 'ท่าเกวียน', 193, 13.666, 102.251),
(1408, 'ผักขะ', 193, 13.71, 102.382),
(1409, 'โนนหมากเค็ง', 193, 13.824, 102.315),
(1410, 'หนองน้ำใส', 193, 13.871, 102.341),
(1411, 'ช่องกุ่ม', 193, 14.001, 102.449),
(1412, 'หนองแวง', 193, 13.799, 102.372),
(1413, 'แซร์ออ', 193, 13.974, 102.518),
(1414, 'หนองหมากฝ้าย', 193, 14.024, 102.358),
(1415, 'หนองตะเคียนบอน', 193, 13.916, 102.265),
(1416, 'ห้วยโจด', 193, 13.771, 102.281),
(1417, 'อรัญประเทศ', 194, 13.68, 102.517),
(1418, 'เมืองไผ่', 194, 13.651, 102.427),
(1419, 'หันทราย', 194, 13.806, 102.452),
(1420, 'คลองน้ำใส', 194, 13.59, 102.514),
(1421, 'ท่าข้าม', 194, 13.639, 102.531),
(1422, 'ป่าไร่', 194, 13.745, 102.585),
(1423, 'ทับพริก', 194, 13.506, 102.336),
(1424, 'บ้านใหม่หนองไทร', 194, 13.715, 102.51),
(1425, 'ผ่านศึก', 194, 13.592, 102.432),
(1426, 'หนองสังข์', 194, 13.804, 102.539),
(1427, 'คลองทับจันทร์', 194, 13.643, 102.387),
(1428, 'ฟากห้วย', 194, 13.646, 102.48),
(1429, 'บ้านด่าน', 194, 13.746, 102.526),
(1430, 'เขาฉกรรจ์', 195, 13.663, 102.098),
(1431, 'หนองหว้า', 195, 13.672, 102.037),
(1432, 'พระเพลิง', 195, 13.596, 102.042),
(1433, 'เขาสามสิบ', 195, 13.708, 102.118),
(1434, 'โคกสูง', 196, 13.831, 102.719),
(1435, 'หนองม่วง', 196, 13.874, 102.582),
(1436, 'หนองแวง', 196, 13.866, 102.674),
(1437, 'โนนหมากมุ่น', 196, 13.774, 102.664),
(1438, 'วังสมบูรณ์', 197, 13.344, 102.207),
(1439, 'วังใหม่', 197, 13.413, 102.039),
(1440, 'วังทอง', 197, 13.338, 102.081),
(1441, 'โพธิ์กลาง', 198, 14.906, 102.102),
(1442, 'หนองจะบก', 198, 14.916, 102.064),
(1443, 'โคกสูง', 198, 15.095, 102.116),
(1444, 'มะเริง', 198, 14.98, 102.164),
(1445, 'หนองระเวียง', 198, 14.946, 102.199),
(1446, 'ปรุใหญ่', 198, 14.994, 102.052),
(1447, 'หมื่นไวย', 198, 15.011, 102.108),
(1448, 'พลกรัง', 198, 15.026, 102.011),
(1449, 'หนองไผ่ล้อม', 198, 14.947, 102.085),
(1450, 'หัวทะเล', 198, 14.965, 102.14),
(1451, 'บ้านเกาะ', 198, 14.981, 102.091),
(1452, 'พุดซา', 198, 15.049, 102.043),
(1453, 'บ้านโพธิ์', 198, 15.038, 102.191),
(1454, 'จอหอ', 198, 15.055, 102.148),
(1455, 'โคกกรวด', 198, 14.897, 101.974),
(1456, 'ไชยมงคล', 198, 14.849, 102.08),
(1457, 'หนองบัวศาลา', 198, 14.899, 102.152),
(1458, 'สุรนารี', 198, 14.915, 102.037),
(1459, 'สีมุม', 198, 14.986, 102.007),
(1460, 'ตลาด', 198, 15.018, 102.154),
(1461, 'พะเนา', 198, 14.986, 102.189),
(1462, 'หนองกระทุ่ม', 198, 15.009, 102.086),
(1463, 'หนองไข่น้ำ', 198, 15.105, 102.174),
(1464, 'แชะ', 199, 14.569, 102.278),
(1465, 'เฉลียง', 199, 14.489, 102.279),
(1466, 'ครบุรี', 199, 14.599, 102.13),
(1467, 'โคกกระชาย', 199, 14.301, 102.196),
(1468, 'จระเข้หิน', 199, 14.367, 102.1),
(1469, 'มาบตะโกเอน', 199, 14.57, 102.385),
(1470, 'อรพิมพ์', 199, 14.569, 102.207),
(1471, 'บ้านใหม่', 199, 14.449, 102.207),
(1472, 'ลำเพียก', 199, 14.255, 102.302),
(1473, 'ครบุรีใต้', 199, 14.529, 102.103),
(1474, 'ตะแบกบาน', 199, 14.462, 102.343),
(1475, 'สระว่านพระยา', 199, 14.528, 102.384),
(1476, 'เสิงสาง', 200, 14.426, 102.429),
(1477, 'สระตะเคียน', 200, 14.325, 102.552),
(1478, 'โนนสมบูรณ์', 200, 14.278, 102.398),
(1479, 'กุดโบสถ์', 200, 14.457, 102.54),
(1480, 'สุขไพบูลย์', 200, 14.526, 102.448),
(1481, 'บ้านราษฎร์', 200, 14.247, 102.474),
(1482, 'เมืองคง', 201, 15.451, 102.334),
(1483, 'คูขาด', 201, 15.445, 102.407),
(1484, 'เทพาลัย', 201, 15.368, 102.466),
(1485, 'ตาจั่น', 201, 15.314, 102.368),
(1486, 'บ้านปรางค์', 201, 15.474, 102.08),
(1487, 'หนองมะนาว', 201, 15.5, 102.28),
(1488, 'หนองบัว', 201, 15.496, 102.167),
(1489, 'โนนเต็ง', 201, 15.449, 102.266),
(1490, 'ดอนใหญ่', 201, 15.397, 102.357),
(1491, 'ขามสมบูรณ์', 201, 15.371, 102.403),
(1492, 'บ้านเหลื่อม', 202, 15.625, 102.136),
(1493, 'วังโพธิ์', 202, 15.571, 102.103),
(1494, 'โคกกระเบื้อง', 202, 15.571, 102.187),
(1495, 'ช่อระกา', 202, 15.54, 102.057),
(1496, 'จักราช', 203, 15.027, 102.432),
(1497, 'ทองหลาง', 203, 15.052, 102.353),
(1498, 'สีสุก', 203, 14.874, 102.385),
(1499, 'หนองขาม', 203, 14.931, 102.506),
(1500, 'หนองพลวง', 203, 15.07, 102.424),
(1501, 'ศรีละกอ', 203, 14.938, 102.427),
(1502, 'คลองเมือง', 203, 14.852, 102.502),
(1503, 'หินโคน', 203, 15.013, 102.498),
(1504, 'กระโทก', 204, 14.714, 102.189),
(1505, 'พลับพลา', 204, 14.755, 102.129),
(1506, 'ท่าอ่าง', 204, 14.821, 102.16),
(1507, 'ทุ่งอรุณ', 204, 14.631, 102.184),
(1508, 'ท่าลาดขาว', 204, 14.672, 102.154),
(1509, 'ท่าจะหลุง', 204, 14.87, 102.264),
(1510, 'ท่าเยี่ยม', 204, 14.716, 102.237),
(1511, 'โชคชัย', 204, 14.763, 102.172),
(1512, 'ละลมใหม่พัฒนา', 204, 14.811, 102.243),
(1513, 'ด่านเกวียน', 204, 14.864, 102.189),
(1514, 'กุดพิมาน', 205, 15.303, 101.759),
(1515, 'ด่านขุนทด', 205, 15.214, 101.788),
(1516, 'ด่านนอก', 205, 15.157, 101.87),
(1517, 'ด่านใน', 205, 15.119, 101.855),
(1518, 'ตะเคียน', 205, 15.124, 101.724),
(1519, 'บ้านเก่า', 205, 15.211, 101.673),
(1520, 'บ้านแปรง', 205, 15.372, 101.809),
(1521, 'พันชนะ', 205, 15.27, 101.689),
(1522, 'สระจรเข้', 205, 15.147, 101.808),
(1523, 'หนองกราด', 205, 15.348, 101.667),
(1524, 'หนองบัวตะเกียด', 205, 15.281, 101.821),
(1525, 'หนองบัวละคร', 205, 15.243, 101.863),
(1526, 'หินดาด', 205, 15.149, 101.618),
(1527, 'ห้วยบง', 205, 15.161, 101.486),
(1528, 'โนนเมืองพัฒนา', 205, 15.304, 101.897),
(1529, 'หนองไทร', 205, 15.36, 101.855),
(1530, 'โนนไทย', 206, 15.213, 102.061),
(1531, 'ด่านจาก', 206, 15.162, 102.095),
(1532, 'กำปัง', 206, 15.118, 102.06),
(1533, 'สำโรง', 206, 15.128, 102.018),
(1534, 'ค้างพลู', 206, 15.149, 101.973),
(1535, 'บ้านวัง', 206, 15.152, 101.914),
(1536, 'บัลลังก์', 206, 15.223, 101.928),
(1537, 'สายออ', 206, 15.226, 102.002),
(1538, 'ถนนโพธิ์', 206, 15.274, 102.138),
(1539, 'มะค่า', 206, 15.265, 102.098),
(1540, 'โนนสูง', 207, 15.179, 102.256),
(1541, 'ใหม่', 207, 15.152, 102.287),
(1542, 'โตนด', 207, 15.097, 102.293),
(1543, 'บิง', 207, 15.118, 102.333),
(1544, 'ดอนชมพู', 207, 15.171, 102.339),
(1545, 'ธารปราสาท', 207, 15.263, 102.392),
(1546, 'หลุมข้าว', 207, 15.224, 102.313),
(1547, 'มะค่า', 207, 15.315, 102.321),
(1548, 'พลสงคราม', 207, 15.299, 102.273),
(1549, 'จันอัด', 207, 15.161, 102.158),
(1550, 'ขามเฒ่า', 207, 15.305, 102.219),
(1551, 'ด่านคล้า', 207, 15.152, 102.212),
(1552, 'ลำคอหงษ์', 207, 15.252, 102.21),
(1553, 'เมืองปราสาท', 207, 15.201, 102.194),
(1554, 'ดอนหวาย', 207, 15.116, 102.287),
(1555, 'ลำมูล', 207, 15.072, 102.308),
(1556, 'ขามสะแกแสง', 208, 15.36, 102.195),
(1557, 'โนนเมือง', 208, 15.416, 102.116),
(1558, 'เมืองนาท', 208, 15.386, 102.248),
(1559, 'ชีวึก', 208, 15.351, 102.099),
(1560, 'พะงาด', 208, 15.334, 102.149),
(1561, 'หนองหัวฟาน', 208, 15.433, 102.237),
(1562, 'เมืองเกษตร', 208, 15.424, 102.159),
(1563, 'บัวใหญ่', 209, 15.602, 102.438),
(1564, 'ห้วยยาง', 209, 15.626, 102.363),
(1565, 'เสมาใหญ่', 209, 15.516, 102.429),
(1566, 'ดอนตะหนิน', 209, 15.486, 102.466),
(1567, 'หนองบัวสะอาด', 209, 15.593, 102.3),
(1568, 'โนนทองหลาง', 209, 15.522, 102.374),
(1569, 'กุดจอก', 209, 15.571, 102.502),
(1570, 'ด่านช้าง', 209, 15.623, 102.407),
(1571, 'ขุนทอง', 209, 15.683, 102.364),
(1572, 'หนองแจ้งใหญ่', 209, 15.567, 102.372),
(1573, 'ประทาย', 210, 15.536, 102.724),
(1574, 'กระทุ่มราย', 210, 15.53, 102.659),
(1575, 'วังไม้แดง', 210, 15.684, 102.632),
(1576, 'ตลาดไทร', 210, 15.528, 102.78),
(1577, 'หนองพลวง', 210, 15.583, 102.707),
(1578, 'หนองค่าย', 210, 15.596, 102.759),
(1579, 'หันห้วยทราย', 210, 15.611, 102.656),
(1580, 'ดอนมัน', 210, 15.491, 102.822),
(1581, 'นางรำ', 210, 15.484, 102.623),
(1582, 'โนนเพ็ด', 210, 15.677, 102.684),
(1583, 'ทุ่งสว่าง', 210, 15.493, 102.686),
(1584, 'โคกกลาง', 210, 15.463, 102.737),
(1585, 'เมืองโดน', 210, 15.635, 102.712),
(1586, 'เมืองปัก', 211, 14.719, 102.055),
(1587, 'ตะคุ', 211, 14.754, 101.953),
(1588, 'โคกไทย', 211, 14.741, 102.09),
(1589, 'สำโรง', 211, 14.65, 102.063),
(1590, 'ตะขบ', 211, 14.686, 101.745),
(1591, 'นกออก', 211, 14.686, 102.036),
(1592, 'ดอน', 211, 14.679, 102.108),
(1593, 'ตูม', 211, 14.701, 101.986),
(1594, 'งิ้ว', 211, 14.666, 101.997),
(1595, 'สะแกราช', 211, 14.604, 102.048),
(1596, 'ลำนางแก้ว', 211, 14.563, 101.87),
(1597, 'ภูหลวง', 211, 14.602, 101.984),
(1598, 'ธงชัยเหนือ', 211, 14.793, 102.034),
(1599, 'สุขเกษม', 211, 14.667, 101.939),
(1600, 'เกษมทรัพย์', 211, 14.663, 102.046),
(1601, 'บ่อปลาทอง', 211, 14.637, 101.902),
(1602, 'ในเมือง', 212, 15.206, 102.489),
(1603, 'สัมฤทธิ์', 212, 15.216, 102.424),
(1604, 'โบสถ์', 212, 15.215, 102.628),
(1605, 'กระเบื้องใหญ่', 212, 15.271, 102.458),
(1606, 'ท่าหลวง', 212, 15.282, 102.547),
(1607, 'รังกาใหญ่', 212, 15.19, 102.555),
(1608, 'ชีวาน', 212, 15.344, 102.54),
(1609, 'นิคมสร้างตนเอง', 212, 15.128, 102.49),
(1610, 'กระชอน', 212, 15.443, 102.67),
(1611, 'ดงใหญ่', 212, 15.338, 102.591),
(1612, 'ธารละหลอด', 212, 15.162, 102.403),
(1613, 'หนองระเวียง', 212, 15.113, 102.44),
(1614, 'ห้วยแถลง', 213, 14.967, 102.652),
(1615, 'ทับสวาย', 213, 15.021, 102.634),
(1616, 'เมืองพลับพลา', 213, 15.063, 102.634),
(1617, 'หลุ่งตะเคียน', 213, 15.12, 102.638),
(1618, 'หินดาด', 213, 14.995, 102.565),
(1619, 'งิ้ว', 213, 15.077, 102.689),
(1620, 'กงรถ', 213, 15.047, 102.752),
(1621, 'หลุ่งประดู่', 213, 15.06, 102.582),
(1622, 'ตะโก', 213, 15.019, 102.718),
(1623, 'ห้วยแคน', 213, 14.985, 102.687),
(1624, 'ชุมพวง', 214, 15.344, 102.75),
(1625, 'ประสุข', 214, 15.342, 102.685),
(1626, 'ท่าลาด', 214, 15.243, 102.72),
(1627, 'สาหร่าย', 214, 15.184, 102.735),
(1628, 'ตลาดไทร', 214, 15.109, 102.773),
(1629, 'โนนรัง', 214, 15.258, 102.81),
(1630, 'หนองหลัก', 214, 15.411, 102.732),
(1631, 'โนนตูม', 214, 15.167, 102.769),
(1632, 'โนนยอ', 214, 15.339, 102.828),
(1633, 'สูงเนิน', 215, 14.861, 101.842),
(1634, 'เสมา', 215, 14.982, 101.777),
(1635, 'โคราช', 215, 14.909, 101.851),
(1636, 'บุ่งขี้เหล็ก', 215, 14.952, 101.839),
(1637, 'โนนค่า', 215, 15.034, 101.84),
(1638, 'โค้งยาง', 215, 14.922, 101.903),
(1639, 'มะเกลือเก่า', 215, 14.779, 101.805),
(1640, 'มะเกลือใหม่', 215, 14.798, 101.728),
(1641, 'นากลาง', 215, 14.855, 101.942),
(1642, 'หนองตะไก้', 215, 14.79, 101.895),
(1643, 'ขามทะเลสอ', 216, 14.974, 101.959),
(1644, 'โป่งแดง', 216, 14.97, 101.916),
(1645, 'พันดุง', 216, 15.069, 101.952),
(1646, 'หนองสรวง', 216, 15.086, 101.894),
(1647, 'บึงอ้อ', 216, 15.028, 101.932),
(1648, 'สีคิ้ว', 217, 14.905, 101.687),
(1649, 'บ้านหัน', 217, 14.985, 101.75),
(1650, 'กฤษณา', 217, 15.046, 101.556),
(1651, 'ลาดบัวขาว', 217, 14.823, 101.629),
(1652, 'หนองหญ้าขาว', 217, 14.959, 101.574),
(1653, 'กุดน้อย', 217, 14.931, 101.753),
(1654, 'หนองน้ำใส', 217, 14.932, 101.485),
(1655, 'วังโรงใหญ่', 217, 15.045, 101.659),
(1656, 'มิตรภาพ', 217, 14.797, 101.685),
(1657, 'คลองไผ่', 217, 14.883, 101.515),
(1658, 'ดอนเมือง', 217, 15.02, 101.456),
(1659, 'หนองบัวน้อย', 217, 15.047, 101.76),
(1660, 'ปากช่อง', 218, 14.722, 101.363),
(1661, 'กลางดง', 218, 14.65, 101.283),
(1662, 'จันทึก', 218, 14.806, 101.456),
(1663, 'วังกะทะ', 218, 14.536, 101.64),
(1664, 'หมูสี', 218, 14.501, 101.402),
(1665, 'หนองสาหร่าย', 218, 14.689, 101.488),
(1666, 'ขนงพระ', 218, 14.594, 101.53),
(1667, 'โป่งตาลอง', 218, 14.472, 101.605),
(1668, 'คลองม่วง', 218, 14.647, 101.649),
(1669, 'หนองน้ำแดง', 218, 14.613, 101.398),
(1670, 'วังไทร', 218, 14.706, 101.573),
(1671, 'พญาเย็น', 218, 14.548, 101.246),
(1672, 'หนองบุนนาก', 219, 14.609, 102.4),
(1673, 'สารภี', 219, 14.814, 102.417),
(1674, 'ไทยเจริญ', 219, 14.743, 102.45),
(1675, 'หนองหัวแรต', 219, 14.715, 102.332),
(1676, 'แหลมทอง', 219, 14.78, 102.304),
(1677, 'หนองตะไก้', 219, 14.654, 102.397),
(1678, 'ลุงเขว้า', 219, 14.813, 102.339),
(1679, 'หนองไม้ไผ่', 219, 14.641, 102.32),
(1680, 'บ้านใหม่', 219, 14.754, 102.398),
(1681, 'แก้งสนามนาง', 220, 15.727, 102.277),
(1682, 'โนนสำราญ', 220, 15.75, 102.325),
(1683, 'บึงพะไล', 220, 15.661, 102.236),
(1684, 'สีสุก', 220, 15.64, 102.175),
(1685, 'บึงสำโรง', 220, 15.715, 102.198),
(1686, 'โนนตาเถร', 221, 15.435, 102.488),
(1687, 'สำพะเนียง', 221, 15.452, 102.568),
(1688, 'วังหิน', 221, 15.505, 102.567),
(1689, 'ดอนยาวใหญ่', 221, 15.41, 102.536),
(1690, 'วังน้ำเขียว', 222, 14.399, 101.817),
(1691, 'วังหมี', 222, 14.474, 101.769),
(1692, 'ระเริง', 222, 14.574, 101.731),
(1693, 'อุดมทรัพย์', 222, 14.49, 101.969),
(1694, 'ไทยสามัคคี', 222, 14.353, 101.966),
(1695, 'สำนักตะคร้อ', 223, 15.297, 101.564),
(1696, 'หนองแวง', 223, 15.256, 101.436),
(1697, 'บึงปรือ', 223, 15.303, 101.411),
(1698, 'วังยายทอง', 223, 15.349, 101.518),
(1699, 'เมืองยาง', 224, 15.418, 102.886),
(1700, 'กระเบื้องนอก', 224, 15.44, 102.957),
(1701, 'ละหานปลาค้าว', 224, 15.487, 102.889),
(1702, 'โนนอุดม', 224, 15.426, 102.812),
(1703, 'สระพระ', 225, 15.311, 101.959),
(1704, 'มาบกราด', 225, 15.369, 101.926),
(1705, 'พังเทียม', 225, 15.275, 101.995),
(1706, 'ทัพรั้ง', 225, 15.406, 101.976),
(1707, 'หนองหอย', 225, 15.334, 102.056),
(1708, 'ขุย', 226, 15.353, 102.866),
(1709, 'บ้านยาง', 226, 15.25, 102.944),
(1710, 'ช่องแมว', 226, 15.276, 102.874),
(1711, 'ไพล', 226, 15.36, 102.971),
(1712, 'เมืองพะไล', 227, 15.649, 102.532),
(1713, 'โนนจาน', 227, 15.699, 102.472),
(1714, 'บัวลาย', 227, 15.661, 102.468),
(1715, 'หนองหว้า', 227, 15.667, 102.573),
(1716, 'สีดา', 228, 15.564, 102.588),
(1717, 'โพนทอง', 228, 15.54, 102.59),
(1718, 'โนนประดู่', 228, 15.521, 102.479),
(1719, 'สามเมือง', 228, 15.591, 102.537),
(1720, 'หนองตาดใหญ่', 228, 15.617, 102.591),
(1721, 'ช้างทอง', 229, 15.029, 102.31),
(1722, 'ท่าช้าง', 229, 14.981, 102.323),
(1723, 'พระพุทธ', 229, 14.975, 102.232),
(1724, 'หนองงูเหลือม', 229, 15.053, 102.234),
(1725, 'หนองยาง', 229, 14.93, 102.287),
(1726, 'ในเมือง', 230, 14.999, 103.104),
(1727, 'อิสาณ', 230, 14.979, 103.128),
(1728, 'เสม็ด', 230, 14.941, 103.098),
(1729, 'บ้านบัว', 230, 14.949, 102.997),
(1730, 'สะแกโพรง', 230, 14.853, 102.942),
(1731, 'สวายจึก', 230, 14.896, 103.146),
(1732, 'บ้านยาง', 230, 15.018, 103.156),
(1733, 'พระครู', 230, 15.099, 103.018),
(1734, 'ถลุงเหล็ก', 230, 15.116, 103.078),
(1735, 'หนองตาด', 230, 15.031, 103.024),
(1736, 'ลุมปุ๊ก', 230, 14.908, 102.951),
(1737, 'สองห้อง', 230, 14.808, 102.953),
(1738, 'บัวทอง', 230, 15.058, 103.136),
(1739, 'ชุมเห็ด', 230, 15.033, 103.093),
(1740, 'หลักเขต', 230, 14.824, 103.159),
(1741, 'สะแกซำ', 230, 14.871, 103.099),
(1742, 'กลันทา', 230, 15.095, 103.109),
(1743, 'กระสัง', 230, 14.974, 103.047),
(1744, 'เมืองฝาง', 230, 14.782, 102.982),
(1745, 'คูเมือง', 231, 15.24, 103),
(1746, 'ปะเคียบ', 231, 15.391, 103.054),
(1747, 'บ้านแพ', 231, 15.388, 103.008),
(1748, 'พรสำราญ', 231, 15.169, 103.027),
(1749, 'หินเหล็กไฟ', 231, 15.157, 103.064),
(1750, 'ตูมใหญ่', 231, 15.165, 103.137),
(1751, 'หนองขมาร', 231, 15.314, 102.995),
(1752, 'กระสัง', 232, 14.922, 103.296),
(1753, 'ลำดวน', 232, 15.061, 103.403),
(1754, 'สองชั้น', 232, 14.887, 103.224),
(1755, 'สูงเนิน', 232, 14.82, 103.239),
(1756, 'หนองเต็ง', 232, 14.905, 103.374),
(1757, 'เมืองไผ่', 232, 14.994, 103.292),
(1758, 'ชุมแสง', 232, 14.984, 103.395),
(1759, 'บ้านปรือ', 232, 14.848, 103.299),
(1760, 'ห้วยสำราญ', 232, 15.072, 103.336),
(1761, 'กันทรารมย์', 232, 14.966, 103.34),
(1762, 'ศรีภูมิ', 232, 15.027, 103.338),
(1763, 'นางรอง', 233, 14.673, 102.806),
(1764, 'สะเดา', 233, 14.577, 102.77),
(1765, 'ชุมแสง', 233, 14.561, 102.666),
(1766, 'หนองโบสถ์', 233, 14.612, 102.691),
(1767, 'หนองกง', 233, 14.674, 102.896),
(1768, 'ถนนหัก', 233, 14.616, 102.833),
(1769, 'หนองไทร', 233, 14.499, 102.757),
(1770, 'ก้านเหลือง', 233, 14.73, 102.711),
(1771, 'บ้านสิงห์', 233, 14.735, 102.789),
(1772, 'ลำไทรโยง', 233, 14.665, 102.735),
(1773, 'ทรัพย์พระยา', 233, 14.516, 102.662),
(1774, 'หนองยายพิมพ์', 233, 14.69, 102.863),
(1775, 'หัวถนน', 233, 14.661, 102.648),
(1776, 'ทุ่งแสงทอง', 233, 14.581, 102.705),
(1777, 'หนองโสน', 233, 14.737, 102.934),
(1778, 'หนองกี่', 234, 14.669, 102.571),
(1779, 'เย้ยปราสาท', 234, 14.739, 102.564),
(1780, 'เมืองไผ่', 234, 14.774, 102.645),
(1781, 'ดอนอะราง', 234, 14.642, 102.571),
(1782, 'โคกสว่าง', 234, 14.782, 102.489),
(1783, 'ทุ่งกระตาดพัฒนา', 234, 14.674, 102.497),
(1784, 'ทุ่งกระเต็น', 234, 14.693, 102.564),
(1785, 'ท่าโพธิ์ชัย', 234, 14.736, 102.635),
(1786, 'โคกสูง', 234, 14.806, 102.562),
(1787, 'บุกระสัง', 234, 14.724, 102.501),
(1788, 'ละหานทราย', 235, 14.418, 102.854),
(1789, 'ตาจง', 235, 14.439, 102.92),
(1790, 'สำโรงใหม่', 235, 14.284, 102.85),
(1791, 'หนองแวง', 235, 14.268, 102.935),
(1792, 'หนองตระครอง', 235, 14.393, 102.787),
(1793, 'โคกว่าน', 235, 14.449, 102.784),
(1794, 'ประโคนชัย', 236, 14.613, 103.081),
(1795, 'แสลงโทน', 236, 14.787, 103.055),
(1796, 'บ้านไทร', 236, 14.705, 103.065),
(1797, 'ละเวี้ย', 236, 14.599, 103.191),
(1798, 'จรเข้มาก', 236, 14.5, 102.989),
(1799, 'ปังกู', 236, 14.537, 103.067),
(1800, 'โคกย่าง', 236, 14.562, 103.005),
(1801, 'โคกม้า', 236, 14.641, 103.035),
(1802, 'ไพศาล', 236, 14.662, 103.208),
(1803, 'ตะโกตาพิ', 236, 14.638, 102.981),
(1804, 'เขาคอก', 236, 14.44, 103.004),
(1805, 'หนองบอน', 236, 14.542, 103.143),
(1806, 'โคกมะขาม', 236, 14.602, 103.129),
(1807, 'โคกตูม', 236, 14.702, 102.989),
(1808, 'ประทัดบุ', 236, 14.569, 102.962),
(1809, 'สี่เหลี่ยม', 236, 14.75, 103.003),
(1810, 'บ้านกรวด', 237, 14.429, 103.077),
(1811, 'โนนเจริญ', 237, 14.464, 103.189),
(1812, 'หนองไม้งาม', 237, 14.344, 102.997),
(1813, 'ปราสาท', 237, 14.362, 103.109),
(1814, 'สายตะกู', 237, 14.397, 103.211),
(1815, 'หินลาด', 237, 14.473, 103.143),
(1816, 'บึงเจริญ', 237, 14.337, 103.037),
(1817, 'จันทบเพชร', 237, 14.384, 103.164),
(1818, 'เขาดินเหนือ', 237, 14.524, 103.199),
(1819, 'พุทไธสง', 238, 15.582, 103.014),
(1820, 'มะเฟือง', 238, 15.497, 103.032),
(1821, 'บ้านจาน', 238, 15.507, 102.983),
(1822, 'บ้านเป้า', 238, 15.627, 102.892),
(1823, 'บ้านแวง', 238, 15.58, 102.959),
(1824, 'บ้านยาง', 238, 15.463, 103.097),
(1825, 'หายโศก', 238, 15.526, 102.937),
(1826, 'ลำปลายมาศ', 239, 15.019, 102.834),
(1827, 'หนองคู', 239, 14.999, 102.803),
(1828, 'แสลงพัน', 239, 14.99, 102.957),
(1829, 'ทะเมนชัย', 239, 15.051, 102.945),
(1830, 'ตลาดโพธิ์', 239, 15.083, 102.893),
(1831, 'หนองกระทิง', 239, 14.974, 102.76),
(1832, 'โคกกลาง', 239, 14.949, 102.862),
(1833, 'โคกสะอาด', 239, 15.154, 102.902),
(1834, 'เมืองแฝก', 239, 15.154, 102.973),
(1835, 'บ้านยาง', 239, 14.873, 102.886),
(1836, 'ผไทรินทร์', 239, 14.917, 102.777),
(1837, 'โคกล่าม', 239, 15.114, 102.839),
(1838, 'หินโคน', 239, 15.057, 102.82),
(1839, 'หนองบัวโคก', 239, 15.006, 102.889),
(1840, 'บุโพธิ์', 239, 15.109, 102.938),
(1841, 'หนองโดน', 239, 14.882, 102.824),
(1842, 'สตึก', 240, 15.263, 103.301),
(1843, 'นิคม', 240, 15.274, 103.225),
(1844, 'ทุ่งวัง', 240, 15.259, 103.386),
(1845, 'เมืองแก', 240, 15.19, 103.308),
(1846, 'หนองใหญ่', 240, 15.131, 103.291),
(1847, 'ร่อนทอง', 240, 15.2, 103.244),
(1848, 'ดอนมนต์', 240, 15.209, 103.183),
(1849, 'ชุมแสง', 240, 15.137, 103.377),
(1850, 'ท่าม่วง', 240, 15.3, 103.442),
(1851, 'สะแก', 240, 15.3, 103.354),
(1852, 'สนามชัย', 240, 15.207, 103.356),
(1853, 'กระสัง', 240, 15.195, 103.405),
(1854, 'ปะคำ', 241, 14.454, 102.721),
(1855, 'ไทยเจริญ', 241, 14.461, 102.683),
(1856, 'หนองบัว', 241, 14.432, 102.657),
(1857, 'โคกมะม่วง', 241, 14.402, 102.612),
(1858, 'หูทำนบ', 241, 14.364, 102.696),
(1859, 'นาโพธิ์', 242, 15.635, 102.944),
(1860, 'บ้านคู', 242, 15.712, 102.933),
(1861, 'บ้านดู่', 242, 15.713, 102.977),
(1862, 'ดอนกอก', 242, 15.763, 102.895),
(1863, 'ศรีสว่าง', 242, 15.673, 102.934),
(1864, 'สระแก้ว', 243, 14.828, 102.681),
(1865, 'ห้วยหิน', 243, 14.871, 102.594),
(1866, 'ไทยสามัคคี', 243, 14.885, 102.763),
(1867, 'หนองชัยศรี', 243, 14.823, 102.645),
(1868, 'เสาเดียว', 243, 14.911, 102.609),
(1869, 'เมืองฝ้าย', 243, 14.843, 102.741),
(1870, 'สระทอง', 243, 14.889, 102.67),
(1871, 'จันดุม', 244, 14.678, 103.118),
(1872, 'โคกขมิ้น', 244, 14.769, 103.193),
(1873, 'ป่าชัน', 244, 14.717, 103.241),
(1874, 'สะเดา', 244, 14.722, 103.168),
(1875, 'สำโรง', 244, 14.776, 103.111),
(1876, 'ห้วยราช', 245, 14.964, 103.183),
(1877, 'สามแวง', 245, 15.009, 103.192),
(1878, 'ตาเสา', 245, 15.088, 103.285),
(1879, 'บ้านตะโก', 245, 14.969, 103.233),
(1880, 'สนวน', 245, 14.933, 103.182),
(1881, 'โคกเหล็ก', 245, 15.023, 103.23),
(1882, 'เมืองโพธิ์', 245, 15.042, 103.268),
(1883, 'ห้วยราชา', 245, 14.982, 103.203),
(1884, 'โนนสุวรรณ', 246, 14.538, 102.604),
(1885, 'ทุ่งจังหัน', 246, 14.566, 102.558),
(1886, 'โกรกแก้ว', 246, 14.621, 102.637),
(1887, 'ดงอีจาน', 246, 14.546, 102.517),
(1888, 'ชำนิ', 247, 14.785, 102.81),
(1889, 'หนองปล่อง', 247, 14.743, 102.844),
(1890, 'เมืองยาง', 247, 14.794, 102.906),
(1891, 'ช่อผกา', 247, 14.809, 102.787),
(1892, 'ละลวด', 247, 14.78, 102.745),
(1893, 'โคกสนวน', 247, 14.755, 102.888),
(1894, 'หนองแวง', 248, 15.553, 102.907),
(1895, 'ทองหลาง', 248, 15.608, 102.805),
(1896, 'แดงใหญ่', 248, 15.605, 102.857),
(1897, 'กู่สวนแตง', 248, 15.534, 102.86),
(1898, 'หนองเยือง', 248, 15.555, 102.811),
(1899, 'โนนดินแดง', 249, 14.316, 102.721),
(1900, 'ส้มป่อย', 249, 14.346, 102.764),
(1901, 'ลำนางรอง', 249, 14.213, 102.698),
(1902, 'บ้านด่าน', 250, 15.112, 103.162),
(1903, 'ปราสาท', 250, 15.081, 103.217),
(1904, 'วังเหนือ', 250, 15.138, 103.219),
(1905, 'โนนขวาง', 250, 15.191, 103.157),
(1906, 'แคนดง', 251, 15.317, 103.123),
(1907, 'ดงพลอง', 251, 15.321, 103.172),
(1908, 'สระบัว', 251, 15.32, 103.077),
(1909, 'หัวฝาย', 251, 15.267, 103.18),
(1910, 'เจริญสุข', 252, 14.574, 102.865),
(1911, 'ตาเป๊ก', 252, 14.568, 102.924),
(1912, 'อีสานเขต', 252, 14.641, 102.931),
(1913, 'ถาวร', 252, 14.518, 102.87),
(1914, 'ยายแย้มวัฒนา', 252, 14.505, 102.918),
(1915, 'ในเมือง', 253, 14.884, 103.49),
(1916, 'ตั้งใจ', 253, 15.074, 103.55),
(1917, 'เพี้ยราม', 253, 15.067, 103.471),
(1918, 'นาดี', 253, 15.024, 103.528),
(1919, 'ท่าสว่าง', 253, 14.955, 103.452),
(1920, 'สลักได', 253, 14.855, 103.562),
(1921, 'ตาอ็อง', 253, 14.748, 103.617),
(1922, 'สำโรง', 253, 14.802, 103.627),
(1923, 'แกใหญ่', 253, 14.951, 103.513),
(1924, 'นอกเมือง', 253, 14.858, 103.491),
(1925, 'คอโค', 253, 14.903, 103.425),
(1926, 'สวาย', 253, 14.793, 103.337),
(1927, 'เฉนียง', 253, 14.796, 103.477),
(1928, 'เทนมีย์', 253, 14.774, 103.542),
(1929, 'นาบัว', 253, 14.782, 103.412),
(1930, 'เมืองที', 253, 14.91, 103.652),
(1931, 'ราม', 253, 14.848, 103.65),
(1932, 'บุฤาษี', 253, 14.904, 103.597),
(1933, 'ตระแสง', 253, 14.855, 103.403),
(1934, 'แสลงพันธ์', 253, 14.918, 103.545),
(1935, 'กาเกาะ', 253, 15.114, 103.473),
(1936, 'ชุมพลบุรี', 254, 15.377, 103.411),
(1937, 'นาหนองไผ่', 254, 15.376, 103.487),
(1938, 'ไพรขลา', 254, 15.395, 103.556),
(1939, 'ศรีณรงค์', 254, 15.373, 103.338),
(1940, 'ยะวึก', 254, 15.359, 103.23),
(1941, 'เมืองบัว', 254, 15.429, 103.205),
(1942, 'สระขุด', 254, 15.44, 103.15),
(1943, 'กระเบื้อง', 254, 15.359, 103.291),
(1944, 'หนองเรือ', 254, 15.312, 103.557),
(1945, 'ท่าตูม', 255, 15.295, 103.639),
(1946, 'กระโพ', 255, 15.245, 103.492),
(1947, 'พรมเทพ', 255, 15.351, 103.622),
(1948, 'โพนครก', 255, 15.401, 103.725),
(1949, 'เมืองแก', 255, 15.221, 103.67),
(1950, 'บะ', 255, 15.242, 103.569),
(1951, 'หนองบัว', 255, 15.327, 103.742),
(1952, 'บัวโคก', 255, 15.228, 103.71),
(1953, 'หนองเมธี', 255, 15.232, 103.615),
(1954, 'ทุ่งกุลา', 255, 15.429, 103.62),
(1955, 'จอมพระ', 256, 15.107, 103.599),
(1956, 'เมืองลีง', 256, 15.17, 103.465),
(1957, 'กระหาด', 256, 15.13, 103.529),
(1958, 'บุแกรง', 256, 15.079, 103.683),
(1959, 'หนองสนิท', 256, 15.16, 103.655),
(1960, 'บ้านผือ', 256, 15.123, 103.682),
(1961, 'ลุ่มระวี', 256, 15.162, 103.602),
(1962, 'ชุมแสง', 256, 15.178, 103.53),
(1963, 'เป็นสุข', 256, 15.136, 103.565),
(1964, 'กังแอน', 257, 14.656, 103.406),
(1965, 'ทมอ', 257, 14.722, 103.486),
(1966, 'ไพล', 257, 14.688, 103.377),
(1967, 'ปรือ', 257, 14.645, 103.288),
(1968, 'ทุ่งมน', 257, 14.72, 103.282),
(1969, 'ตาเบา', 257, 14.615, 103.493),
(1970, 'หนองใหญ่', 257, 14.552, 103.462),
(1971, 'โคกยาง', 257, 14.673, 103.529),
(1972, 'โคกสะอาด', 257, 14.541, 103.373),
(1973, 'บ้านไทร', 257, 14.622, 103.602),
(1974, 'โชคนาสาม', 257, 14.544, 103.28),
(1975, 'เชื้อเพลิง', 257, 14.713, 103.418),
(1976, 'ปราสาททนง', 257, 14.652, 103.356),
(1977, 'ตานี', 257, 14.617, 103.258),
(1978, 'บ้านพลวง', 257, 14.602, 103.408),
(1979, 'กันตรวจระมวล', 257, 14.592, 103.557),
(1980, 'สมุด', 257, 14.686, 103.339),
(1981, 'ประทัดบุ', 257, 14.727, 103.341),
(1982, 'กาบเชิง', 258, 14.488, 103.585),
(1983, 'คูตัน', 258, 14.533, 103.667),
(1984, 'ด่าน', 258, 14.465, 103.709),
(1985, 'แนงมุด', 258, 14.397, 103.459),
(1986, 'โคกตะเคียน', 258, 14.48, 103.505),
(1987, 'ตะเคียน', 258, 14.464, 103.632),
(1988, 'รัตนบุรี', 259, 15.311, 103.843),
(1989, 'ธาตุ', 259, 15.317, 103.94),
(1990, 'แก', 259, 15.355, 103.808),
(1991, 'ดอนแรด', 259, 15.369, 104.014),
(1992, 'หนองบัวทอง', 259, 15.392, 103.933),
(1993, 'หนองบัวบาน', 259, 15.239, 103.826),
(1994, 'ไผ่', 259, 15.324, 103.895),
(1995, 'เบิด', 259, 15.268, 103.921),
(1996, 'น้ำเขียว', 259, 15.316, 103.786),
(1997, 'กุดขาคีม', 259, 15.407, 103.846),
(1998, 'ยางสว่าง', 259, 15.306, 103.987),
(1999, 'ทับใหญ่', 259, 15.41, 103.89),
(2000, 'สนม', 260, 15.203, 103.761),
(2001, 'โพนโก', 260, 15.251, 103.766),
(2002, 'หนองระฆัง', 260, 15.152, 103.755),
(2003, 'นานวน', 260, 15.139, 103.793),
(2004, 'แคน', 260, 15.17, 103.828),
(2005, 'หัวงัว', 260, 15.124, 103.838),
(2006, 'หนองอียอ', 260, 15.157, 103.714),
(2007, 'ระแงง', 261, 14.898, 103.824),
(2008, 'ตรึม', 261, 15.035, 103.845),
(2009, 'จารพัต', 261, 14.867, 103.735),
(2010, 'ยาง', 261, 14.955, 103.856),
(2011, 'แตล', 261, 15.029, 103.71),
(2012, 'หนองบัว', 261, 15.083, 103.76),
(2013, 'คาละแมะ', 261, 15.081, 103.825),
(2014, 'หนองเหล็ก', 261, 14.812, 103.722),
(2015, 'หนองขวาว', 261, 14.979, 103.794),
(2016, 'ช่างปี่', 261, 14.946, 103.705),
(2017, 'กุดหวาย', 261, 14.92, 103.868),
(2018, 'ขวาวใหญ่', 261, 15.018, 103.77),
(2019, 'นารุ่ง', 261, 14.984, 103.829),
(2020, 'ตรมไพร', 261, 14.845, 103.785),
(2021, 'ผักไหม', 261, 14.848, 103.83),
(2022, 'สังขะ', 262, 14.663, 103.839),
(2023, 'ขอนแตก', 262, 14.717, 103.932),
(2024, 'ดม', 262, 14.575, 103.856),
(2025, 'พระแก้ว', 262, 14.653, 103.954),
(2026, 'บ้านจารย์', 262, 14.561, 103.749),
(2027, 'กระเทียม', 262, 14.604, 103.673),
(2028, 'สะกาด', 262, 14.612, 103.753),
(2029, 'ตาตุม', 262, 14.449, 103.779),
(2030, 'ทับทัน', 262, 14.676, 103.786),
(2031, 'ตาคง', 262, 14.66, 104.034),
(2032, 'บ้านชบ', 262, 14.618, 103.849),
(2033, 'เทพรักษา', 262, 14.481, 103.868),
(2034, 'ลำดวน', 263, 14.702, 103.642),
(2035, 'โชคเหนือ', 263, 14.738, 103.721),
(2036, 'อู่โลก', 263, 14.684, 103.691),
(2037, 'ตรำดม', 263, 14.763, 103.68),
(2038, 'ตระเปียงเตีย', 263, 14.751, 103.77),
(2039, 'สำโรงทาบ', 264, 14.989, 103.926),
(2040, 'หนองไผ่ล้อม', 264, 15.02, 103.905),
(2041, 'กระออม', 264, 15.13, 103.968),
(2042, 'หนองฮะ', 264, 15.097, 103.911),
(2043, 'ศรีสุข', 264, 15.07, 103.949),
(2044, 'เกาะแก้ว', 264, 14.958, 103.952),
(2045, 'หมื่นศรี', 264, 15.003, 103.968),
(2046, 'เสม็จ', 264, 15.092, 103.875),
(2047, 'สะโน', 264, 15.066, 103.999),
(2048, 'ประดู่', 264, 15.039, 103.952),
(2049, 'บัวเชด', 265, 14.527, 103.942),
(2050, 'สะเดา', 265, 14.532, 104.014),
(2051, 'จรัส', 265, 14.413, 103.976),
(2052, 'ตาวัง', 265, 14.609, 104.016),
(2053, 'อาโพน', 265, 14.479, 103.921),
(2054, 'สำเภาลูน', 265, 14.57, 103.953),
(2055, 'บักได', 266, 14.416, 103.35),
(2056, 'โคกกลาง', 266, 14.49, 103.249),
(2057, 'จีกแดก', 266, 14.497, 103.354),
(2058, 'ตาเมียง', 266, 14.386, 103.26),
(2059, 'ณรงค์', 267, 14.754, 103.882),
(2060, 'แจนแวน', 267, 14.797, 103.922),
(2061, 'ตรวจ', 267, 14.802, 103.846),
(2062, 'หนองแวง', 267, 14.757, 103.977),
(2063, 'ศรีสุข', 267, 14.738, 103.818),
(2064, 'เขวาสินรินทร์', 268, 15.009, 103.582),
(2065, 'บึง', 268, 15.06, 103.61),
(2066, 'ตากูก', 268, 15.026, 103.644),
(2067, 'ปราสาททอง', 268, 14.976, 103.648),
(2068, 'บ้านแร่', 268, 14.966, 103.576),
(2069, 'หนองหลวง', 269, 15.228, 103.927),
(2070, 'คำผง', 269, 15.186, 103.942),
(2071, 'โนน', 269, 15.173, 103.911),
(2072, 'ระเวียง', 269, 15.251, 103.885),
(2073, 'หนองเทพ', 269, 15.14, 103.88),
(2074, 'เมืองเหนือ', 270, 15.103, 104.336),
(2075, 'คูซอด', 270, 15.213, 104.278),
(2076, 'ซำ', 270, 15.04, 104.332),
(2077, 'จาน', 270, 14.989, 104.398),
(2078, 'ตะดอบ', 270, 15.037, 104.434),
(2079, 'หนองครก', 270, 15.078, 104.295),
(2080, 'โพนข่า', 270, 15.055, 104.385),
(2081, 'โพนค้อ', 270, 15.015, 104.369),
(2082, 'หญ้าปล้อง', 270, 15.135, 104.293),
(2083, 'ทุ่ม', 270, 14.98, 104.336),
(2084, 'หนองไฮ', 270, 15.007, 104.427),
(2085, 'หนองแก้ว', 270, 15.096, 104.433),
(2086, 'น้ำคำ', 270, 15.167, 104.34),
(2087, 'โพธิ์', 270, 15.124, 104.394),
(2088, 'หมากเขียบ', 270, 15.051, 104.258),
(2089, 'หนองไผ่', 270, 15.143, 104.271),
(2090, 'ยางชุมน้อย', 271, 15.26, 104.401),
(2091, 'ลิ้นฟ้า', 271, 15.18, 104.422),
(2092, 'คอนกาม', 271, 15.223, 104.36),
(2093, 'โนนคูณ', 271, 15.302, 104.354),
(2094, 'กุดเมืองฮาม', 271, 15.235, 104.319),
(2095, 'บึงบอน', 271, 15.251, 104.444),
(2096, 'ยางชุมใหญ่', 271, 15.212, 104.413),
(2097, 'ดูน', 272, 15.113, 104.578),
(2098, 'โนนสัง', 272, 15.1, 104.642),
(2099, 'หนองหัวช้าง', 272, 15.049, 104.643),
(2100, 'ยาง', 272, 15.072, 104.526),
(2101, 'หนองแวง', 272, 15.194, 104.658),
(2102, 'หนองแก้ว', 272, 15.143, 104.702),
(2103, 'ทาม', 272, 15.232, 104.616),
(2104, 'ละทาย', 272, 15.182, 104.583),
(2105, 'เมืองน้อย', 272, 15.203, 104.547),
(2106, 'อีปาด', 272, 15.223, 104.5),
(2107, 'บัวน้อย', 272, 15.173, 104.478),
(2108, 'หนองบัว', 272, 15.12, 104.525),
(2109, 'ดู่', 272, 15.08, 104.476),
(2110, 'ผักแพว', 272, 15.034, 104.537),
(2111, 'จาน', 272, 14.995, 104.494),
(2112, 'คำเนียม', 272, 15.066, 104.583),
(2113, 'บึงมะลู', 273, 14.535, 104.714),
(2114, 'กุดเสลา', 273, 14.679, 104.833),
(2115, 'เมือง', 273, 14.582, 104.67),
(2116, 'สังเม็ก', 273, 14.643, 104.729),
(2117, 'น้ำอ้อม', 273, 14.66, 104.657),
(2118, 'ละลาย', 273, 14.444, 104.547),
(2119, 'รุง', 273, 14.48, 104.63),
(2120, 'ตระกาจ', 273, 14.712, 104.596),
(2121, 'จานใหญ่', 273, 14.724, 104.655),
(2122, 'ภูเงิน', 273, 14.745, 104.571),
(2123, 'ชำ', 273, 14.543, 104.575),
(2124, 'กระแชง', 273, 14.65, 104.566),
(2125, 'โนนสำราญ', 273, 14.534, 104.8),
(2126, 'หนองหญ้าลาด', 273, 14.654, 104.621),
(2127, 'เสาธงชัย', 273, 14.447, 104.685),
(2128, 'ขนุน', 273, 14.602, 104.798),
(2129, 'สวนกล้วย', 273, 14.682, 104.777),
(2130, 'เวียงเหนือ', 273, 14.637, 104.686),
(2131, 'ทุ่งใหญ่', 273, 14.59, 104.591),
(2132, 'ภูผาหมอก', 273, 14.466, 104.809),
(2133, 'กันทรารมย์', 274, 14.717, 104.07),
(2134, 'จะกง', 274, 14.821, 104.253),
(2135, 'ใจดี', 274, 14.753, 104.15),
(2136, 'ดองกำเม็ด', 274, 14.775, 104.186),
(2137, 'โสน', 274, 14.657, 104.104),
(2138, 'ปรือใหญ่', 274, 14.601, 104.246),
(2139, 'สะเดาใหญ่', 274, 14.712, 104.268),
(2140, 'ตาอุด', 274, 14.669, 104.271),
(2141, 'ห้วยเหนือ', 274, 14.72, 104.205),
(2142, 'ห้วยใต้', 274, 14.662, 104.179),
(2143, 'หัวเสือ', 274, 14.834, 104.186),
(2144, 'ตะเคียน', 274, 14.773, 104.248),
(2145, 'นิคมพัฒนา', 274, 14.644, 104.234),
(2146, 'โคกเพชร', 274, 14.804, 104.149),
(2147, 'ปราสาท', 274, 14.727, 104.016),
(2148, 'สำโรงตาเจ็น', 274, 14.872, 104.17),
(2149, 'ห้วยสำราญ', 274, 14.715, 104.115),
(2150, 'กฤษณา', 274, 14.874, 104.255),
(2151, 'ลมศักดิ์', 274, 14.762, 104.283),
(2152, 'หนองฉลอง', 274, 14.684, 104.227),
(2153, 'ศรีตระกูล', 274, 14.639, 104.28),
(2154, 'ศรีสะอาด', 274, 14.754, 104.102),
(2155, 'ไพรบึง', 275, 14.744, 104.373),
(2156, 'ดินแดง', 275, 14.801, 104.308),
(2157, 'ปราสาทเยอ', 275, 14.811, 104.364),
(2158, 'สำโรงพลัน', 275, 14.7, 104.342),
(2159, 'สุขสวัสดิ์', 275, 14.856, 104.359),
(2160, 'โนนปูน', 275, 14.857, 104.303),
(2161, 'พิมาย', 276, 14.835, 104.032),
(2162, 'กู่', 276, 14.853, 103.957),
(2163, 'หนองเชียงทูน', 276, 14.875, 104.101),
(2164, 'ตูม', 276, 14.903, 104.009),
(2165, 'สมอ', 276, 14.82, 104.094),
(2166, 'โพธิ์ศรี', 276, 14.78, 104.082),
(2167, 'สำโรงปราสาท', 276, 14.917, 104.081),
(2168, 'ดู่', 276, 14.782, 104.027),
(2169, 'สวาย', 276, 14.913, 103.962),
(2170, 'พิมายเหนือ', 276, 14.881, 104.042),
(2171, 'สิ', 277, 14.625, 104.436),
(2172, 'บักดอง', 277, 14.476, 104.444),
(2173, 'พราน', 277, 14.592, 104.501),
(2174, 'โพธิ์วงศ์', 277, 14.666, 104.458),
(2175, 'ไพร', 277, 14.706, 104.454),
(2176, 'กระหวัน', 277, 14.673, 104.414),
(2177, 'ขุนหาญ', 277, 14.635, 104.371),
(2178, 'โนนสูง', 277, 14.581, 104.416),
(2179, 'กันทรอม', 277, 14.575, 104.353),
(2180, 'ภูฝ้าย', 277, 14.683, 104.51),
(2181, 'โพธิ์กระสังข์', 277, 14.628, 104.327),
(2182, 'ห้วยจันทร์', 277, 14.465, 104.353),
(2183, 'เมืองคง', 278, 15.356, 104.159),
(2184, 'เมืองแคน', 278, 15.351, 104.214),
(2185, 'หนองแค', 278, 15.38, 104.106),
(2186, 'จิกสังข์ทอง', 278, 15.435, 104.125),
(2187, 'ด่าน', 278, 15.421, 104.026),
(2188, 'ดู่', 278, 15.416, 104.162),
(2189, 'หนองอึ่ง', 278, 15.278, 104.176),
(2190, 'บัวหุ่ง', 278, 15.321, 104.105),
(2191, 'ไผ่', 278, 15.332, 104.257),
(2192, 'ส้มป่อย', 278, 15.283, 104.232),
(2193, 'หนองหมี', 278, 15.271, 104.293),
(2194, 'หว้านคำ', 278, 15.407, 104.2),
(2195, 'สร้างปี่', 278, 15.317, 104.305),
(2196, 'กำแพง', 279, 15.1, 104.15),
(2197, 'อี่หล่ำ', 279, 15.198, 104.188),
(2198, 'ก้านเหลือง', 279, 15.052, 104.143),
(2199, 'ทุ่งไชย', 279, 15.016, 104.109),
(2200, 'สำโรง', 279, 15.146, 104.148),
(2201, 'แขม', 279, 15.198, 104.14),
(2202, 'หนองไฮ', 279, 15.145, 104.093),
(2203, 'ขะยูง', 279, 15.126, 104.238),
(2204, 'ตาเกษ', 279, 15.143, 104.21),
(2205, 'หัวช้าง', 279, 15.251, 104.132),
(2206, 'รังแร้ง', 279, 15.223, 104.228),
(2207, 'แต้', 279, 15.12, 104.178),
(2208, 'แข้', 279, 15.067, 104.176),
(2209, 'โพธิ์ชัย', 279, 15.173, 104.227),
(2210, 'ปะอาว', 279, 15.101, 104.214),
(2211, 'หนองห้าง', 279, 15.098, 104.088),
(2212, 'สระกำแพงใหญ่', 279, 15.093, 104.128),
(2213, 'โคกหล่าม', 279, 15.22, 104.171),
(2214, 'โคกจาน', 279, 14.966, 104.104),
(2215, 'เป๊าะ', 280, 15.297, 104.06),
(2216, 'บึงบูรพ์', 280, 15.328, 104.067),
(2217, 'ห้วยทับทัน', 281, 15.065, 104.044),
(2218, 'เมืองหลวง', 281, 15.021, 104.047),
(2219, 'กล้วยกว้าง', 281, 14.966, 104.069),
(2220, 'ผักไหม', 281, 14.947, 104.013),
(2221, 'จานแสนไชย', 281, 14.981, 104.019),
(2222, 'ปราสาท', 281, 15.11, 104.027),
(2223, 'โนนค้อ', 282, 14.899, 104.71),
(2224, 'บก', 282, 14.976, 104.64),
(2225, 'โพธิ์', 282, 14.923, 104.614),
(2226, 'หนองกุง', 282, 14.861, 104.774),
(2227, 'เหล่ากวาง', 282, 14.88, 104.638),
(2228, 'ศรีแก้ว', 283, 14.766, 104.476),
(2229, 'พิงพวย', 283, 14.744, 104.453),
(2230, 'สระเยาว์', 283, 14.785, 104.515),
(2231, 'ตูม', 283, 14.866, 104.488),
(2232, 'เสืองข้าว', 283, 14.813, 104.555),
(2233, 'ศรีโนนงาม', 283, 14.806, 104.419),
(2234, 'สะพุง', 283, 14.828, 104.474),
(2235, 'น้ำเกลี้ยง', 284, 14.917, 104.55),
(2236, 'ละเอาะ', 284, 14.93, 104.451),
(2237, 'ตองปิด', 284, 14.964, 104.479),
(2238, 'เขิน', 284, 14.852, 104.58),
(2239, 'รุ่งระวี', 284, 14.876, 104.525),
(2240, 'คูบ', 284, 14.971, 104.569),
(2241, 'บุสูง', 285, 14.957, 104.209),
(2242, 'ธาตุ', 285, 14.988, 104.186),
(2243, 'ดวนใหญ่', 285, 14.945, 104.271),
(2244, 'บ่อแก้ว', 285, 14.992, 104.27),
(2245, 'ศรีสำราญ', 285, 14.909, 104.155),
(2246, 'ทุ่งสว่าง', 285, 15.018, 104.224),
(2247, 'วังหิน', 285, 14.92, 104.24),
(2248, 'โพนยาง', 285, 14.926, 104.204),
(2249, 'โคกตาล', 286, 14.549, 104.203),
(2250, 'ห้วยตามอญ', 286, 14.525, 104.077),
(2251, 'ห้วยตึ๊กชู', 286, 14.566, 104.12),
(2252, 'ละลม', 286, 14.588, 104.079),
(2253, 'ตะเคียนราม', 286, 14.606, 104.169),
(2254, 'ดงรัก', 286, 14.44, 104.189),
(2255, 'ไพรพัฒนา', 286, 14.426, 104.085),
(2256, 'เมืองจันทร์', 287, 15.155, 104.011),
(2257, 'ตาโกน', 287, 15.205, 103.996),
(2258, 'หนองใหญ่', 287, 15.198, 104.035),
(2259, 'เสียว', 288, 14.799, 104.668),
(2260, 'หนองหว้า', 288, 14.754, 104.722),
(2261, 'หนองงูเหลือม', 288, 14.836, 104.653),
(2262, 'หนองฮาง', 288, 14.778, 104.594),
(2263, 'ท่าคล้อ', 288, 14.761, 104.783),
(2264, 'พยุห์', 289, 14.935, 104.387),
(2265, 'พรหมสวัสดิ์', 289, 14.852, 104.427),
(2266, 'ตำแย', 289, 14.918, 104.422),
(2267, 'โนนเพ็ก', 289, 14.933, 104.327),
(2268, 'หนองค้า', 289, 14.898, 104.334),
(2269, 'โดด', 290, 15.204, 104.078),
(2270, 'เสียว', 290, 15.251, 104.043),
(2271, 'หนองม้า', 290, 15.254, 104.083),
(2272, 'ผือใหญ่', 290, 15.233, 104.111),
(2273, 'อีเซ', 290, 15.269, 104.009),
(2274, 'กุง', 291, 15.474, 104.084),
(2275, 'คลีกลิ้ง', 291, 15.529, 104.109),
(2276, 'หนองบัวดง', 291, 15.458, 104.046),
(2277, 'โจดม่วง', 291, 15.473, 104.139),
(2278, 'ในเมือง', 292, 15.232, 104.859),
(2279, 'หัวเรือ', 292, 15.367, 104.845),
(2280, 'หนองขอน', 292, 15.32, 104.766),
(2281, 'ปทุม', 292, 15.244, 104.894),
(2282, 'ขามใหญ่', 292, 15.302, 104.836),
(2283, 'แจระแม', 292, 15.251, 104.802),
(2284, 'หนองบ่อ', 292, 15.239, 104.727),
(2285, 'ไร่น้อย', 292, 15.314, 104.905),
(2286, 'กระโสบ', 292, 15.309, 104.97),
(2287, 'กุดลาด', 292, 15.291, 105),
(2288, 'ขี้เหล็ก', 292, 15.351, 104.815),
(2289, 'ปะอาว', 292, 15.365, 104.716),
(2290, 'นาคำ', 293, 15.507, 105.327),
(2291, 'แก้งกอก', 293, 15.478, 105.237),
(2292, 'เอือดใหญ่', 293, 15.52, 105.219),
(2293, 'วาริน', 293, 15.415, 105.26),
(2294, 'ลาดควาย', 293, 15.564, 105.329),
(2295, 'สงยาง', 293, 15.623, 105.286),
(2296, 'ตะบ่าย', 293, 15.56, 105.227),
(2297, 'คำไหล', 293, 15.409, 105.346),
(2298, 'หนามแท่ง', 293, 15.695, 105.565),
(2299, 'นาเลิน', 293, 15.607, 105.383),
(2300, 'ดอนใหญ่', 293, 15.447, 105.316),
(2301, 'โขงเจียม', 294, 15.296, 105.452),
(2302, 'ห้วยยาง', 294, 15.467, 105.455),
(2303, 'นาโพธิ์กลาง', 294, 15.553, 105.557),
(2304, 'หนองแสงใหญ่', 294, 15.339, 105.389),
(2305, 'ห้วยไผ่', 294, 15.42, 105.551),
(2306, 'เขื่องใน', 295, 15.371, 104.556),
(2307, 'สร้างถ่อ', 295, 15.367, 104.503),
(2308, 'ค้อทอง', 295, 15.399, 104.429),
(2309, 'ก่อเอ้', 295, 15.392, 104.623),
(2310, 'หัวดอน', 295, 15.307, 104.69),
(2311, 'ชีทวน', 295, 15.269, 104.653),
(2312, 'ท่าไห', 295, 15.319, 104.602),
(2313, 'นาคำใหญ่', 295, 15.283, 104.566),
(2314, 'แดงหม้อ', 295, 15.29, 104.513),
(2315, 'ธาตุน้อย', 295, 15.281, 104.48),
(2316, 'บ้านไทย', 295, 15.454, 104.424),
(2317, 'บ้านกอก', 295, 15.489, 104.464),
(2318, 'กลางใหญ่', 295, 15.515, 104.407),
(2319, 'โนนรัง', 295, 15.521, 104.5),
(2320, 'ยางขี้นก', 295, 15.446, 104.508),
(2321, 'ศรีสุข', 295, 15.477, 104.515),
(2322, 'สหธาตุ', 295, 15.338, 104.459),
(2323, 'หนองเหล่า', 295, 15.453, 104.592),
(2324, 'เขมราฐ', 296, 16.049, 105.136),
(2325, 'ขามป้อม', 296, 15.977, 105.179),
(2326, 'เจียด', 296, 15.872, 105.222),
(2327, 'หนองผือ', 296, 15.95, 105.058),
(2328, 'นาแวง', 296, 16.011, 105.329),
(2329, 'แก้งเหนือ', 296, 15.932, 105.128),
(2330, 'หนองนกทา', 296, 16.019, 105.096),
(2331, 'หนองสิม', 296, 16.025, 105.037),
(2332, 'หัวนา', 296, 15.867, 105.155),
(2333, 'เมืองเดช', 297, 14.92, 105.055),
(2334, 'นาส่วง', 297, 15.012, 104.983),
(2335, 'นาเจริญ', 297, 14.902, 104.955),
(2336, 'ทุ่งเทิง', 297, 14.819, 104.846),
(2337, 'สมสะอาด', 297, 14.824, 104.987),
(2338, 'กุดประทาย', 297, 14.966, 105.196),
(2339, 'ตบหู', 297, 14.702, 105.09),
(2340, 'กลาง', 297, 14.797, 105.141),
(2341, 'แก้ง', 297, 14.695, 105.014),
(2342, 'ท่าโพธิ์ศรี', 297, 14.84, 105.049),
(2343, 'บัวงาม', 297, 14.801, 105.218),
(2344, 'คำครั่ง', 297, 14.889, 105.205),
(2345, 'นากระแซง', 297, 14.87, 104.908),
(2346, 'โพนงาม', 297, 14.904, 105.115),
(2347, 'ป่าโมง', 297, 14.961, 104.976),
(2348, 'โนนสมบูรณ์', 297, 14.76, 105.03),
(2349, 'นาจะหลวย', 298, 14.487, 105.261),
(2350, 'โนนสมบูรณ์', 298, 14.688, 105.201),
(2351, 'พรสวรรค์', 298, 14.627, 105.18);

-- --------------------------------------------------------

--
-- Table structure for table `db-subfarm`
--

CREATE TABLE `db-subfarm` (
  `FSID` int(11) NOT NULL,
  `Name` varchar(50) NOT NULL,
  `Alias` varchar(15) NOT NULL,
  `Icon` varchar(20) NOT NULL,
  `AD3ID` int(11) NOT NULL,
  `FMID` int(11) NOT NULL,
  `IsCoordinate` tinyint(1) NOT NULL DEFAULT 0,
  `Latitude` float NOT NULL,
  `Longitude` float NOT NULL,
  `AreaRai` int(11) NOT NULL,
  `AreaNgan` int(11) NOT NULL,
  `AreaWa` int(11) NOT NULL,
  `AreaTotal` int(11) NOT NULL,
  `ModifyDT` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-subfarm`
--

INSERT INTO `db-subfarm` (`FSID`, `Name`, `Alias`, `Icon`, `AD3ID`, `FMID`, `IsCoordinate`, `Latitude`, `Longitude`, `AreaRai`, `AreaNgan`, `AreaWa`, `AreaTotal`, `ModifyDT`) VALUES
(1, 'แปลงทดสอบFST001', 'FST001', '1910621848.png', 1023, 1, 1, 12.8155, 101.491, 5, 2, 0, 2200, '2019-10-19 11:50:39');

-- --------------------------------------------------------

--
-- Table structure for table `db-user`
--

CREATE TABLE `db-user` (
  `UID` int(11) NOT NULL,
  `Title` enum('1','2','3') NOT NULL,
  `FirstName` varchar(25) NOT NULL,
  `LastName` varchar(30) NOT NULL,
  `UserName` varchar(25) NOT NULL,
  `PWD` varchar(255) NOT NULL,
  `Icon` varchar(20) NOT NULL,
  `EMAIL` varchar(50) NOT NULL,
  `ETID` int(11) NOT NULL,
  `DID` int(11) NOT NULL,
  `IsAdmin` tinyint(1) NOT NULL DEFAULT 0,
  `IsResearch` tinyint(1) NOT NULL DEFAULT 0,
  `IsOperator` tinyint(1) NOT NULL DEFAULT 0,
  `IsFarmer` tinyint(1) NOT NULL DEFAULT 0,
  `IsBlock` tinyint(1) DEFAULT NULL,
  `ModifyDT` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `db-user`
--

INSERT INTO `db-user` (`UID`, `Title`, `FirstName`, `LastName`, `UserName`, `PWD`, `Icon`, `EMAIL`, `ETID`, `DID`, `IsAdmin`, `IsResearch`, `IsOperator`, `IsFarmer`, `IsBlock`, `ModifyDT`) VALUES
(1, '1', 'โสภณ', 'โตใหญ่', 'sopon', 'xxx', '1810621757.png', 'sopon0714', 1, 1, 1, 1, 1, 1, 1, '2019-10-18 10:58:01'),
(90, '1', 'test22', 'test7', 'test2', '30aca5e3e101d548fabc73efeeb77aa0', 'null', 'test2', 1, 1, 1, 1, 1, 1, 0, '2019-11-03 19:23:11'),
(91, '1', 't', 't', 'tlllklkj', '87c719adc801369fa76a72f176108c50', 'default.jpg', 't', 1, 1, 1, 0, 0, 1, 0, '2019-11-05 03:29:26');

-- --------------------------------------------------------

--
-- Table structure for table `dim-address`
--

CREATE TABLE `dim-address` (
  `ID` int(11) NOT NULL,
  `FullAddress` text NOT NULL,
  `dbsubDID` int(11) NOT NULL,
  `dbDistID` int(11) NOT NULL,
  `dbprovID` int(11) NOT NULL,
  `SubDistrinct` varchar(30) NOT NULL,
  `Distrinct` varchar(30) NOT NULL,
  `Province` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `dim-department`
--

CREATE TABLE `dim-department` (
  `ID` int(11) NOT NULL,
  `dbID` int(11) NOT NULL COMMENT 'FK from db-department',
  `Department` varchar(100) NOT NULL,
  `Alias` varchar(25) NOT NULL,
  `Note` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `dim-department`
--

INSERT INTO `dim-department` (`ID`, `dbID`, `Department`, `Alias`, `Note`) VALUES
(25, 258, 'y', 'y', ''),
(26, 259, '', '', ''),
(27, 260, 'd', 'd', ''),
(28, 261, 'a', 'a', ''),
(29, 262, 'f', 'd', ''),
(30, 263, 'g', 'g', ''),
(31, 264, 'h', 'h', ''),
(32, 265, 'j', 'j', ''),
(33, 266, 'lol', 'lol', ''),
(34, 267, 'a', 'a', ''),
(35, 268, 'd', 'u', ''),
(36, 269, 'e', 'e', ''),
(37, 270, 'q', 's', ''),
(38, 271, 'ag', 'd', ''),
(39, 272, 'a', 'd', ''),
(40, 273, 'f', 'a', ''),
(41, 274, 'e', 'e', ''),
(42, 275, 'ฟ', 'ๆ', ''),
(43, 276, 'd', 'dd', ''),
(44, 277, 'น', 'น', ''),
(45, 280, 'a', 'a', ''),
(46, 281, 'u', 'g', ''),
(47, 282, 'asdf', 'asdf', ''),
(48, 283, 'q', 'sa', ''),
(49, 284, 'ๆ', 'ห', ''),
(50, 285, 'กหด', 'หกด', ''),
(51, 286, 'y', 'f', ''),
(52, 287, 'กหด', 'กหเ', ''),
(53, 288, 'a', 'a', ''),
(54, 289, 'at', 'd', ''),
(55, 290, 'i', 'i', ''),
(56, 291, 'uy', 'uy', ''),
(57, 292, 'g', 'g', ''),
(58, 293, 'l', 'l', ''),
(59, 294, 'n', 'n', ''),
(60, 295, 't', 't', ''),
(61, 296, 'q', 's', ''),
(62, 297, 'ฟ้า', 'ฟ้า', ''),
(63, 298, 'fr', 'fr', ''),
(64, 299, 'tff', 't', ''),
(65, 300, 'sf', 'dsf', ''),
(66, 301, 'ee', 'ee', ''),
(67, 302, 'eedf', 'eeff', ''),
(68, 303, 'o', 'o', ''),
(69, 304, 'g', 'g', ''),
(70, 305, 'e', 'e', ''),
(71, 306, 't', 't', ''),
(72, 307, 'y', 'y', ''),
(73, 308, 'p', 'p', 'p'),
(74, 309, 'q', 'i', 'i'),
(75, 310, 'a', 'a', ''),
(76, 311, 'w', 'ww', ''),
(77, 312, 'q', 'q', ''),
(78, 313, 'f', 'f', ''),
(79, 314, 'a', 'a', ''),
(80, 315, 'c', 'c', ''),
(81, 316, 'i', 'd', ''),
(82, 317, 'v', 'v', ''),
(83, 318, 'ฟ', 'ฟ', ''),
(84, 319, 'ะ', 'ะ', ''),
(85, 320, 'a', 'a', ''),
(86, 321, 'f', 'f', ''),
(87, 322, 'w', 'w', ''),
(88, 323, 'e', 'e', ''),
(89, 324, 's', 's', ''),
(90, 325, 'a', 'a', ''),
(91, 326, 'v', 'v', ''),
(92, 327, 'y', 'y', ''),
(93, 328, 'aa', 'aa', ''),
(94, 329, 'ฟ', 'ฟ', ''),
(95, 330, 'a', 'a', ''),
(96, 331, 'e', 'e', ''),
(97, 332, 'u', 'u', ''),
(98, 333, 'r', 'r', ''),
(99, 334, 'o', 'o', ''),
(100, 335, 'ะ', 'ะ', ''),
(101, 336, 'w', 'w', ''),
(102, 338, 'ำ', 'ำ', ''),
(103, 340, 'a', 'a', ''),
(104, 341, 'at', 'at', ''),
(105, 342, 'q', 'q', ''),
(106, 343, 'ad', 'ad', ''),
(107, 344, 'atg', 'atg', ''),
(108, 4, 'a', 'a', ''),
(109, 5, 'a222', 'a222', ''),
(110, 6, 'b', 'b', ''),
(111, 7, 'e', 'e', 'e'),
(112, 15, 'u', 'u', 'u'),
(113, 16, 'o', 'o', ''),
(114, 17, 'y', 'y', ''),
(115, 18, 'eg', 'er', '');

-- --------------------------------------------------------

--
-- Table structure for table `dim-farm`
--

CREATE TABLE `dim-farm` (
  `ID` int(11) NOT NULL,
  `IsFarm` tinyint(1) NOT NULL,
  `dbID` int(11) NOT NULL,
  `Name` varchar(50) NOT NULL,
  `Alias` varchar(15) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `dim-fertilizer`
--

CREATE TABLE `dim-fertilizer` (
  `ID` int(11) NOT NULL,
  `dbID` int(11) NOT NULL,
  `Name` varchar(25) NOT NULL,
  `Alias` varchar(15) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `dim-fertilizer`
--

INSERT INTO `dim-fertilizer` (`ID`, `dbID`, `Name`, `Alias`) VALUES
(2, 4, 'df', 'df'),
(3, 5, 'mabin', 'sd'),
(4, 4, 'pint2sas', 'df'),
(5, 4, 'pint2sasxxxxx', 'df'),
(6, 4, 'sd', 'df'),
(7, 4, 'sdsd', 'df'),
(8, 4, 'sdsdddde', 'df'),
(10, 4, 'sd', 'dfasd'),
(11, 4, 'sd', 'd'),
(12, 4, 'sdsdsd', 'd'),
(13, 4, 'sdsdsd', 'dsd'),
(14, 4, 'sdsdsd', 'dsdsdddddddd'),
(15, 5, 'mabin2', 'sd'),
(16, 5, 'mabin2', 'sddd'),
(17, 5, 'mabin2sddddddddddd', 'sdddsddddd'),
(18, 5, 'mabin2sddddddddddd', 'sdddsdddddeeeee'),
(19, 4, 'sdsdsd', 'dsds'),
(20, 4, 'sdsdsd', 'dssdd'),
(21, 4, 'sdsdsd4', 'dssdd'),
(22, 4, 'sdsdsd45', 'dssdd'),
(23, 4, 'sdsdsd45', 'dssddddd'),
(24, 4, 'sdsdsd45555', 'dssddddd'),
(25, 4, 'sdsdsd45555555', 'dssddddd'),
(26, 4, 'sdsdsd45555555', 'dss'),
(27, 4, 'sdsds', 'dss'),
(28, 4, 'sdsdss', 'dss'),
(29, 4, 'sdsdsssddd', 'dss'),
(30, 6, 'rr', 'rrrr'),
(31, 7, 'ed', 'ed'),
(33, 7, 'ed2', 'ed'),
(34, 7, 'ed2', 'ed2'),
(35, 8, 'pinto', '2584'),
(36, 9, ' sdsds', 'sdsd'),
(37, 10, 'กระต่าย', 'กต');

-- --------------------------------------------------------

--
-- Table structure for table `dim-pest`
--

CREATE TABLE `dim-pest` (
  `ID` int(11) NOT NULL,
  `dbpestLID` int(11) NOT NULL,
  `Name` varchar(50) NOT NULL,
  `Alias` varchar(50) NOT NULL,
  `Charactor` text NOT NULL,
  `Danger` text NOT NULL,
  `dbpestTID` int(11) NOT NULL,
  `TypeTH` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `dim-time`
--

CREATE TABLE `dim-time` (
  `ID` int(11) NOT NULL,
  `Date` date NOT NULL,
  `dd` int(11) NOT NULL,
  `Day` int(11) NOT NULL,
  `Week` int(11) NOT NULL,
  `Season` int(11) NOT NULL,
  `Month` int(11) NOT NULL,
  `Quarter` int(11) NOT NULL,
  `Year1` int(11) NOT NULL,
  `Year2` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `dim-time`
--

INSERT INTO `dim-time` (`ID`, `Date`, `dd`, `Day`, `Week`, `Season`, `Month`, `Quarter`, `Year1`, `Year2`) VALUES
(1, '2019-11-01', 1, 5, 44, 2, 11, 4, 2019, 2562),
(2, '2019-11-02', 2, 6, 44, 2, 11, 4, 2019, 2562),
(3, '2019-11-03', 3, 0, 44, 2, 11, 4, 2019, 2562),
(4, '2019-11-04', 4, 1, 45, 2, 11, 4, 2019, 2562),
(5, '2019-11-05', 5, 2, 45, 2, 11, 4, 2019, 2562);

-- --------------------------------------------------------

--
-- Table structure for table `dim-user`
--

CREATE TABLE `dim-user` (
  `ID` int(11) NOT NULL,
  `dbID` int(11) NOT NULL,
  `Type` enum('U','F') NOT NULL,
  `Title` enum('1','2','3') NOT NULL,
  `FullName` varchar(60) NOT NULL,
  `Alias` varchar(25) NOT NULL,
  `FormalID` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `dim-user`
--

INSERT INTO `dim-user` (`ID`, `dbID`, `Type`, `Title`, `FullName`, `Alias`, `FormalID`) VALUES
(121, 1, 'U', '1', 'นาย โสภณ โตใหญ่', 'โสภณ', NULL),
(15, 67, 'U', '1', 'test', 'test', ''),
(16, 90, 'U', '1', 'นาย test2 test2', 'test2', NULL),
(123, 90, 'U', '1', 'นาย test2 test3', 'test2', NULL),
(124, 90, 'U', '1', 'นาย test2 test7', 'test2', NULL),
(125, 90, 'U', '1', 'นาย test22 test7', 'test22', NULL),
(126, 90, 'U', '1', 'นาย test33 test7', 'test33', NULL),
(122, 91, 'U', '1', 'นาย t t', 't', NULL),
(127, 92, 'U', '3', 'นางสาว test dddddddddddddddd', 'test', NULL),
(18, 93, 'U', '1', '', 't1', NULL),
(17, 93, 'U', '1', 't t', 't', NULL),
(24, 93, 'U', '1', 't t', 't', NULL),
(26, 93, 'U', '1', 't t', 't', NULL),
(28, 93, 'U', '1', 't t', 't', NULL),
(19, 93, 'U', '1', 't1 t1', 't1', NULL),
(20, 93, 'U', '1', 't1 t1', 't1', NULL),
(21, 93, 'U', '1', 't1 t1', 't1', NULL),
(22, 93, 'U', '1', 't1 t1', 't1', NULL),
(23, 93, 'U', '1', 't1 t1', 't1', NULL),
(25, 93, 'U', '1', 't1 t1', 't1', NULL),
(27, 93, 'U', '1', 't1 t1', 't1', NULL),
(29, 93, 'U', '1', 't3 t3', 't3', NULL),
(30, 94, 'U', '1', 'เ ย', 'เ', NULL),
(31, 95, 'U', '1', 'g g', 'g', NULL),
(32, 96, 'U', '1', 'h k', 'h', NULL),
(33, 97, 'U', '1', 'i p', 'i', NULL),
(35, 97, 'U', '1', 'i p', 'i', NULL),
(44, 97, 'U', '1', 'นาย i pน', 'i', NULL),
(46, 97, 'U', '1', 'นาย i pน', 'i', NULL),
(45, 97, 'U', '1', 'นาย i pนe', 'i', NULL),
(47, 97, 'U', '1', 'นาย i pนi', 'i', NULL),
(48, 97, 'U', '1', 'นาย i pนi', 'i', NULL),
(49, 97, 'U', '1', 'นาย i pนi', 'i', NULL),
(50, 97, 'U', '1', 'นาย i pนi', 'i', NULL),
(51, 97, 'U', '1', 'นาย i pนi', 'i', NULL),
(52, 97, 'U', '1', 'นาย i pนi', 'i', NULL),
(62, 97, 'U', '1', 'นาย i pนi', 'i', NULL),
(101, 97, 'U', '1', 'นาย io iii', 'io', NULL),
(102, 97, 'U', '1', 'นาย io llljjj', 'io', NULL),
(103, 97, 'U', '1', 'นาย io oo', 'io', NULL),
(104, 97, 'U', '1', 'นาย io oo2', 'io', NULL),
(105, 97, 'U', '1', 'นาย io oo22', 'io', NULL),
(106, 97, 'U', '1', 'นาย io oo223', 'io', NULL),
(93, 97, 'U', '1', 'นาย io pน', 'io', NULL),
(63, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(64, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(65, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(66, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(67, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(68, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(69, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(70, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(71, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(72, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(73, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(74, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(75, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(76, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(77, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(78, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(79, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(80, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(81, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(82, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(83, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(84, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(85, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(86, 97, 'U', '1', 'นาย io pนi', 'io', NULL),
(97, 97, 'U', '1', 'นาย io pนll', 'io', NULL),
(98, 97, 'U', '1', 'นาย io pนlliii', 'io', NULL),
(99, 97, 'U', '1', 'นาย io qqqq', 'io', NULL),
(100, 97, 'U', '1', 'นาย io yyy', 'io', NULL),
(36, 98, 'U', '1', 'นาย พนา ด', 'พนา', NULL),
(43, 98, 'U', '1', 'นาย พนา ดูดี', 'พนา', NULL),
(87, 98, 'U', '1', 'นาย พนา ดูดี', 'พนา', NULL),
(88, 98, 'U', '1', 'นาย พนา ดูดี', 'พนา', NULL),
(89, 98, 'U', '1', 'นาย พนา ดูดี', 'พนา', NULL),
(90, 98, 'U', '1', 'นาย พนา ดูดี', 'พนา', NULL),
(91, 98, 'U', '1', 'นาย พนา ดูดี', 'พนา', NULL),
(92, 98, 'U', '1', 'นาย พนา ดูดี', 'พนา', NULL),
(34, 98, 'U', '1', 'พ ก', 'พ', NULL),
(37, 99, 'U', '1', 'นาย ทดสอบ ระบบ', 'ทดสอบ', NULL),
(38, 100, 'U', '1', 'นาย N N', 'N', NULL),
(39, 100, 'U', '1', 'นาย N N', 'N', NULL),
(40, 100, 'U', '1', 'นาย N N', 'N', NULL),
(41, 100, 'U', '1', 'นาย N N', 'N', NULL),
(54, 100, 'U', '1', 'นาย N N', 'N', NULL),
(55, 100, 'U', '1', 'นาย N N', 'N', NULL),
(56, 100, 'U', '1', 'นาย N N', 'N', NULL),
(57, 100, 'U', '1', 'นาย N N', 'N', NULL),
(58, 100, 'U', '1', 'นาย N N', 'N', NULL),
(59, 100, 'U', '1', 'นาย N N', 'N', NULL),
(60, 100, 'U', '1', 'นาย N N', 'N', NULL),
(42, 100, 'U', '1', 'นาย N Np', 'N', NULL),
(53, 100, 'U', '1', 'นาย N Np', 'N', NULL),
(94, 100, 'U', '1', 'นาย N Ny', 'N', NULL),
(95, 100, 'U', '1', 'นาย N Nyi', 'N', NULL),
(96, 100, 'U', '1', 'นาย N Nyi', 'N', NULL),
(61, 100, 'U', '1', 'นาย Nj N', 'Nj', NULL),
(107, 101, 'U', '1', 'นาย d f', 'd', NULL),
(108, 102, 'U', '1', 'นาย y y', 'y', NULL),
(109, 103, 'U', '1', 'นาย ก ด', 'ก', NULL),
(110, 104, 'U', '2', 'นาง ty t', 'ty', NULL),
(111, 105, 'U', '1', 'นาย g h', 'g', NULL),
(112, 106, 'U', '1', 'นาย oo t', 'oo', NULL),
(113, 107, 'U', '1', 'นาย l l', 'l', NULL),
(114, 108, 'U', '1', 'นาย ย พ', 'ย', NULL),
(115, 109, 'U', '1', 'นาย f f', 'f', NULL),
(116, 110, 'U', '1', 'นาย r r', 'r', NULL),
(117, 111, 'U', '1', 'นาย b b', 'b', NULL),
(118, 112, 'U', '1', 'นาย m m', 'm', NULL),
(119, 113, 'U', '1', 'นาย h h', 'h', NULL),
(120, 114, 'U', '1', 'นาย rพ q', 'rพ', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `log-department`
--

CREATE TABLE `log-department` (
  `ID` int(11) NOT NULL,
  `DIMdeptID` int(11) NOT NULL,
  `LOGloginID` int(11) NOT NULL,
  `StartT` int(11) NOT NULL,
  `StartID` int(11) NOT NULL,
  `EndT` int(11) DEFAULT NULL,
  `EndID` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `log-department`
--

INSERT INTO `log-department` (`ID`, `DIMdeptID`, `LOGloginID`, `StartT`, `StartID`, `EndT`, `EndID`) VALUES
(14, 25, 18, 1572712263, 2, NULL, NULL),
(15, 26, 18, 1572766092, 3, NULL, NULL),
(16, 27, 18, 1572773186, 3, NULL, NULL),
(17, 28, 18, 1572773229, 3, NULL, NULL),
(18, 29, 18, 1572774000, 3, NULL, NULL),
(19, 30, 18, 1572774038, 3, NULL, NULL),
(20, 31, 18, 1572774774, 3, NULL, NULL),
(21, 32, 18, 1572774860, 3, NULL, NULL),
(22, 33, 18, 1572774881, 3, NULL, NULL),
(23, 34, 18, 1572775041, 3, NULL, NULL),
(24, 35, 18, 1572775078, 3, NULL, NULL),
(25, 36, 18, 1572775092, 3, NULL, NULL),
(26, 37, 18, 1572775121, 3, NULL, NULL),
(27, 38, 18, 1572775135, 3, NULL, NULL),
(28, 39, 18, 1572775429, 3, NULL, NULL),
(29, 40, 18, 1572775476, 3, NULL, NULL),
(30, 41, 18, 1572775592, 3, NULL, NULL),
(31, 42, 18, 1572775695, 3, NULL, NULL),
(32, 43, 18, 1572775769, 3, NULL, NULL),
(33, 44, 18, 1572775827, 3, NULL, NULL),
(34, 45, 18, 1572776032, 3, NULL, NULL),
(35, 46, 18, 1572776039, 3, NULL, NULL),
(36, 47, 18, 1572776066, 3, NULL, NULL),
(37, 48, 18, 1572776171, 3, NULL, NULL),
(38, 49, 18, 1572776207, 3, NULL, NULL),
(39, 50, 18, 1572776233, 3, NULL, NULL),
(40, 51, 18, 1572776274, 3, NULL, NULL),
(41, 52, 18, 1572776317, 3, NULL, NULL),
(42, 53, 18, 1572776376, 3, NULL, NULL),
(43, 54, 18, 1572776384, 3, NULL, NULL),
(44, 55, 18, 1572776512, 3, NULL, NULL),
(45, 56, 18, 1572776567, 3, NULL, NULL),
(46, 57, 18, 1572776655, 3, NULL, NULL),
(47, 58, 18, 1572776696, 3, NULL, NULL),
(48, 59, 18, 1572776709, 3, NULL, NULL),
(49, 60, 18, 1572777012, 3, NULL, NULL),
(50, 61, 18, 1572778645, 3, NULL, NULL),
(51, 62, 18, 1572785041, 3, NULL, NULL),
(52, 63, 18, 1572785185, 3, NULL, NULL),
(53, 64, 18, 1572785204, 3, NULL, NULL),
(54, 65, 18, 1572785229, 3, NULL, NULL),
(55, 66, 18, 1572785262, 3, NULL, NULL),
(56, 67, 18, 1572785339, 3, NULL, NULL),
(57, 68, 18, 1572785347, 3, NULL, NULL),
(58, 69, 18, 1572794216, 3, NULL, NULL),
(59, 70, 18, 1572794238, 3, NULL, NULL),
(60, 71, 18, 1572794256, 3, NULL, NULL),
(61, 72, 18, 1572794298, 3, NULL, NULL),
(62, 73, 18, 1572796696, 3, NULL, NULL),
(63, 74, 18, 1572796725, 3, NULL, NULL),
(64, 75, 18, 1572796762, 3, NULL, NULL),
(65, 76, 18, 1572796807, 3, NULL, NULL),
(66, 77, 18, 1572796855, 3, NULL, NULL),
(67, 78, 18, 1572796877, 3, NULL, NULL),
(68, 79, 18, 1572796917, 3, NULL, NULL),
(69, 80, 18, 1572796955, 3, NULL, NULL),
(70, 81, 18, 1572797066, 3, NULL, NULL),
(71, 82, 18, 1572797191, 3, NULL, NULL),
(72, 83, 18, 1572797693, 3, NULL, NULL),
(73, 84, 18, 1572797713, 3, NULL, NULL),
(74, 85, 18, 1572797808, 3, NULL, NULL),
(75, 86, 18, 1572797820, 3, NULL, NULL),
(76, 87, 18, 1572797868, 3, NULL, NULL),
(77, 88, 18, 1572797890, 3, NULL, NULL),
(78, 89, 18, 1572797938, 3, NULL, NULL),
(79, 90, 18, 1572798013, 3, NULL, NULL),
(80, 91, 18, 1572798031, 3, NULL, NULL),
(81, 92, 18, 1572798068, 3, NULL, NULL),
(82, 93, 18, 1572799581, 3, NULL, NULL),
(83, 94, 18, 1572799664, 3, NULL, NULL),
(84, 95, 18, 1572799994, 3, NULL, NULL),
(85, 96, 18, 1572800025, 3, NULL, NULL),
(86, 97, 18, 1572800272, 3, NULL, NULL),
(87, 98, 18, 1572800291, 3, NULL, NULL),
(88, 99, 18, 1572800361, 3, NULL, NULL),
(89, 100, 18, 1572802168, 3, NULL, NULL),
(90, 101, 18, 1572802252, 3, NULL, NULL),
(91, 102, 18, 1572802317, 3, NULL, NULL),
(92, 103, 18, 1572802553, 3, NULL, NULL),
(93, 104, 18, 1572802566, 3, NULL, NULL),
(94, 105, 18, 1572802893, 3, NULL, NULL),
(95, 106, 18, 1572803401, 3, NULL, NULL),
(96, 107, 18, 1572805148, 3, NULL, NULL),
(97, 108, 18, 1572845654, 4, NULL, NULL),
(98, 109, 18, 1572845673, 4, NULL, NULL),
(101, 112, 117, 1572888150, 4, NULL, NULL),
(102, 113, 117, 1572888181, 4, NULL, NULL),
(103, 114, 134, 1572938542, 5, NULL, NULL),
(104, 115, 134, 1572938552, 5, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `log-email`
--

CREATE TABLE `log-email` (
  `ID` int(11) NOT NULL,
  `DIMuserID` int(11) NOT NULL,
  `LOGloginID` int(11) NOT NULL,
  `StartT` int(11) NOT NULL,
  `StartID` int(11) NOT NULL,
  `EndT` int(11) NOT NULL,
  `EndID` int(11) NOT NULL,
  `dbETID` int(11) NOT NULL,
  `FullEmail` varchar(101) NOT NULL,
  `Type` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `log-farm`
--

CREATE TABLE `log-farm` (
  `ID` int(11) NOT NULL,
  `LOGloginID` int(11) NOT NULL,
  `StartT` int(11) NOT NULL,
  `StartID` int(11) NOT NULL,
  `EndT` int(11) NOT NULL,
  `EndID` int(11) NOT NULL,
  `DIMownerID` int(11) NOT NULL,
  `DIMfarmID` int(11) NOT NULL,
  `DIMSubfID` int(11) NOT NULL,
  `DIMaddrID` int(11) NOT NULL,
  `IsCoordinate` tinyint(1) NOT NULL,
  `Latitude` float NOT NULL,
  `Longitude` float NOT NULL,
  `NumSubFarm` int(11) NOT NULL,
  `NumTree` int(11) NOT NULL,
  `AreaRai` int(11) NOT NULL,
  `AreaNgan` int(11) NOT NULL,
  `AreaWa` int(11) NOT NULL,
  `AreaTotal` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `log-farmer`
--

CREATE TABLE `log-farmer` (
  `ID` int(11) NOT NULL,
  `DIMuserID` int(11) NOT NULL,
  `LOGloginID` int(11) NOT NULL,
  `StartT` int(11) NOT NULL,
  `StartID` int(11) NOT NULL,
  `EndT` int(11) NOT NULL,
  `EndID` int(11) NOT NULL,
  `DIMaddrID` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `log-fercondition`
--

CREATE TABLE `log-fercondition` (
  `ID` int(11) NOT NULL,
  `LOGloginID` int(11) NOT NULL,
  `StartT` int(11) NOT NULL,
  `StartID` int(11) NOT NULL,
  `EndT` int(11) DEFAULT NULL,
  `EndID` int(11) DEFAULT NULL,
  `DIMfertID` int(11) NOT NULL,
  `Order` int(11) NOT NULL,
  `Condition` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `log-fercondition`
--

INSERT INTO `log-fercondition` (`ID`, `LOGloginID`, `StartT`, `StartID`, `EndT`, `EndID`, `DIMfertID`, `Order`, `Condition`) VALUES
(1, 5, 1572877506, 1, 1572932948, 0, 3, 1, '254'),
(2, 5, 1572877521, 1, 1572932948, 0, 3, 1, '254'),
(3, 5, 1572877521, 1, 1572932948, 0, 3, 2, '254'),
(4, 5, 1572877730, 1, 1572923915, 0, 2, 1, 'bb'),
(5, 5, 1572877750, 1, 1572923915, 0, 2, 1, 'bb'),
(6, 5, 1572877750, 1, 1572923915, 0, 2, 2, '254'),
(7, 5, 1572877868, 1, 1572932948, 0, 3, 1, 'dvxd'),
(8, 5, 1572877888, 1, 1572932948, 0, 3, 1, 'df'),
(9, 5, 1572878004, 1, 1572923915, 0, 2, 1, 'sdf'),
(10, 5, 1572878477, 1, 1572923915, 0, 2, 1, 'sdf'),
(11, 5, 1572878477, 1, 1572923915, 0, 2, 2, 's'),
(12, 5, 1572878490, 1, 1572923915, 0, 2, 1, 'sdf'),
(13, 5, 1572931431, 1, 1572931924, 0, 5, 1, 'sss'),
(14, 5, 1572931913, 1, 1572931924, 0, 5, 1, 'fef'),
(15, 5, 1572931988, 1, 1572932003, 0, 6, 1, 'fef'),
(16, 5, 1572931988, 1, 1572932003, 0, 6, 2, 'sd'),
(17, 5, 1572932294, 1, 1572932303, 0, 7, 1, 'fef'),
(18, 5, 1572932294, 1, 1572932303, 0, 7, 2, 'sd'),
(19, 5, 1572932294, 1, 1572932303, 0, 7, 3, 'ef'),
(20, 5, 1572932397, 1, 1572932570, 0, 8, 1, 'fef'),
(21, 5, 1572932397, 1, 1572932570, 0, 8, 2, 'sd'),
(22, 5, 1572932598, 1, 1572932618, 0, 10, 1, 'fef'),
(23, 5, 1572932599, 1, 1572932618, 0, 10, 2, 'sd'),
(24, 5, 1572932599, 1, 1572932618, 0, 10, 3, 'awd'),
(25, 5, 1572932727, 1, 1572932740, 0, 11, 1, 'fef'),
(26, 5, 1572932728, 1, 1572932740, 0, 11, 2, 'sd'),
(27, 5, 1572932728, 1, 1572932740, 0, 11, 3, 'awd'),
(28, 5, 1572932728, 1, 1572932740, 0, 11, 4, 'asd'),
(29, 5, 1572932740, 1, 1572932782, 0, 12, 1, 'fef'),
(30, 5, 1572932740, 1, 1572932782, 0, 12, 2, 'sd'),
(31, 5, 1572932740, 1, 1572932782, 0, 12, 3, 'awd'),
(32, 5, 1572932740, 1, 1572932782, 0, 12, 4, 'asd'),
(33, 5, 1572932782, 1, 1572932874, 0, 13, 1, 'fef'),
(34, 5, 1572932783, 1, 1572932874, 0, 13, 2, 'sd'),
(35, 5, 1572932783, 1, 1572932874, 0, 13, 3, 'awd'),
(36, 5, 1572932783, 1, 1572932874, 0, 13, 4, 'asd'),
(37, 5, 1572932874, 1, 1572933482, 0, 14, 1, 'fef'),
(38, 5, 1572932874, 1, 1572933482, 0, 14, 2, 'sd'),
(39, 5, 1572932874, 1, 1572933482, 0, 14, 3, 'awd'),
(40, 5, 1572932874, 1, 1572933482, 0, 14, 4, 'asd'),
(41, 5, 1572933482, 1, 1572933583, 0, 19, 1, 'fef'),
(42, 5, 1572933482, 1, 1572933583, 0, 19, 2, 'sd'),
(43, 5, 1572933482, 1, 1572933583, 0, 19, 3, 'awd'),
(44, 5, 1572933482, 1, 1572933583, 0, 19, 4, 'asd'),
(45, 5, 1572933583, 1, 1572933624, 0, 20, 1, 'fef'),
(46, 5, 1572933583, 1, 1572933624, 0, 20, 2, 'sd'),
(47, 5, 1572933583, 1, 1572933624, 0, 20, 3, 'awd'),
(48, 5, 1572933584, 1, 1572933624, 0, 20, 4, 'asd'),
(49, 5, 1572933625, 1, 1572933693, 0, 21, 1, 'fef'),
(50, 5, 1572933625, 1, 1572933693, 0, 21, 2, 'sd'),
(51, 5, 1572933625, 1, 1572933693, 0, 21, 3, 'awd'),
(52, 5, 1572933625, 1, 1572933693, 0, 21, 4, 'asd'),
(53, 5, 1572933693, 1, 1572933752, 0, 22, 1, 'fef'),
(54, 5, 1572933693, 1, 1572933752, 0, 22, 2, 'sd'),
(55, 5, 1572933693, 1, 1572933752, 0, 22, 3, 'awd'),
(56, 5, 1572933694, 1, 1572933752, 0, 22, 4, 'asd'),
(57, 5, 1572933752, 1, 1572934462, 0, 23, 1, 'fef'),
(58, 5, 1572933752, 1, 1572934462, 0, 23, 2, 'sd'),
(59, 5, 1572933752, 1, 1572934462, 0, 23, 3, 'awd'),
(60, 5, 1572933753, 1, 1572934462, 0, 23, 4, 'asd'),
(61, 5, 1572934462, 1, 1572934482, 0, 24, 1, 'fef'),
(62, 5, 1572934462, 1, 1572934482, 0, 24, 2, 'sd'),
(63, 5, 1572934462, 1, 1572934482, 0, 24, 3, 'awd'),
(64, 5, 1572934462, 1, 1572934482, 0, 24, 4, 'asd'),
(65, 5, 1572934482, 1, 1572935970, 0, 25, 1, 'fef'),
(66, 5, 1572934482, 1, 1572935970, 0, 25, 2, 'sd'),
(67, 5, 1572934482, 1, 1572935970, 0, 25, 3, 'awd'),
(68, 5, 1572934482, 1, 1572935970, 0, 25, 4, 'asd'),
(69, 5, 1572935970, 1, 1572937224, 0, 26, 1, 'fef'),
(70, 5, 1572935970, 1, 1572937224, 0, 26, 2, 'sd'),
(71, 5, 1572935970, 1, 1572937224, 0, 26, 3, 'awd'),
(72, 5, 1572935970, 1, 1572937224, 0, 26, 4, 'asd'),
(73, 134, 1572938453, 5, 1572939857, 5, 31, 1, '5'),
(74, 136, 1572940170, 5, NULL, NULL, 35, 1, '43'),
(75, 136, 1572940171, 5, NULL, NULL, 35, 2, '254'),
(76, 140, 1572942360, 5, 1572942498, 5, 37, 1, '45'),
(77, 140, 1572942498, 5, 1572942519, 5, 37, 1, '45'),
(78, 140, 1572942498, 5, 1572942519, 5, 37, 2, 'เ้เ้เ'),
(79, 140, 1572942519, 5, NULL, NULL, 37, 1, '45');

-- --------------------------------------------------------

--
-- Table structure for table `log-fertilizer`
--

CREATE TABLE `log-fertilizer` (
  `ID` int(11) NOT NULL,
  `LOGloginID` int(11) NOT NULL,
  `StartT` int(11) NOT NULL,
  `StartID` int(11) NOT NULL,
  `EndT` int(11) DEFAULT NULL,
  `EndID` int(11) DEFAULT NULL,
  `DIMfertID` int(11) NOT NULL,
  `StartDD` int(11) NOT NULL,
  `StartMM` int(11) NOT NULL,
  `EndDD` int(11) NOT NULL,
  `EndMM` int(11) NOT NULL,
  `Usage` enum('1','2','3') NOT NULL,
  `EQ1` float NOT NULL,
  `EQ2` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `log-fertilizer`
--

INSERT INTO `log-fertilizer` (`ID`, `LOGloginID`, `StartT`, `StartID`, `EndT`, `EndID`, `DIMfertID`, `StartDD`, `StartMM`, `EndDD`, `EndMM`, `Usage`, `EQ1`, `EQ2`) VALUES
(2, 5, 1572877376, 2, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(3, 5, 1572877482, 2, 1572932947, 0, 3, 1, 1, 31, 12, '1', 0, 0),
(4, 5, 1572877506, 2, 1572932947, 0, 3, 1, 1, 31, 12, '1', 0, 0),
(5, 5, 1572877521, 2, 1572932947, 0, 3, 1, 1, 31, 12, '1', 0, 0),
(6, 5, 1572877730, 2, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(7, 5, 1572877749, 2, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(8, 5, 1572877767, 2, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(9, 5, 1572877775, 2, 1572932947, 0, 3, 1, 1, 31, 12, '1', 0, 0),
(10, 5, 1572877782, 2, 1572932947, 0, 3, 1, 1, 31, 12, '1', 0, 0),
(11, 5, 1572877829, 2, 1572932947, 0, 3, 1, 1, 31, 12, '1', 0, 0),
(12, 5, 1572877868, 2, 1572932947, 0, 3, 1, 1, 31, 12, '1', 0, 0),
(13, 5, 1572877878, 2, 1572932947, 0, 3, 1, 1, 31, 12, '1', 0, 0),
(14, 5, 1572877888, 2, 1572932947, 0, 3, 1, 1, 31, 12, '1', 0, 0),
(15, 5, 1572877903, 2, 1572932947, 0, 3, 1, 1, 31, 12, '1', 0, 0),
(16, 5, 1572877997, 2, 1572932947, 0, 3, 1, 1, 31, 12, '1', 0, 0),
(17, 5, 1572878004, 2, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(18, 5, 1572878010, 2, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(19, 5, 1572878016, 2, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(20, 5, 1572878033, 2, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(21, 5, 1572878477, 2, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(22, 5, 1572878483, 2, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(23, 5, 1572878490, 2, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(24, 5, 1572878496, 2, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(25, 5, 1572878545, 2, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(26, 5, 1572878589, 2, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(27, 5, 1572878594, 2, 1572932947, 0, 3, 1, 1, 31, 12, '1', 0, 0),
(28, 5, 1572922329, 3, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(29, 5, 1572922393, 3, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(30, 5, 1572922636, 3, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(31, 5, 1572922683, 3, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(32, 5, 1572922700, 3, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(33, 5, 1572922806, 3, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(34, 5, 1572922855, 3, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(35, 5, 1572922922, 3, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(36, 5, 1572923058, 3, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(37, 5, 1572923256, 3, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(38, 5, 1572923507, 3, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(39, 5, 1572923671, 3, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(40, 5, 1572923778, 3, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(41, 5, 1572923794, 3, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(42, 5, 1572923840, 3, 1572923914, 0, 2, 1, 1, 31, 12, '1', 0, 0),
(43, 5, 1572923914, 3, 1572931394, 0, 4, 1, 1, 31, 12, '1', 0, 0),
(44, 5, 1572931394, 3, 1572931924, 0, 5, 1, 1, 31, 12, '1', 0, 0),
(45, 5, 1572931501, 3, 1572931924, 0, 5, 1, 1, 31, 12, '1', 0, 0),
(46, 5, 1572931924, 3, 1572932003, 0, 6, 14, 1, 31, 12, '1', 0, 0),
(47, 5, 1572932003, 3, 1572932303, 0, 7, 14, 1, 31, 12, '1', 0, 0),
(48, 5, 1572932303, 3, 1572932570, 0, 8, 14, 1, 31, 12, '1', 0, 0),
(49, 5, 1572932570, 3, 1572932618, 0, 10, 14, 1, 31, 12, '1', 0, 0),
(50, 5, 1572932618, 3, 1572932740, 0, 11, 14, 1, 31, 12, '1', 0, 0),
(51, 5, 1572932740, 3, 1572932782, 0, 12, 14, 1, 31, 12, '1', 0, 0),
(52, 5, 1572932782, 3, 1572932874, 0, 13, 14, 1, 31, 12, '1', 0, 0),
(53, 5, 1572932874, 3, 1572933482, 0, 14, 14, 1, 31, 12, '1', 0, 0),
(54, 5, 1572932947, 3, 1572933033, 0, 15, 1, 1, 31, 12, '1', 0, 0),
(55, 5, 1572933033, 3, 1572933066, 0, 16, 1, 1, 31, 12, '1', 0, 0),
(56, 5, 1572933066, 3, 1572933136, 0, 17, 1, 1, 31, 12, '1', 0, 0),
(57, 5, 1572933136, 3, 0, 0, 18, 1, 1, 31, 12, '1', 0, 0),
(58, 5, 1572933482, 3, 1572933583, 0, 19, 14, 1, 31, 12, '1', 0, 0),
(59, 5, 1572933583, 3, 1572933624, 0, 20, 14, 1, 31, 12, '1', 0, 0),
(60, 5, 1572933624, 3, 1572933693, 0, 21, 14, 1, 31, 12, '1', 0, 0),
(61, 5, 1572933693, 3, 1572933752, 0, 22, 14, 1, 31, 12, '1', 0, 0),
(62, 5, 1572933752, 3, 1572934461, 0, 23, 14, 1, 31, 12, '1', 0, 0),
(63, 5, 1572934461, 3, 1572934482, 0, 24, 14, 1, 31, 12, '1', 0, 0),
(64, 5, 1572934482, 3, 1572935970, 0, 25, 14, 1, 31, 12, '1', 0, 0),
(65, 5, 1572935970, 3, 1572937224, 0, 26, 14, 1, 31, 12, '1', 0, 0),
(66, 133, 1572937269, 5, 1572937467, 0, 28, 14, 1, 31, 12, '1', 0, 0),
(67, 133, 1572937467, 5, 0, 0, 29, 14, 1, 31, 12, '1', 0, 0),
(68, 134, 1572937676, 5, 0, 0, 30, 1, 1, 31, 12, '1', 0, 0),
(69, 134, 1572938161, 5, 1572938402, 5, 31, 1, 1, 31, 12, '1', 0, 0),
(70, 134, 1572938203, 5, 1572938402, 5, 31, 1, 1, 31, 12, '1', 0, 0),
(71, 134, 1572938297, 5, 1572938402, 5, 31, 1, 1, 31, 12, '1', 5, 0),
(72, 134, 1572938402, 5, 1572939856, 5, 31, 1, 1, 31, 12, '1', 55, 0),
(73, 136, 1572939856, 5, 1572939952, 5, 33, 1, 1, 31, 12, '1', 555, 0),
(74, 136, 1572939952, 5, 1572940076, 5, 34, 1, 1, 31, 12, '1', 555, 0),
(75, 136, 1572940076, 5, NULL, NULL, 34, 1, 1, 31, 12, '1', 555, 0),
(76, 136, 1572940131, 5, NULL, NULL, 35, 1, 1, 31, 12, '1', 0, 0),
(77, 140, 1572942016, 5, NULL, NULL, 36, 1, 1, 31, 12, '1', 0, 0),
(78, 140, 1572942275, 5, 1572942581, 5, 37, 1, 1, 31, 12, '1', 0, 0),
(79, 140, 1572942581, 5, 1572942601, 5, 37, 1, 1, 31, 12, '1', 0, 0),
(80, 140, 1572942601, 5, NULL, NULL, 37, 1, 1, 31, 12, '1', 5, 0);

-- --------------------------------------------------------

--
-- Table structure for table `log-icon`
--

CREATE TABLE `log-icon` (
  `ID` int(11) NOT NULL,
  `LOGloginID` int(11) NOT NULL,
  `StartT` int(11) NOT NULL,
  `StartID` int(11) NOT NULL,
  `EndT` int(11) DEFAULT NULL,
  `EndID` int(11) DEFAULT NULL,
  `DIMiconID` int(11) NOT NULL,
  `Type` int(11) NOT NULL,
  `FileName` varchar(20) NOT NULL,
  `Path` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `log-icon`
--

INSERT INTO `log-icon` (`ID`, `LOGloginID`, `StartT`, `StartID`, `EndT`, `EndID`, `DIMiconID`, `Type`, `FileName`, `Path`) VALUES
(3, 5, 1572877482, 2, 1572932948, 0, 3, 2, '1572877481.jpg', 'icon/fertilizer/5/1572877481.jpg'),
(4, 5, 1572922393, 3, 1572922683, 0, 2, 2, '1572877376.jpg', 'icon/fertilizer/4/1572922393.jpg'),
(5, 5, 1572922636, 3, 1572922683, 0, 2, 2, '1572877376.jpg', 'icon/fertilizer/4/1572922636.jpg'),
(6, 5, 1572922683, 3, 0, 0, 2, 2, '1572877376.jpg', 'icon/fertilizer/4/1572922683.jpg'),
(7, 5, 1572931292, 3, 1572931394, 0, 4, 2, '1572922683.jpg', 'icon/fertilizer/4/1572931292.jpg'),
(8, 5, 1572931394, 3, 1572931924, 0, 5, 2, '1572931292.jpg', 'icon/fertilizer/4/1572931394.jpg'),
(10, 5, 1572933021, 3, 1572933033, 0, 15, 2, '1572877481.jpg', 'icon/fertilizer/5/1572933021.jpg'),
(12, 5, 1572933049, 3, 1572933066, 0, 16, 2, '1572933021.jpg', 'icon/fertilizer/5/1572933049.jpg'),
(14, 5, 1572933115, 3, 1572933136, 0, 17, 2, '1572933049.jpg', 'icon/fertilizer/5/1572933115.jpg'),
(15, 5, 1572933123, 3, 1572933136, 0, 17, 2, '1572933115.jpg', 'icon/fertilizer/5/1572933123.jpg'),
(17, 5, 1572933584, 3, 1572933625, 0, 20, 2, '', ''),
(23, 5, 1572935672, 3, 1572935970, 0, 25, 2, '1572931394.jpg', 'icon/fertilizer/4/1572935671.jpg'),
(24, 5, 1572935680, 3, 0, 0, 18, 2, '1572933123.jpg', 'icon/fertilizer/5/1572935680.jpg'),
(25, 5, 1572935970, 3, 1572937224, 0, 26, 2, '', 'icon/fertilizer/4/1572935671.jpg'),
(29, 136, 1572939928, 5, 1572939953, 5, 33, 2, '1572938161.jpg', 'icon/fertilizer/7/1572939927.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `log-login`
--

CREATE TABLE `log-login` (
  `ID` int(11) NOT NULL,
  `AccessType` enum('W','M') NOT NULL,
  `DIMuserID` int(11) NOT NULL,
  `dbUTID` int(11) NOT NULL,
  `StartT` int(11) NOT NULL,
  `StartID` int(11) NOT NULL,
  `EndT` int(11) NOT NULL,
  `EndID` int(11) NOT NULL,
  `IP` varchar(15) NOT NULL,
  `hrs` int(11) NOT NULL,
  `mins` int(11) NOT NULL,
  `Total` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `log-login`
--

INSERT INTO `log-login` (`ID`, `AccessType`, `DIMuserID`, `dbUTID`, `StartT`, `StartID`, `EndT`, `EndID`, `IP`, `hrs`, `mins`, `Total`) VALUES
(18, 'W', 15, 1, 1524257894, 1, 254357521, 1, '142:52:421', 2, 12, 132),
(26, 'W', 16, 3, 1572846786, 4, 1572846786, 4, '127.0.0.1', 0, 0, 0),
(27, 'W', 16, 1, 1572846808, 4, 1572847054, 4, '127.0.0.1', 0, 4, 4),
(28, 'W', 16, 1, 1572853738, 4, 1572854483, 4, '127.0.0.1', 0, 13, 13),
(29, 'W', 17, 2, 1572854498, 4, 1572854545, 4, '127.0.0.1', 0, 1, 1),
(30, 'W', 17, 2, 1572854553, 4, 1572854601, 4, '127.0.0.1', 0, 1, 1),
(31, 'W', 16, 1, 1572854610, 4, 1572858112, 4, '127.0.0.1', 0, 58, 58),
(32, 'W', 16, 1, 1572865942, 4, 1572875049, 4, '127.0.0.1', 2, 32, 152),
(55, 'W', 16, 1, 1572875060, 4, 1572875136, 4, '127.0.0.1', 0, 1, 1),
(61, 'W', 16, 1, 1572875155, 4, 1572878836, 4, '127.0.0.1', 1, 2, 62),
(95, 'W', 16, 3, 1572879089, 4, 1572879089, 4, '127.0.0.1', 0, 0, 0),
(96, 'W', 16, 3, 1572879091, 4, 1572879091, 4, '127.0.0.1', 0, 0, 0),
(97, 'W', 16, 1, 1572879203, 4, 1572880610, 4, '127.0.0.1', 0, 23, 23),
(101, 'W', 16, 1, 1572880836, 4, 1572880883, 4, '127.0.0.1', 0, 1, 1),
(103, 'W', 16, 1, 1572881098, 4, 1572881112, 4, '127.0.0.1', 0, 1, 1),
(104, 'W', 16, 1, 1572881335, 4, 1572881354, 4, '127.0.0.1', 0, 1, 1),
(106, 'W', 16, 1, 1572881473, 4, 1572881484, 4, '127.0.0.1', 0, 0, 0),
(110, 'W', 16, 1, 1572882201, 4, 1572882213, 4, '127.0.0.1', 0, 0, 0),
(112, 'W', 16, 1, 1572882283, 4, 1572882298, 4, '127.0.0.1', 0, 0, 0),
(114, 'W', 16, 1, 1572882774, 4, 1572882785, 4, '127.0.0.1', 0, 1, 1),
(115, 'W', 16, 1, 1572882785, 4, 1572882816, 4, '127.0.0.1', 0, 0, 0),
(116, 'W', 16, 1, 1572882816, 4, 1572884465, 4, '127.0.0.1', 0, 28, 28),
(117, 'W', 16, 1, 1572884809, 4, 1572891013, 4, '127.0.0.1', 1, 44, 104),
(118, 'W', 16, 1, 1572921340, 5, 1572924336, 5, '127.0.0.1', 0, 50, 50),
(119, 'W', 16, 1, 1572924336, 5, 1572924576, 5, '127.0.0.1', 0, 4, 4),
(120, 'W', 16, 3, 1572935283, 5, 1572935311, 5, '::1', 0, 0, 0),
(121, 'W', 16, 1, 1572935318, 5, 1572935353, 5, '::1', 0, 1, 1),
(122, 'W', 16, 1, 1572935358, 5, 1572935377, 5, '::1', 0, 0, 0),
(123, 'W', 16, 2, 1572935386, 5, 1572935411, 5, '::1', 0, 1, 1),
(124, 'W', 16, 3, 1572935417, 5, 1572935425, 5, '::1', 0, 0, 0),
(125, 'W', 16, 1, 1572935425, 5, 1572935428, 5, '::1', 0, 0, 0),
(126, 'W', 16, 3, 1572935428, 5, 1572935432, 5, '::1', 0, 0, 0),
(127, 'W', 16, 1, 1572935433, 5, 1572935480, 5, '::1', 0, 1, 1),
(128, 'W', 16, 1, 1572935480, 5, 1572935511, 5, '::1', 0, 0, 0),
(129, 'W', 123, 3, 1572935810, 5, 1572935909, 5, '::1', 0, 2, 2),
(130, 'W', 123, 1, 1572935909, 5, 1572936014, 5, '::1', 0, 2, 2),
(131, 'W', 123, 3, 1572936014, 5, 1572936244, 5, '::1', 0, 4, 4),
(132, 'W', 16, 3, 1572936244, 5, 1572936575, 5, '::1', 0, 5, 5),
(133, 'W', 124, 1, 1572936576, 5, 1572937509, 5, '::1', 0, 16, 16),
(134, 'W', 124, 1, 1572937510, 5, 1572939599, 5, '::1', 0, 34, 34),
(135, 'W', 125, 3, 1572939614, 5, 1572939662, 5, '::1', 0, 1, 1),
(136, 'W', 125, 1, 1572939662, 5, 1572940190, 5, '::1', 0, 8, 8),
(137, 'W', 125, 3, 1572940190, 5, 1572940246, 5, '::1', 0, 1, 1),
(138, 'W', 125, 3, 1572940370, 5, 1572940478, 5, '::1', 0, 2, 2),
(139, 'W', 125, 1, 1572940478, 5, 1572940583, 5, '::1', 0, 2, 2),
(140, 'W', 125, 1, 1572940583, 5, 1572942942, 5, '::1', 0, 39, 39),
(141, 'W', 127, 3, 1572941111, 5, 1572941111, 5, '::1', 0, 0, 0),
(142, 'W', 125, 3, 1572942943, 5, 1572945415, 5, '::1', 0, 41, 41),
(143, 'W', 125, 1, 1572945415, 5, 1572945419, 5, '::1', 0, 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `log-password`
--

CREATE TABLE `log-password` (
  `ID` int(11) NOT NULL,
  `DIMuserID` int(11) NOT NULL,
  `LOGloginID` int(11) NOT NULL,
  `StartT` int(11) NOT NULL,
  `StartID` int(11) NOT NULL,
  `EndT` int(11) NOT NULL,
  `EndID` int(11) NOT NULL,
  `PWD` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `log-pest`
--

CREATE TABLE `log-pest` (
  `ID` int(11) NOT NULL,
  `DIMpestID` int(11) NOT NULL,
  `LOGloginID` int(11) NOT NULL,
  `StartT` int(11) NOT NULL,
  `StartID` int(11) NOT NULL,
  `EndT` int(11) NOT NULL,
  `EndID` int(11) NOT NULL,
  `NumPicChar` int(11) NOT NULL,
  `NumPicDanger` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `log-user`
--

CREATE TABLE `log-user` (
  `ID` int(11) NOT NULL,
  `DIMuserID` int(11) NOT NULL,
  `DIMdeptID` int(11) NOT NULL,
  `LOGloginID` int(11) NOT NULL,
  `StartT` int(11) NOT NULL,
  `StartID` int(11) NOT NULL,
  `EndT` int(11) NOT NULL,
  `EndID` int(11) NOT NULL,
  `IsAdmin` tinyint(1) NOT NULL,
  `IsResearch` tinyint(1) NOT NULL,
  `IsOperator` tinyint(1) NOT NULL,
  `IsFarmer` tinyint(1) NOT NULL,
  `IsBlock` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `main-menu-list`
--

CREATE TABLE `main-menu-list` (
  `ut-id` int(11) NOT NULL,
  `mm-mainmenu` int(11) NOT NULL,
  `mm-submenu` int(11) NOT NULL DEFAULT 0,
  `wm-id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `main-menu-list`
--

INSERT INTO `main-menu-list` (`ut-id`, `mm-mainmenu`, `mm-submenu`, `wm-id`) VALUES
(1, 6, 0, 1),
(2, 4, 0, 1),
(3, 8, 0, 1),
(4, 8, 0, 1),
(1, 1, 0, 2),
(2, 1, 0, 2),
(3, 1, 0, 2),
(4, 1, 0, 2),
(1, 2, 0, 3),
(1, 2, 1, 4),
(1, 2, 2, 5),
(1, 3, 0, 6),
(1, 4, 0, 7),
(1, 5, 0, 8),
(1, 5, 1, 9),
(1, 5, 2, 10),
(1, 5, 3, 11),
(1, 5, 4, 12),
(2, 2, 0, 13),
(3, 2, 0, 13),
(4, 2, 0, 13),
(2, 3, 0, 14),
(3, 3, 0, 14),
(4, 3, 0, 14),
(3, 4, 0, 15),
(4, 4, 0, 15),
(3, 5, 0, 16),
(4, 5, 0, 16),
(3, 6, 0, 17),
(4, 6, 0, 17),
(3, 7, 0, 18),
(4, 7, 0, 18),
(3, 7, 1, 19),
(4, 7, 1, 19),
(3, 7, 2, 20),
(4, 7, 2, 20),
(3, 7, 3, 21),
(4, 7, 3, 21),
(3, 7, 4, 22),
(4, 7, 4, 22),
(3, 7, 5, 23),
(4, 7, 5, 23);

-- --------------------------------------------------------

--
-- Table structure for table `system-code`
--

CREATE TABLE `system-code` (
  `id` int(11) NOT NULL,
  `code` varchar(6) CHARACTER SET utf8 NOT NULL,
  `name` varchar(100) CHARACTER SET utf8 NOT NULL,
  `note2` varchar(200) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `system-code`
--

INSERT INTO `system-code` (`id`, `code`, `name`, `note2`) VALUES
(1, '01111', 'ลบผู้ใช้ออกจากระบบ', 'del'),
(2, '01112', 'กู้คืนผู้ใช้เข้าสู่ระบบ', 'notdel'),
(3, '01113', 'อนุญาตให้ผู้ใช้ใช้งานได้ปกติ', 'unlocked'),
(4, '01114', 'ยกเลิกการเข้าใช้งานของผู้ใช้', 'locked');

-- --------------------------------------------------------

--
-- Table structure for table `user-type`
--

CREATE TABLE `user-type` (
  `UTID` int(11) NOT NULL,
  `UTName` varchar(50) CHARACTER SET utf8 NOT NULL,
  `Alias` varchar(20) CHARACTER SET utf8 NOT NULL,
  `Note` text CHARACTER SET utf8 DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `user-type`
--

INSERT INTO `user-type` (`UTID`, `UTName`, `Alias`, `Note`) VALUES
(1, 'ผู้ดูแลระบบ', 'Administrator', 'web'),
(2, 'นักวิจัย', 'Researcher', 'web'),
(3, 'พนักงานทั่วไป', 'Officer', 'web'),
(4, 'เกษตรกร', 'Farmer', 'mobile'),
(5, 'ผู้ช่วยเกษตรกร', 'Labor', 'mobile');

-- --------------------------------------------------------

--
-- Table structure for table `waterreport`
--

CREATE TABLE `waterreport` (
  `idWaterReport` int(11) NOT NULL,
  `date` datetime DEFAULT NULL,
  `datereport` datetime NOT NULL,
  `Farmer_idFarmer` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `web-menu`
--

CREATE TABLE `web-menu` (
  `wm-name` varchar(100) CHARACTER SET utf8 NOT NULL,
  `wm-alias` varchar(20) CHARACTER SET utf8 NOT NULL,
  `wm-page` varchar(150) NOT NULL,
  `wm-icon` varchar(25) DEFAULT NULL,
  `wm-note` varchar(200) CHARACTER SET utf8 DEFAULT NULL,
  `wm-id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `web-menu`
--

INSERT INTO `web-menu` (`wm-name`, `wm-alias`, `wm-page`, `wm-icon`, `wm-note`, `wm-id`) VALUES
('ออกจากระบบ', 'Logout', 'Logout.php', NULL, NULL, 1),
('บัญชีผู้ใช้', 'UserProfile', 'UserProfile.php', 'person', NULL, 2),
('การจัดการผู้ใช้', 'UserList', 'UserList.php', 'people', NULL, 3),
('รายชื่อผู้ใช้', 'OtherUsersList', 'OtherUsersList.php', NULL, NULL, 4),
('รายชื่อหน่วยงาน', 'DepartmentList', 'DepartmentList.php', NULL, NULL, 5),
('รายชื่อเกษตรกร', 'FarmerListAdmin', 'FarmerListAdmin.php', 'people', NULL, 6),
('รายชื่อปุ๋ย', 'FertilizerList', 'FertilizerList.php', 'local_florist', NULL, 7),
('การจัดการศัตรูพืช', 'PestList', 'PestList.php', 'bug_report', NULL, 8),
('รายชื่อแมลง', 'InsectList', 'InsectList.php', 'bug_report', NULL, 9),
('รายชื่อโรคพืช', 'DiseasesList', 'DiseasesList.php', 'nature', NULL, 10),
('รายชื่อวัชพืช', 'WeedList', 'WeedList.php', 'nature', NULL, 11),
('รายชื่อศัตรูพืชอื่นๆ', 'OtherPestList', 'OtherPestList.php', 'nature', NULL, 12),
('แผนที่การเกษตร', 'AgriMap', 'AgriMap.php', 'map', NULL, 13),
('ปฎิทินกิจกรรม', 'Calendar', 'Calendar.php', 'event_note', NULL, 14),
('สนทนา', 'Chat', 'Chat.php', 'chat', NULL, 15),
('รายชื่อเกษตรกร', 'FarmerList', 'FarmerList.php', 'people', NULL, 16),
('รายชื่อสวนปาล์มน้ำมัน', 'OilPalmAreaList', 'OilPalmAreaList.php', 'place', NULL, 17),
('กิจกรรมต่างๆ', 'Activity', 'Activity.php', 'local_activity', NULL, 18),
('ผลผลิตปาล์มน้ำมัน', 'OilPalmAreaVol', 'OilPalmAreaVol.php', NULL, NULL, 19),
('ให้ปุ๋ย', 'FertilizerUsageList', 'FertilizerUsageList.php', NULL, NULL, 20),
('ให้น้ำ', 'Water', 'Water.php', NULL, NULL, 21),
('ล้างคอขวด', 'CutBranch', 'CutBranch.php', NULL, NULL, 22),
('ตรวจพบศัตรูพืช', 'Pest', 'Pest.php', NULL, NULL, 23);

-- --------------------------------------------------------

--
-- Table structure for table `weedreport`
--

CREATE TABLE `weedreport` (
  `idWeed` int(11) NOT NULL,
  `date` datetime DEFAULT NULL,
  `datereport` datetime NOT NULL,
  `Farmer_idFarmer` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `db-coorfarm`
--
ALTER TABLE `db-coorfarm`
  ADD PRIMARY KEY (`FCID`),
  ADD UNIQUE KEY `FSID` (`FSID`,`Corner`);

--
-- Indexes for table `db-department`
--
ALTER TABLE `db-department`
  ADD PRIMARY KEY (`DID`),
  ADD UNIQUE KEY `Department` (`Department`),
  ADD UNIQUE KEY `Alias` (`Alias`);

--
-- Indexes for table `db-distrinct`
--
ALTER TABLE `db-distrinct`
  ADD PRIMARY KEY (`AD2ID`),
  ADD UNIQUE KEY `Distrinct` (`Distrinct`,`AD1ID`),
  ADD KEY `AD1ID` (`AD1ID`);

--
-- Indexes for table `db-emailtype`
--
ALTER TABLE `db-emailtype`
  ADD PRIMARY KEY (`ETID`),
  ADD UNIQUE KEY `Type` (`Type`);

--
-- Indexes for table `db-farm`
--
ALTER TABLE `db-farm`
  ADD PRIMARY KEY (`FMID`),
  ADD UNIQUE KEY `Name` (`Name`),
  ADD UNIQUE KEY `Alias` (`Alias`),
  ADD KEY `AD3ID` (`AD3ID`),
  ADD KEY `UFID` (`UFID`);

--
-- Indexes for table `db-farmer`
--
ALTER TABLE `db-farmer`
  ADD PRIMARY KEY (`UFID`),
  ADD UNIQUE KEY `Title` (`Title`,`FirstName`,`LastName`),
  ADD KEY `AD3ID` (`AD3ID`);

--
-- Indexes for table `db-fercondition`
--
ALTER TABLE `db-fercondition`
  ADD PRIMARY KEY (`FID`,`Order`),
  ADD UNIQUE KEY `FID` (`FID`,`Condition`);

--
-- Indexes for table `db-fertilizer`
--
ALTER TABLE `db-fertilizer`
  ADD PRIMARY KEY (`FID`),
  ADD UNIQUE KEY `Name` (`Name`);

--
-- Indexes for table `db-pestlist`
--
ALTER TABLE `db-pestlist`
  ADD PRIMARY KEY (`PID`),
  ADD UNIQUE KEY `Name` (`Name`),
  ADD UNIQUE KEY `Alias` (`Alias`),
  ADD KEY `PTID` (`PTID`);

--
-- Indexes for table `db-pesttype`
--
ALTER TABLE `db-pesttype`
  ADD PRIMARY KEY (`PTID`),
  ADD UNIQUE KEY `TypeTH` (`TypeTH`),
  ADD UNIQUE KEY `TypeEN` (`TypeEN`);

--
-- Indexes for table `db-province`
--
ALTER TABLE `db-province`
  ADD PRIMARY KEY (`AD1ID`),
  ADD UNIQUE KEY `Province` (`Province`);

--
-- Indexes for table `db-subdistrinct`
--
ALTER TABLE `db-subdistrinct`
  ADD PRIMARY KEY (`AD3ID`),
  ADD UNIQUE KEY `subDistrinct` (`subDistrinct`,`AD2ID`),
  ADD KEY `AD2ID` (`AD2ID`);

--
-- Indexes for table `db-subfarm`
--
ALTER TABLE `db-subfarm`
  ADD PRIMARY KEY (`FSID`),
  ADD UNIQUE KEY `Name` (`Name`),
  ADD UNIQUE KEY `Alias` (`Alias`),
  ADD KEY `AD3ID` (`AD3ID`),
  ADD KEY `FMID` (`FMID`);

--
-- Indexes for table `db-user`
--
ALTER TABLE `db-user`
  ADD PRIMARY KEY (`UID`),
  ADD UNIQUE KEY `Title` (`Title`,`FirstName`,`LastName`),
  ADD UNIQUE KEY `UserName` (`UserName`),
  ADD KEY `ETID` (`ETID`),
  ADD KEY `DID` (`DID`);

--
-- Indexes for table `dim-address`
--
ALTER TABLE `dim-address`
  ADD PRIMARY KEY (`ID`),
  ADD KEY `dbsubDID` (`dbsubDID`),
  ADD KEY `dbDistID` (`dbDistID`),
  ADD KEY `dbprovID` (`dbprovID`);

--
-- Indexes for table `dim-department`
--
ALTER TABLE `dim-department`
  ADD PRIMARY KEY (`ID`),
  ADD KEY `Department` (`Department`),
  ADD KEY `Alias` (`Alias`),
  ADD KEY `dbID` (`dbID`);

--
-- Indexes for table `dim-farm`
--
ALTER TABLE `dim-farm`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `IsFarm` (`IsFarm`,`dbID`,`Name`,`Alias`),
  ADD KEY `IsFarm_2` (`IsFarm`),
  ADD KEY `Name` (`Name`),
  ADD KEY `Alias` (`Alias`),
  ADD KEY `dbID` (`dbID`);

--
-- Indexes for table `dim-fertilizer`
--
ALTER TABLE `dim-fertilizer`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `Name` (`Name`,`Alias`),
  ADD KEY `Name_2` (`Name`),
  ADD KEY `Alias` (`Alias`),
  ADD KEY `dbID` (`dbID`);

--
-- Indexes for table `dim-pest`
--
ALTER TABLE `dim-pest`
  ADD PRIMARY KEY (`ID`),
  ADD KEY `Name` (`Name`),
  ADD KEY `Alias` (`Alias`),
  ADD KEY `TypeTH` (`TypeTH`),
  ADD KEY `dbpestLID` (`dbpestLID`),
  ADD KEY `dbpestTID` (`dbpestTID`);

--
-- Indexes for table `dim-time`
--
ALTER TABLE `dim-time`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `Date` (`Date`),
  ADD KEY `dd` (`dd`),
  ADD KEY `Day` (`Day`),
  ADD KEY `Week` (`Week`),
  ADD KEY `Season` (`Season`),
  ADD KEY `Month` (`Month`),
  ADD KEY `Quarter` (`Quarter`),
  ADD KEY `Year1` (`Year1`),
  ADD KEY `Year2` (`Year2`);

--
-- Indexes for table `dim-user`
--
ALTER TABLE `dim-user`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `dbID` (`dbID`,`Type`,`Title`,`FullName`,`Alias`,`FormalID`),
  ADD KEY `Type` (`Type`),
  ADD KEY `FullName` (`FullName`),
  ADD KEY `Alias` (`Alias`),
  ADD KEY `FormalID` (`FormalID`);

--
-- Indexes for table `log-department`
--
ALTER TABLE `log-department`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `DIMdeptID` (`DIMdeptID`,`StartT`,`EndT`),
  ADD KEY `LOGloginID` (`LOGloginID`),
  ADD KEY `StartID` (`StartID`),
  ADD KEY `EndID` (`EndID`);

--
-- Indexes for table `log-email`
--
ALTER TABLE `log-email`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `DIMuserID` (`DIMuserID`,`StartT`,`EndT`),
  ADD UNIQUE KEY `DIMuserID_2` (`DIMuserID`,`FullEmail`),
  ADD KEY `Type` (`Type`),
  ADD KEY `LOGloginID` (`LOGloginID`),
  ADD KEY `StartID` (`StartID`),
  ADD KEY `EndID` (`EndID`),
  ADD KEY `dbETID` (`dbETID`);

--
-- Indexes for table `log-farm`
--
ALTER TABLE `log-farm`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `StartT` (`StartT`,`EndT`,`DIMownerID`,`DIMfarmID`,`DIMSubfID`,`DIMaddrID`),
  ADD KEY `Latitude` (`Latitude`),
  ADD KEY `Longitude` (`Longitude`),
  ADD KEY `NumSubFarm` (`NumSubFarm`),
  ADD KEY `NumTree` (`NumTree`),
  ADD KEY `AreaRai` (`AreaRai`),
  ADD KEY `AreaNgan` (`AreaNgan`),
  ADD KEY `AreaWa` (`AreaWa`),
  ADD KEY `AreaTotal` (`AreaTotal`),
  ADD KEY `LOGloginID` (`LOGloginID`),
  ADD KEY `StartID` (`StartID`),
  ADD KEY `EndID` (`EndID`),
  ADD KEY `DIMownerID` (`DIMownerID`),
  ADD KEY `DIMfarmID` (`DIMfarmID`),
  ADD KEY `DIMSubfID` (`DIMSubfID`),
  ADD KEY `DIMaddrID` (`DIMaddrID`);

--
-- Indexes for table `log-farmer`
--
ALTER TABLE `log-farmer`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `DIMuserID` (`DIMuserID`,`StartT`,`EndT`,`DIMaddrID`),
  ADD KEY `LOGloginID` (`LOGloginID`),
  ADD KEY `StartID` (`StartID`),
  ADD KEY `EndID` (`EndID`),
  ADD KEY `DIMaddrID` (`DIMaddrID`);

--
-- Indexes for table `log-fercondition`
--
ALTER TABLE `log-fercondition`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `StartT` (`StartT`,`EndT`,`DIMfertID`,`Order`),
  ADD KEY `LOGloginID` (`LOGloginID`),
  ADD KEY `StartID` (`StartID`),
  ADD KEY `EndID` (`EndID`),
  ADD KEY `DIMfertID` (`DIMfertID`);

--
-- Indexes for table `log-fertilizer`
--
ALTER TABLE `log-fertilizer`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `StartT` (`StartT`,`EndT`,`DIMfertID`),
  ADD KEY `StartDD` (`StartDD`),
  ADD KEY `StartMM` (`StartMM`),
  ADD KEY `EndDD` (`EndDD`),
  ADD KEY `EndMM` (`EndMM`),
  ADD KEY `Usage` (`Usage`),
  ADD KEY `EQ1` (`EQ1`),
  ADD KEY `EQ2` (`EQ2`),
  ADD KEY `LOGloginID` (`LOGloginID`),
  ADD KEY `StartID` (`StartID`),
  ADD KEY `EndID` (`EndID`),
  ADD KEY `DIMfertID` (`DIMfertID`);

--
-- Indexes for table `log-icon`
--
ALTER TABLE `log-icon`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `FileName` (`FileName`,`Path`),
  ADD UNIQUE KEY `StartT` (`StartT`,`EndT`,`DIMiconID`,`Type`),
  ADD KEY `Path` (`Path`),
  ADD KEY `FileName_2` (`FileName`),
  ADD KEY `LOGloginID` (`LOGloginID`),
  ADD KEY `StartID` (`StartID`),
  ADD KEY `EndID` (`EndID`),
  ADD KEY `DIMiconID` (`DIMiconID`);

--
-- Indexes for table `log-login`
--
ALTER TABLE `log-login`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `DIMuserID` (`DIMuserID`,`StartT`,`EndT`),
  ADD UNIQUE KEY `AccessType` (`AccessType`,`StartT`,`EndT`,`IP`),
  ADD KEY `mins` (`mins`),
  ADD KEY `hrs` (`hrs`),
  ADD KEY `hrs_2` (`hrs`,`mins`),
  ADD KEY `StartID` (`StartID`),
  ADD KEY `EndID` (`EndID`),
  ADD KEY `log-login_ibfk_4` (`dbUTID`);

--
-- Indexes for table `log-password`
--
ALTER TABLE `log-password`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `DIMuserID` (`DIMuserID`,`StartT`,`EndT`),
  ADD UNIQUE KEY `DIMuserID_2` (`DIMuserID`,`PWD`),
  ADD KEY `LOGloginID` (`LOGloginID`),
  ADD KEY `StartID` (`StartID`),
  ADD KEY `EndID` (`EndID`);

--
-- Indexes for table `log-pest`
--
ALTER TABLE `log-pest`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `DIMpestID` (`DIMpestID`,`StartT`,`EndT`),
  ADD KEY `NumPicChar` (`NumPicChar`),
  ADD KEY `NumPicDanger` (`NumPicDanger`),
  ADD KEY `LOGloginID` (`LOGloginID`),
  ADD KEY `StartID` (`StartID`),
  ADD KEY `EndID` (`EndID`);

--
-- Indexes for table `log-user`
--
ALTER TABLE `log-user`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `DIMuserID` (`DIMuserID`,`DIMdeptID`,`StartT`,`EndT`),
  ADD KEY `IsAdmin` (`IsAdmin`),
  ADD KEY `IsResearch` (`IsResearch`),
  ADD KEY `IsOperator` (`IsOperator`),
  ADD KEY `IsFarmer` (`IsFarmer`),
  ADD KEY `IsBlock` (`IsBlock`),
  ADD KEY `DIMdeptID` (`DIMdeptID`),
  ADD KEY `LOGloginID` (`LOGloginID`),
  ADD KEY `StartID` (`StartID`),
  ADD KEY `EndID` (`EndID`);

--
-- Indexes for table `main-menu-list`
--
ALTER TABLE `main-menu-list`
  ADD PRIMARY KEY (`ut-id`,`mm-mainmenu`,`mm-submenu`),
  ADD KEY `wm-id` (`wm-id`),
  ADD KEY `wm-id_2` (`wm-id`),
  ADD KEY `wm-id_3` (`wm-id`);

--
-- Indexes for table `system-code`
--
ALTER TABLE `system-code`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user-type`
--
ALTER TABLE `user-type`
  ADD PRIMARY KEY (`UTID`),
  ADD UNIQUE KEY `u-name` (`UTName`),
  ADD UNIQUE KEY `UT-Alias` (`Alias`);

--
-- Indexes for table `waterreport`
--
ALTER TABLE `waterreport`
  ADD PRIMARY KEY (`idWaterReport`),
  ADD KEY `fk_WaterReport_Farmer1_idx` (`Farmer_idFarmer`);

--
-- Indexes for table `web-menu`
--
ALTER TABLE `web-menu`
  ADD PRIMARY KEY (`wm-id`);

--
-- Indexes for table `weedreport`
--
ALTER TABLE `weedreport`
  ADD PRIMARY KEY (`idWeed`),
  ADD KEY `fk_Weed_Farmer1_idx` (`Farmer_idFarmer`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `db-coorfarm`
--
ALTER TABLE `db-coorfarm`
  MODIFY `FCID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `db-department`
--
ALTER TABLE `db-department`
  MODIFY `DID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT for table `db-distrinct`
--
ALTER TABLE `db-distrinct`
  MODIFY `AD2ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=929;

--
-- AUTO_INCREMENT for table `db-emailtype`
--
ALTER TABLE `db-emailtype`
  MODIFY `ETID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `db-farm`
--
ALTER TABLE `db-farm`
  MODIFY `FMID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `db-farmer`
--
ALTER TABLE `db-farmer`
  MODIFY `UFID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `db-fertilizer`
--
ALTER TABLE `db-fertilizer`
  MODIFY `FID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `db-pestlist`
--
ALTER TABLE `db-pestlist`
  MODIFY `PID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `db-pesttype`
--
ALTER TABLE `db-pesttype`
  MODIFY `PTID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `db-province`
--
ALTER TABLE `db-province`
  MODIFY `AD1ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=78;

--
-- AUTO_INCREMENT for table `db-subdistrinct`
--
ALTER TABLE `db-subdistrinct`
  MODIFY `AD3ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2352;

--
-- AUTO_INCREMENT for table `db-subfarm`
--
ALTER TABLE `db-subfarm`
  MODIFY `FSID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `db-user`
--
ALTER TABLE `db-user`
  MODIFY `UID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=93;

--
-- AUTO_INCREMENT for table `dim-address`
--
ALTER TABLE `dim-address`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `dim-department`
--
ALTER TABLE `dim-department`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=116;

--
-- AUTO_INCREMENT for table `dim-farm`
--
ALTER TABLE `dim-farm`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `dim-fertilizer`
--
ALTER TABLE `dim-fertilizer`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;

--
-- AUTO_INCREMENT for table `dim-pest`
--
ALTER TABLE `dim-pest`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `dim-time`
--
ALTER TABLE `dim-time`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `dim-user`
--
ALTER TABLE `dim-user`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=128;

--
-- AUTO_INCREMENT for table `log-department`
--
ALTER TABLE `log-department`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=105;

--
-- AUTO_INCREMENT for table `log-email`
--
ALTER TABLE `log-email`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `log-farm`
--
ALTER TABLE `log-farm`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `log-farmer`
--
ALTER TABLE `log-farmer`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `log-fercondition`
--
ALTER TABLE `log-fercondition`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=80;

--
-- AUTO_INCREMENT for table `log-fertilizer`
--
ALTER TABLE `log-fertilizer`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;

--
-- AUTO_INCREMENT for table `log-icon`
--
ALTER TABLE `log-icon`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- AUTO_INCREMENT for table `log-login`
--
ALTER TABLE `log-login`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=144;

--
-- AUTO_INCREMENT for table `log-password`
--
ALTER TABLE `log-password`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `log-pest`
--
ALTER TABLE `log-pest`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `log-user`
--
ALTER TABLE `log-user`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `system-code`
--
ALTER TABLE `system-code`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `user-type`
--
ALTER TABLE `user-type`
  MODIFY `UTID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `waterreport`
--
ALTER TABLE `waterreport`
  MODIFY `idWaterReport` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `web-menu`
--
ALTER TABLE `web-menu`
  MODIFY `wm-id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT for table `weedreport`
--
ALTER TABLE `weedreport`
  MODIFY `idWeed` int(11) NOT NULL AUTO_INCREMENT;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `db-coorfarm`
--
ALTER TABLE `db-coorfarm`
  ADD CONSTRAINT `db-coorfarm_ibfk_1` FOREIGN KEY (`FSID`) REFERENCES `db-subfarm` (`FSID`);

--
-- Constraints for table `db-distrinct`
--
ALTER TABLE `db-distrinct`
  ADD CONSTRAINT `db-distrinct_ibfk_1` FOREIGN KEY (`AD1ID`) REFERENCES `db-province` (`AD1ID`);

--
-- Constraints for table `db-farm`
--
ALTER TABLE `db-farm`
  ADD CONSTRAINT `db-farm_ibfk_1` FOREIGN KEY (`AD3ID`) REFERENCES `db-subdistrinct` (`AD3ID`),
  ADD CONSTRAINT `db-farm_ibfk_2` FOREIGN KEY (`UFID`) REFERENCES `db-farmer` (`UFID`);

--
-- Constraints for table `db-farmer`
--
ALTER TABLE `db-farmer`
  ADD CONSTRAINT `db-farmer_ibfk_1` FOREIGN KEY (`AD3ID`) REFERENCES `db-subdistrinct` (`AD3ID`);

--
-- Constraints for table `db-fercondition`
--
ALTER TABLE `db-fercondition`
  ADD CONSTRAINT `db-fercondition_ibfk_1` FOREIGN KEY (`FID`) REFERENCES `db-fertilizer` (`FID`);

--
-- Constraints for table `db-pestlist`
--
ALTER TABLE `db-pestlist`
  ADD CONSTRAINT `db-pestlist_ibfk_1` FOREIGN KEY (`PTID`) REFERENCES `db-pesttype` (`PTID`);

--
-- Constraints for table `db-subdistrinct`
--
ALTER TABLE `db-subdistrinct`
  ADD CONSTRAINT `db-subdistrinct_ibfk_1` FOREIGN KEY (`AD2ID`) REFERENCES `db-distrinct` (`AD2ID`);

--
-- Constraints for table `db-subfarm`
--
ALTER TABLE `db-subfarm`
  ADD CONSTRAINT `db-subfarm_ibfk_1` FOREIGN KEY (`AD3ID`) REFERENCES `db-subdistrinct` (`AD3ID`),
  ADD CONSTRAINT `db-subfarm_ibfk_2` FOREIGN KEY (`FMID`) REFERENCES `db-farm` (`FMID`);

--
-- Constraints for table `db-user`
--
ALTER TABLE `db-user`
  ADD CONSTRAINT `db-user_ibfk_1` FOREIGN KEY (`ETID`) REFERENCES `db-emailtype` (`ETID`),
  ADD CONSTRAINT `db-user_ibfk_2` FOREIGN KEY (`DID`) REFERENCES `db-department` (`DID`);

--
-- Constraints for table `dim-address`
--
ALTER TABLE `dim-address`
  ADD CONSTRAINT `dim-address_ibfk_1` FOREIGN KEY (`dbsubDID`) REFERENCES `db-subdistrinct` (`AD3ID`),
  ADD CONSTRAINT `dim-address_ibfk_2` FOREIGN KEY (`dbDistID`) REFERENCES `db-distrinct` (`AD2ID`),
  ADD CONSTRAINT `dim-address_ibfk_3` FOREIGN KEY (`dbprovID`) REFERENCES `db-province` (`AD1ID`);

--
-- Constraints for table `dim-farm`
--
ALTER TABLE `dim-farm`
  ADD CONSTRAINT `dim-farm_ibfk_1` FOREIGN KEY (`dbID`) REFERENCES `db-farm` (`FMID`),
  ADD CONSTRAINT `dim-farm_ibfk_2` FOREIGN KEY (`dbID`) REFERENCES `db-subfarm` (`FSID`);

--
-- Constraints for table `dim-pest`
--
ALTER TABLE `dim-pest`
  ADD CONSTRAINT `dim-pest_ibfk_1` FOREIGN KEY (`dbpestLID`) REFERENCES `db-pestlist` (`PID`),
  ADD CONSTRAINT `dim-pest_ibfk_2` FOREIGN KEY (`dbpestTID`) REFERENCES `db-pesttype` (`PTID`);

--
-- Constraints for table `log-department`
--
ALTER TABLE `log-department`
  ADD CONSTRAINT `log-department_ibfk_1` FOREIGN KEY (`DIMdeptID`) REFERENCES `dim-department` (`ID`),
  ADD CONSTRAINT `log-department_ibfk_2` FOREIGN KEY (`LOGloginID`) REFERENCES `log-login` (`ID`),
  ADD CONSTRAINT `log-department_ibfk_3` FOREIGN KEY (`StartID`) REFERENCES `dim-time` (`ID`),
  ADD CONSTRAINT `log-department_ibfk_4` FOREIGN KEY (`EndID`) REFERENCES `dim-time` (`ID`);

--
-- Constraints for table `log-email`
--
ALTER TABLE `log-email`
  ADD CONSTRAINT `log-email_ibfk_1` FOREIGN KEY (`DIMuserID`) REFERENCES `dim-user` (`ID`),
  ADD CONSTRAINT `log-email_ibfk_2` FOREIGN KEY (`LOGloginID`) REFERENCES `log-login` (`ID`),
  ADD CONSTRAINT `log-email_ibfk_3` FOREIGN KEY (`StartID`) REFERENCES `dim-time` (`ID`),
  ADD CONSTRAINT `log-email_ibfk_4` FOREIGN KEY (`EndID`) REFERENCES `dim-time` (`ID`),
  ADD CONSTRAINT `log-email_ibfk_5` FOREIGN KEY (`dbETID`) REFERENCES `db-emailtype` (`ETID`);

--
-- Constraints for table `log-farm`
--
ALTER TABLE `log-farm`
  ADD CONSTRAINT `log-farm_ibfk_1` FOREIGN KEY (`LOGloginID`) REFERENCES `log-login` (`ID`),
  ADD CONSTRAINT `log-farm_ibfk_2` FOREIGN KEY (`StartID`) REFERENCES `dim-time` (`ID`),
  ADD CONSTRAINT `log-farm_ibfk_3` FOREIGN KEY (`EndID`) REFERENCES `dim-time` (`ID`),
  ADD CONSTRAINT `log-farm_ibfk_4` FOREIGN KEY (`DIMownerID`) REFERENCES `dim-user` (`ID`),
  ADD CONSTRAINT `log-farm_ibfk_5` FOREIGN KEY (`DIMfarmID`) REFERENCES `dim-farm` (`ID`),
  ADD CONSTRAINT `log-farm_ibfk_6` FOREIGN KEY (`DIMSubfID`) REFERENCES `dim-farm` (`ID`),
  ADD CONSTRAINT `log-farm_ibfk_7` FOREIGN KEY (`DIMaddrID`) REFERENCES `dim-address` (`ID`);

--
-- Constraints for table `log-farmer`
--
ALTER TABLE `log-farmer`
  ADD CONSTRAINT `log-farmer_ibfk_1` FOREIGN KEY (`DIMuserID`) REFERENCES `dim-user` (`ID`),
  ADD CONSTRAINT `log-farmer_ibfk_2` FOREIGN KEY (`LOGloginID`) REFERENCES `log-login` (`ID`),
  ADD CONSTRAINT `log-farmer_ibfk_3` FOREIGN KEY (`StartID`) REFERENCES `dim-time` (`ID`),
  ADD CONSTRAINT `log-farmer_ibfk_4` FOREIGN KEY (`EndID`) REFERENCES `dim-time` (`ID`),
  ADD CONSTRAINT `log-farmer_ibfk_5` FOREIGN KEY (`DIMaddrID`) REFERENCES `dim-address` (`ID`);

--
-- Constraints for table `log-login`
--
ALTER TABLE `log-login`
  ADD CONSTRAINT `log-login_ibfk_1` FOREIGN KEY (`DIMuserID`) REFERENCES `dim-user` (`ID`),
  ADD CONSTRAINT `log-login_ibfk_2` FOREIGN KEY (`StartID`) REFERENCES `dim-time` (`ID`),
  ADD CONSTRAINT `log-login_ibfk_3` FOREIGN KEY (`EndID`) REFERENCES `dim-time` (`ID`),
  ADD CONSTRAINT `log-login_ibfk_4` FOREIGN KEY (`dbUTID`) REFERENCES `user-type` (`UTID`);

--
-- Constraints for table `log-password`
--
ALTER TABLE `log-password`
  ADD CONSTRAINT `log-password_ibfk_1` FOREIGN KEY (`DIMuserID`) REFERENCES `dim-user` (`ID`),
  ADD CONSTRAINT `log-password_ibfk_2` FOREIGN KEY (`LOGloginID`) REFERENCES `log-login` (`ID`),
  ADD CONSTRAINT `log-password_ibfk_3` FOREIGN KEY (`StartID`) REFERENCES `dim-time` (`ID`),
  ADD CONSTRAINT `log-password_ibfk_4` FOREIGN KEY (`EndID`) REFERENCES `dim-time` (`ID`);

--
-- Constraints for table `log-pest`
--
ALTER TABLE `log-pest`
  ADD CONSTRAINT `log-pest_ibfk_1` FOREIGN KEY (`DIMpestID`) REFERENCES `dim-pest` (`ID`),
  ADD CONSTRAINT `log-pest_ibfk_2` FOREIGN KEY (`LOGloginID`) REFERENCES `log-login` (`ID`),
  ADD CONSTRAINT `log-pest_ibfk_3` FOREIGN KEY (`StartID`) REFERENCES `dim-time` (`ID`),
  ADD CONSTRAINT `log-pest_ibfk_4` FOREIGN KEY (`EndID`) REFERENCES `dim-time` (`ID`);

--
-- Constraints for table `log-user`
--
ALTER TABLE `log-user`
  ADD CONSTRAINT `log-user_ibfk_1` FOREIGN KEY (`DIMuserID`) REFERENCES `dim-user` (`ID`),
  ADD CONSTRAINT `log-user_ibfk_2` FOREIGN KEY (`DIMdeptID`) REFERENCES `dim-department` (`ID`),
  ADD CONSTRAINT `log-user_ibfk_3` FOREIGN KEY (`LOGloginID`) REFERENCES `log-login` (`ID`),
  ADD CONSTRAINT `log-user_ibfk_4` FOREIGN KEY (`StartID`) REFERENCES `dim-time` (`ID`),
  ADD CONSTRAINT `log-user_ibfk_5` FOREIGN KEY (`EndID`) REFERENCES `dim-time` (`ID`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
